[{"id":1,"name":"xia","introduction":"The establishment of the Xia Dynasty (21st - 17th century BC), is an important milestone in the history of Chinese civilization, and marks the end of the Primitive Society, and the beginning of the Class Society. It is the first dynasty in Chinese history, and lasted nearly 500 years including the reigns of 17 emperors.","startYear":-2070,"endYear":-1600,"chinese":0,"enable":1,"totalPeriod":2,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":30,"name":"Leisure in the Tang","description":"Much more than earlier periods, the Tang era was renowned for the time reserved for leisure activity, especially for those in the upper classes.[169] Many outdoor sports and activities were enjoyed during the Tang, including archery,[170] hunting,[171] horse polo,[172] cuju football,[173] cockfighting,[174] and even tug of war.[175] Government officials were granted vacations during their tenure in office. Officials were granted 30 days off every three years to visit their parents if they lived 1,000 mi (1,600 km) away, or 15 days off if the parents lived more than 167 mi (269 km) away (travel time not included).[169] Officials were granted nine days of vacation time for weddings of a son or daughter, and either five, three, or one days/day off for the nuptials of close relatives (travel time not included).[169] Officials also received a total of three days off for their son's capping initiation rite into manhood, and one day off for the ceremony of initiation rite of a close relative's son.","editDateTime":"2013-10-10 20:49:49","resourceCategoryId":1,"dynastyId":1,"x":407,"y":455,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":-1},{"id":49,"name":"Traditional history","description":"The Xia Dynasty was described in classic texts such as the Classic of History (Shujing), the Bamboo Annals, and the Records of the Grand Historian (Shiji) by Sima Qian. It has been documented that the tribe that founded the dynasty was the Huaxia, who were the ancestral people of the Han Chinese.","editDateTime":"2013-11-23 12:22:33","resourceCategoryId":1,"dynastyId":1,"x":483,"y":368,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":-1},{"id":51,"name":"The Legend of The Yellow Emperor","description":"Since the day he was born, The Yellow Emperor had a supernatural gift. Already as a baby he was able to talk, and he developed his skills with great speed. He grew up to be a frank and hard-working man, and by the time he reached his age as a mature adult, The Yellow Emperor had a sharp and open mind. He lived in turbulent times, where warlords fought amongst themselves and made the people suffer. The Yellow Emperor developed skills in warcraft and allied himself with powerful lords to create peaceful surroundings for the people. When The Emperor was forced to wage war, he had a purpose. His greatest enemy was Yang Di, and in the battles at Banquan the Yellow Emperor often used wild animals, such as bears, tigers and leopards to defend himself. After the third battle he gained victory, and he had then secured major parts of North-China. His kingdom was passed on through several generations, until The Great Yao received the throne.","editDateTime":"2013-12-04 22:36:02","resourceCategoryId":1,"dynastyId":1,"x":515,"y":465,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":-1},{"id":52,"name":"The Great Rulers","description":"Yao was probarly well-known for his remarkable choice of successor. He was quite dissatisfied with the thought of his son as the heir to the throne, and he was advised by the most skilful advisers of the kingdom to choose a successor among the people. There was a young man among the crowd, his name was Yu Shun. Shun was the son of a blind man. His father was a crimminal, his mother was dishonest and his younger brother was insolent. But in hope for restoring the family's honor and to prevent his parents from loosing face, he had gradually managed to get a hold of his family. Yao decided to put this young man through a test to see if he was qualified enough to rule his kingdom when the time came. Emperor Yao let Shun marry two of his daughters and he also gave him the authority to govern parts of the country. Shun did a remarkable work and the emperor was quite pleased with him. The people praised Shun and wanted to to have him as their emperor, and so Yao decided to carry through the people's wishes and concluded with that it was the will of God that had manifested in this decision. Yu Shun then ascended the emperor's throne.","editDateTime":"2013-12-04 22:36:46","resourceCategoryId":1,"dynastyId":1,"x":384,"y":412,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":-1},{"id":53,"name":"Origins and early development","description":"According to ancient Chinese texts, before the Xia Dynasty was established, battles were frequent between the Xia tribe and Chi You's tribe. The Xia tribe slowly developed around the time of Zhuanxu, one of the legendary Five Emperors. The Records of the Grand Historian and the Classic of Rites say that Yu the Great is the grandson of Zhuanxu, but there are also other records, like Ban Gu, that say Yu is the fifth generation of Zhuanxu. Based on this, it is possible that the people of the Xia clan are descendants of Zhuanxu.","editDateTime":"2013-12-04 22:38:51","resourceCategoryId":1,"dynastyId":1,"x":587,"y":360,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":-1},{"id":58,"name":"Dayu handle flood","description":"assets/data/images/xia_dayuzhishui.jpg","editDateTime":"2013-12-04 22:49:56","resourceCategoryId":1,"dynastyId":1,"x":567,"y":434,"resourceTypeId":2,"iconName":"icon_history","dynastyPeriod":-1},{"id":61,"name":"The Xia Dynasty","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-04 23:08:16","resourceCategoryId":1,"dynastyId":1,"x":432,"y":400,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":-1}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":56,"name":"Xia society","description":"there were no words to record the events of Xia dynasty, most of the information of Xia was learned from some ancient record, including the remains of the king, officials and the prison conditions. In recent years, many huge palace, mausoleum and bronze have been unearthed. They also reflected from another side the politics, economic, cultural and life. This help people learn more about the first and special age in China's history. As the first prehistoric country in China mainland, Xia dynasty is an important dinasty with great history research. It's rich culture plays a important role in the culture of China and the whole history of China.","editDateTime":"2013-12-04 22:48:01","resourceCategoryId":2,"dynastyId":1,"x":595,"y":331,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":-1},{"id":59,"name":"The problem of flooding","description":"The problem of flooding had always plagued the people of China since time immemorial. The story begins with Gun, the father of Yu.During Gun’s reign, the Yellow River frequently flooded the lands, causing vast amounts of agriculture damage and losses. Gun was appointed by Yao, one of the five rulers in the Xia era, to stop the flooding. Although Gun strenuously attempted to stop the flooding that lasted for nine years, he failed because the floods were just too much for him to handle. Yao executed Gun for his failure.Partly due to his failures to control and stop the flooding, Yao himself then gave thethrone to his son, Shun, reputed to be a highly respected, but sometimes ruthless leader. Shun then appointed Gun’s son, Yu, to finish his father’s task which was to stop the flooding. Yu studied his own father’s mistakes, and realized that it would be a huge undertaking but he had a plan.","editDateTime":"2013-12-04 22:52:03","resourceCategoryId":2,"dynastyId":1,"x":472,"y":427,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":-1},{"id":54,"name":"The rules of Xia Dynasty","description":"assets/data/images/xia_rules.jpg","editDateTime":"2013-12-04 22:44:05","resourceCategoryId":2,"dynastyId":1,"x":548,"y":400,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":-1}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[{"id":50,"name":"Ding","description":"assets/data/images/xia_culture1.jpg","editDateTime":"2013-11-23 12:25:14","resourceCategoryId":3,"dynastyId":1,"x":503,"y":420,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":-1},{"id":57,"name":"Jia gu wen","description":"assets/data/images/xia_jiaguwen.jpg","editDateTime":"2013-12-04 22:48:51","resourceCategoryId":3,"dynastyId":1,"x":624,"y":434,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":-1}]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[{"id":60,"name":"Early Chinese Armies & Xia Dynasty Warfare","description":"Earliest Chinese armies consisted of conscripted peasants armed with simple bows, spears and stone maces. Eventually, a single family was able to dominate a portion of the Yellow River Valley. The history of the first of these dynasties, the Xia (2200 BCE-1600 BCE) is largely unknown and wrapped in mythology. In fact their existence is disputed by some, considered to be nothing more than a traditional legend. The regardless, the Chinese of the first steps of what would be a great civilization. Militarily they were the first in the Far East to use chariots and copper weapons, ideas brought by the steppe nomads from the Near East and Eurasian Steppes. ","editDateTime":"2013-12-04 22:55:07","resourceCategoryId":4,"dynastyId":1,"x":552,"y":490,"resourceTypeId":1,"iconName":"icon_military","dynastyPeriod":-1}]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[{"id":55,"name":"Zong ding","description":"assets/data/images/xia-zongding.jpg","editDateTime":"2013-12-04 22:45:58","resourceCategoryId":5,"dynastyId":1,"x":602,"y":379,"resourceTypeId":2,"iconName":"icon_technology","dynastyPeriod":-1}]},{"id":6,"name":"introduction","chinese":"介绍","resources":[]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":4,"period":0,"dynastyId":1,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":150,"mapZ":1.2},{"id":5,"period":1,"dynastyId":1,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":150,"mapZ":1.2}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"xia_0","audio":"assets/data/audios/xia_0.mp3","text":"The establishment of the Xia Dynasty (21st - 17th century BC)","state":1},{"id":1,"audioId":"xia_1","audio":"assets/data/audios/xia_1.mp3","text":" is an important milestone in the history of Chinese civilization","state":1},{"id":2,"audioId":"xia_2","audio":"assets/data/audios/xia_2.mp3","text":" and marks the end of the Primitive Society","state":1},{"id":3,"audioId":"xia_3","audio":"assets/data/audios/xia_3.mp3","text":" and the beginning of the Class Society","state":1},{"id":4,"audioId":"xia_4","audio":"assets/data/audios/xia_4.mp3","text":"It is the first dynasty in Chinese history","state":1},{"id":5,"audioId":"xia_5","audio":"assets/data/audios/xia_5.mp3","text":" and lasted nearly 500 years including the reigns of 17 emperors.","state":1}]},{"id":2,"name":"shang","introduction":"Shang was established by King Tang in 1675 BC after overthrowing the tyrannical rule of Jie, (Xia's last emperor). This dynasty lasted over 600 years and was led by 30 different emperors.","startYear":-1600,"endYear":-1046,"chinese":0,"enable":1,"totalPeriod":2,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":66,"name":"Appliqué in the form of taotie mask","description":"assets/data/images/shang_Applique.jpg","editDateTime":"2013-12-04 23:44:37","resourceCategoryId":1,"dynastyId":2,"x":651,"y":433,"resourceTypeId":2,"iconName":"icon_history","dynastyPeriod":-1},{"id":69,"name":"Lost City of Shang Part 1","description":"assets/data/videos/Lost_City_of_Shang_Part_1.webm","editDateTime":"2013-12-04 23:50:10","resourceCategoryId":1,"dynastyId":2,"x":592,"y":435,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":-1},{"id":70,"name":"Lost City of Shang Part 2","description":"assets/data/videos/Lost_City_of_Shang_Part_2.webm","editDateTime":"2013-12-04 23:51:09","resourceCategoryId":1,"dynastyId":2,"x":459,"y":416,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":-1},{"id":71,"name":"Lost City of Shang Part 4","description":"assets/data/videos/Lost_City_of_Shang_Part_4.webm","editDateTime":"2013-12-04 23:52:15","resourceCategoryId":1,"dynastyId":2,"x":539,"y":405,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":-1},{"id":72,"name":"Lost City of Shang Part 5","description":"assets/data/videos/Lost_City_of_Shang_Part_5.webm","editDateTime":"2013-12-04 23:52:44","resourceCategoryId":1,"dynastyId":2,"x":561,"y":431,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":-1},{"id":73,"name":"Shang Dynasty iMovie","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-04 23:53:18","resourceCategoryId":1,"dynastyId":2,"x":576,"y":461,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":-1}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":74,"name":"Shang Dynasty","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-04 23:54:18","resourceCategoryId":2,"dynastyId":2,"x":658,"y":381,"resourceTypeId":3,"iconName":"icon_society","dynastyPeriod":-1}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[{"id":65,"name":"Fangyi (ritual wine vessel)","description":"assets/data/images/shang_Fangyi_ritual_wine_vessel.jpg","editDateTime":"2013-12-04 23:43:04","resourceCategoryId":3,"dynastyId":2,"x":567,"y":377,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":-1}]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[{"id":62,"name":"Shang Dynasty Military","description":"Shang Dynasty Military\r\nThe Shang Dynasty (1600 BC -1046 BC) is said to have amassed a thousand chariots to overthrow the Xia, this is certainly a greatly exaggerated figure. Perhaps 70 would be more appropriate. However, Chinese society was becoming stratified and the warrior elites who made up the chariot core had become an aristocracy. The chariots carried three people, an archer, warrior and driver. The archer had become equipped with the new and deadly but expensive compound bow. Another innovation borrowed from the derided steppe nomads, now called the Horse Barbarians and actively campaigned against. The warrior used a dagger-axe, a long handled axe with a dagger blade mounted on it. Chariots served as mobile command centers, firing platforms and shock forces. However, the bulk of the army was made up of agricultural laborers conscripted by nobles who were under the ruling dynasty. The feudal system that developed required these subservient lords to provide supplies, armor and weapons for the conscripts. The Shang king kept a force of around a thousand troops that he personally led in battle. A Shang king could muster an army of about five thousand for in border campaigns or call all his forces up in a grand army numbering around 13,000 to face down serious threats such as insurrection and invasion. Shang infantry were armed with an assortment of stone or bronze weapons, including spears, pole-axes, long handled dagger-axes and simple bows. For defense they used shields and occasionally bronze or leather helmets.","editDateTime":"2013-12-04 23:39:27","resourceCategoryId":4,"dynastyId":2,"x":498,"y":418,"resourceTypeId":1,"iconName":"icon_military","dynastyPeriod":-1},{"id":67,"name":"Shang Dynasty Military Part2","description":"The infantry fought in massed formations under the banner of their noble or the Shang king himself. A rudimentary military bureaucracy was established in order to organize and supply these troops. The Shang rulers demanded a lot of bronze weapons and ceremonial vessels, required a lot of labor and expertise. This in turn spurred the economy as vast efforts were required for mining, refining, and the transportation of copper, tin, and lead ores.","editDateTime":"2013-12-04 23:45:39","resourceCategoryId":4,"dynastyId":2,"x":622,"y":353,"resourceTypeId":1,"iconName":"icon_military","dynastyPeriod":-1},{"id":64,"name":"Scepter","description":"assets/data/images/shang_Ceremonial_ge_dagger.jpg","editDateTime":"2013-12-04 23:42:01","resourceCategoryId":4,"dynastyId":2,"x":592,"y":398,"resourceTypeId":2,"iconName":"icon_military","dynastyPeriod":-1}]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[{"id":63,"name":"shang Ceremonial ge dagger","description":"assets/data/images/shang_Ceremonial_ge_dagger.jpg","editDateTime":"2013-12-04 23:40:39","resourceCategoryId":5,"dynastyId":2,"x":628,"y":418,"resourceTypeId":2,"iconName":"icon_technology","dynastyPeriod":-1}]},{"id":6,"name":"introduction","chinese":"介绍","resources":[]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":6,"period":0,"dynastyId":2,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":210,"mapZ":1.05},{"id":8,"period":1,"dynastyId":2,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":210,"mapZ":1.05}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"shang_0","audio":"assets/data/audios/shang_0.mp3","text":"Shang was established by King Tang in 1675 BC after overthrowing the tyrannical rule of Jie","state":1},{"id":1,"audioId":"shang_1","audio":"assets/data/audios/shang_1.mp3","text":" (Xia's last emperor). This dynasty lasted over 600 years and was led by 30 different emperors.","state":1}]},{"id":3,"name":"zhou","introduction":"The Zhou Dynasty originated from the Zhou clan whose existence stretches back into history. By the 11th Century BC, this clan had become increasingly powerful, and had extended throughout the present Shaanxi and Gansu Provinces. The Clan's mightiness increasingly menaced the Shang Dynasty, and the conflict between the two groups intensified.","startYear":-1046,"endYear":-221,"chinese":0,"enable":1,"totalPeriod":2,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":75,"name":"Foundation","description":"According to Chinese mythology, the Zhou lineage began when a consort of the legendary Emperor Ku miraculously conceived Qi (lit. \"the Abandoned One\") after stepping into a divine footprint. Qi was a culture hero credited with surviving three abandonments by his mother and with greatly improving Xia agriculture, to the point where he was granted lordship over Tai and the ancestral name Ji by his own Xia king and a later posthumous name (Houji, \"Lord of Millet\") by the Shang king Tang. He even received sacrifice as a harvest god.","editDateTime":"2013-12-07 15:47:52","resourceCategoryId":1,"dynastyId":3,"x":513,"y":385,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":76,"name":"Foundation Continue","description":"Qi's son Buzhu abandoned his position at court and either he or his son Ju abandoned agriculture entirely, living a nomadic life in the manner of their Rong and Di barbarian neighbors. Ju's son Duke Liu, however, led his people to prosperity by restoring agriculture and settling them at a place called Bin,[a] which his descendants ruled for generations. Old Duke Danfu later led the clan from Bin to Zhou, an area in the Wei River valley of modern-day Qishan County.","editDateTime":"2013-12-07 15:48:28","resourceCategoryId":1,"dynastyId":3,"x":523,"y":472,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":77,"name":"Western Zhou","description":"King Wu maintained the old capital for ceremonial purposes but constructed a new one for his palace and administration nearby at Hao. Although Wu's early death left a young and inexperienced heir, the Duke of Zhou assisted his nephew King Cheng in consolidating royal power. He quelled rebellious Zhou princes, feudal rulers, and Shang partisans; countered Zhou's crisis of legitimacy by expounding the doctrine of the Mandate of Heaven while accommodating important Shang rituals at Chengzhou; and set up the fengjian system to maintain Zhou authority over its greatly-expanded territory.\r\nOver time, this decentralized system became strained as the familial relationships between the Zhou kings and the regional dynasts thinned over the generations. Peripheral territories developed local power and prestige on par with that of the Zhou. When King You demoted and exiled his Jiang queen in favor of the beautiful but common Bao Si, the disgraced queen's father the Marquis of Shen joined with Zeng and the Quanrong barbarians to sack Hao in 771 BC. With King You dead, a conclave of nobles met at Shen and declared the Marquis's grandson King Ping. The capital was moved eastward to Chengzhou, marking the end of the \"Western Zhou\" and the beginning of the \"Eastern Zhou\" dynasty.","editDateTime":"2013-12-07 15:49:39","resourceCategoryId":1,"dynastyId":3,"x":514,"y":428,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":78,"name":"Eastern Zhou","description":"The Eastern Zhou was characterized by an accelerating collapse of royal authority, although the king's ritual importance allowed over five more centuries of rule. The Confucian chronicle of the early years of this process led to its title of the \"Spring and Autumn\" Period. The partition of Jin in the mid-5th century BC initiated a second phase, the \"Warring States\". In 403 BC, the Zhou court recognized Han, Zhao, and Wei as fully independent states; in 344 BC, the first – Duke Hui of Wei – claimed the royal title of king for himself. A series of states rose to prominence before each falling in turn, but Zhou was a minor player in these conflicts.\r\nThe last Zhou king is traditionally taken to be Nan, who was killed when Qin captured the capital Chengzhou in 256 BC. A \"King Hui\" was declared, but his splinter state was fully removed by 249 BC. Qin's unification of China concluded in 221 BC with Qin Shihuang's annexation of Qi.\r\nThe Eastern Zhou, however, is also remembered as the golden age of Chinese philosophy: the Hundred Schools of Thought which flourished as rival lords patronized itinerant shi scholars is led by the example of Qi's Jixia Academy. The Nine Schools of Thought which came to dominate the others were Confucianism (as interpreted by Mencius and others), Legalism, Taoism, Mohism, the utopian communalist Agriculturalism, two strains of Diplomatists, the sophistic Logicians, Sun-tzu's Militarists, and the Naturalists. Although only the first three of these went on to receive imperial patronage in later dynasties, doctrines from each influenced the others and Chinese society in sometimes unusual ways. The Mohists, for instance, found little interest in their praise of meritocracy but much acceptance for their mastery of siege warfare; much later, however, their arguments against nepotism were used in favor of establishing the imperial examination system.","editDateTime":"2013-12-07 15:49:57","resourceCategoryId":1,"dynastyId":3,"x":541,"y":363,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":88,"name":"The Zhou Dynasty Part2","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-07 16:05:48","resourceCategoryId":1,"dynastyId":3,"x":455,"y":414,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":0},{"id":89,"name":"The history of zhou dynasty","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-07 16:06:41","resourceCategoryId":1,"dynastyId":3,"x":547,"y":384,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":0}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":79,"name":"Feudalism and the rise of Confucian bureaucracy","description":"Western writers often describe the Zhou period as \"feudal\" because the Zhou's fēngjiàn system invites comparison with medieval rule in Europe.\r\n\r\nThe system, also called \"extensive stratified patrilineage\", was defined by the anthropologist Chang Kuang-chih as \"characterized by the fact that the eldest son of each generation formed the main of line descent and political authority, whereas the younger brothers were moved out to establish new lineages of lesser authority. The farther removed, the lesser the political authority\". K.E. Brashier writes in his book \"Ancestral Memory in Early China\" about the tsung-fa system of patrilineal primogeniture: \"The greater lineage, if it has survived, is the direct succession from father to eldest son and is not defined via the collateral shifts of the lesser lineages. In discussions that demarcate between trunk and collateral lines, the former is called a zong and the latter a zu, whereas the whole lineage is dubbed the shi. On one hand every son who is not the eldest and hence not heir to the lineage territory has the potential of becoming a progenitor and fostering a new trunk lineage (Ideally he would strike out to cultivate new lineage territory). According to the Zou commentary, the son of heaven divided land among his feudal lords, his feudal lords divided land among their dependent families and so forth down the pecking order to the officers who had their dependent kin and the commoners who \"each had his apportioned relations and all had their graded precedence. Ebrey defines the descent-line system as follows: \"A great line (ta-tsung) is the line of eldest sons continuing indefinitely from a founding ancestor. A lesser line is the line of eldest sons going back no more than five generations. Great lines and lesser lines continually spin off new lesser lines, founded by younger sons\".","editDateTime":"2013-12-07 15:51:52","resourceCategoryId":2,"dynastyId":3,"x":565,"y":388,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":81,"name":"Mandate of Heaven","description":"In the Chinese historical tradition, the Zhou defeated the Shang and oriented the Shang system of ancestor worship towards a universalized worship, away from the worship of Shangdi and to that of Tian or \"heaven\". They legitimized their rule by invoking the \"Mandate of Heaven,\" the notion that the ruler (the \"Son of Heaven\") governed by divine right and that his dethronement would prove that he had lost the Mandate. Disasters and successful rebellions would thus show that the ruling family had lost this Mandate.\r\nThe doctrine explained and justified the demise of the Xia and Shang dynasties and, at the same time, supported the legitimacy of present and future rulers. Before conquering Shang, Zhou was a state in Shaanxi. Gernet (1996:51) describes the Zhou state as a \"city\" which was in contact with the barbarian peoples of the western regions and more warlike than the Shang. The Zhou dynasty was founded by the Ji family and operated from four capitals throughout its history.[22] Sharing the language and culture of the Shang, the early Zhou rulers, through conquest and colonization, established a large imperial territory wherein states as far as Shandong acknowledged Zhou rulership and took part in elite culture. The spread of Zhou bronzes, though, was concurrent with the continued use of Shang-style pottery in the distant regions, and these states were the last to recede during the late Western war. The mandate of heaven was based on rules. The emperor was granted the right to rule by heaven.","editDateTime":"2013-12-07 15:53:14","resourceCategoryId":2,"dynastyId":3,"x":566,"y":463,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":87,"name":"The Zhou Dynasty Part1","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-07 16:05:13","resourceCategoryId":2,"dynastyId":3,"x":512,"y":438,"resourceTypeId":3,"iconName":"icon_society","dynastyPeriod":0}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[{"id":85,"name":"Zhou openwork interlaced dragons","description":"assets/data/images/zhou_openwork_interlaced_dragons.jpg","editDateTime":"2013-12-07 16:00:35","resourceCategoryId":3,"dynastyId":3,"x":573,"y":443,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":90,"name":"zhou liangqi Zhong","description":"assets/data/images/zhou_liangqi_Zhong.jpg","editDateTime":"2013-12-07 16:28:31","resourceCategoryId":3,"dynastyId":3,"x":474,"y":458,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":91,"name":"Chang sha dragon","description":"assets/data/images/zhou_Changshadragon.jpg","editDateTime":"2013-12-07 16:29:59","resourceCategoryId":3,"dynastyId":3,"x":554,"y":340,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":93,"name":"zhou toolib","description":"assets/data/images/zhou-tooli-bjpg","editDateTime":"2013-12-07 16:32:57","resourceCategoryId":3,"dynastyId":3,"x":474,"y":422,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1}]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[{"id":80,"name":"Military","description":"The early Western Zhou supported a strong army, split into two major units: \"the Six Armies of the west\" and \"the Eight Armies of Chengzhou\". The armies campaigned in the northern Loess Plateau, modern Ningxia and the Yellow River floodplain. The military prowess of Zhou peaked during the 19th year of King Zhao's reign, when the six armies were wiped out along with King Zhao on a campaign around the Han River. Early Zhou kings were true commanders-in-chief. They were in constant wars with barbarians on behalf of the fiefs called guo, which at that time meant \"statelet\" or \"principality\".","editDateTime":"2013-12-07 15:52:17","resourceCategoryId":4,"dynastyId":3,"x":588,"y":422,"resourceTypeId":1,"iconName":"icon_military","dynastyPeriod":1}]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[{"id":82,"name":"Philosophy","description":"During the Zhou Dynasty, the origins of native Chinese philosophy developed, its initial stages beginning in the 6th century BC. The greatest Chinese philosophers, those who made the greatest impact on later generations of Chinese, were Confucius, founder of Confucianism, and Laozi, founder of Taoism. Other philosophers, theorists, and schools of thought in this era were Mozi, founder of Mohism; Mencius, a famous Confucian who expanded upon Confucius' legacy; Shang Yang and Han Fei, responsible for the development of ancient Chinese Legalism (the core philosophy of the Qin Dynasty); and Xun Zi, who was arguably the center of ancient Chinese intellectual life during his time, even more so than iconic intellectual figures such as Mencius.","editDateTime":"2013-12-07 15:54:10","resourceCategoryId":5,"dynastyId":3,"x":490,"y":471,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":1},{"id":83,"name":"Agriculture","description":"Agriculture in the Zhou Dynasty was very intensive and, in many cases, directed by the government. All farming lands were owned by nobles, who then gave their land to their serfs, a situation similar to European feudalism. For example, a piece of land was divided into nine squares in the well-field system, with the grain from the middle square taken by the government and that of surrounding squares kept by individual farmers. This way, the government was able to store surplus food and distribute it in times of famine or bad harvest. Some important manufacturing sectors during this period included bronze smelting, which was integral to making weapons and farming tools. Again, these industries were dominated by the nobility who directed the production of such materials.","editDateTime":"2013-12-07 15:57:53","resourceCategoryId":5,"dynastyId":3,"x":459,"y":452,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":1},{"id":84,"name":"Zhou Defang Ding","description":"assets/data/images/zhou_Defang_Ding.jpg\r\n","editDateTime":"2013-12-07 15:57:57","resourceCategoryId":5,"dynastyId":3,"x":575,"y":403,"resourceTypeId":2,"iconName":"icon_technology","dynastyPeriod":0},{"id":86,"name":"Zhou Freer","description":"assets/data/images/Zhou_Freer.jpg","editDateTime":"2013-12-07 16:02:01","resourceCategoryId":5,"dynastyId":3,"x":548,"y":466,"resourceTypeId":2,"iconName":"icon_technology","dynastyPeriod":0},{"id":92,"name":"Ritual food container, Western_Zhou_Dynasty","description":"assets/data/images/Ritual_food_container_Western_Zhou_Dynastyjpg","editDateTime":"2013-12-07 16:31:10","resourceCategoryId":5,"dynastyId":3,"x":462,"y":408,"resourceTypeId":2,"iconName":"icon_technology","dynastyPeriod":1}]},{"id":6,"name":"introduction","chinese":"介绍","resources":[]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":9,"period":0,"dynastyId":3,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5},{"id":10,"period":1,"dynastyId":3,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"zhou_0","audio":"assets/data/audios/zhou_0.mp3","text":"The Zhou Dynasty originated from the Zhou clan whose existence stretches back into history","state":1},{"id":1,"audioId":"zhou_1","audio":"assets/data/audios/zhou_1.mp3","text":"By the 11th Century BC","state":1},{"id":2,"audioId":"zhou_2","audio":"assets/data/audios/zhou_2.mp3","text":" this clan had become increasingly powerful","state":1},{"id":3,"audioId":"zhou_3","audio":"assets/data/audios/zhou_3.mp3","text":" and had extended throughout the present Shaanxi and Gansu Provinces","state":1},{"id":4,"audioId":"zhou_4","audio":"assets/data/audios/zhou_4.mp3","text":"The Clan's mightiness increasingly menaced the Shang Dynasty","state":1},{"id":5,"audioId":"zhou_5","audio":"assets/data/audios/zhou_5.mp3","text":" and the conflict between the two groups intensified.","state":1}]},{"id":4,"name":"qin","introduction":"Qin Dynasty was the first unified, multi-national and power-centralized state in the Chinese history. It lasted from 221 BC to 207 BC. Although surviving only 15 years, the dynasty held an important role in Chinese history, and it exerted great influence on the following dynasties. Only two emperors, Yingzheng - Emperor Qin Shi Huang, the first emperor in the Chinese history, and his son Hu Hai ever ruled the state, which was finally overthrown by the people's uprising.\r\n","startYear":-221,"endYear":-206,"chinese":0,"enable":1,"totalPeriod":2,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":2,"name":"Origins and early development","description":"In the 9th century BC Feizi, a descendant of the ancient political advisor Gao Yao, was granted rule over Qin City. The modern city of Tianshui stands where this city once was. During the rule of King Xiao of Zhou, the eighth king of the Zhou Dynasty, this area became known as the state of Qin. In 897 BC, under the regency of Gonghe, the area became a dependency allotted for the purpose of raising and breeding horses. One of Feizi's descendants, Duke Zhuang, became favoured by King Ping of Zhou, the thirteenth king in that line. As a reward, Zhuang's son, Duke Xiang, was sent eastward as the leader of a war expedition, during which he formally established the Qin. \r\nQin state first sent a military expedition into central China in 672 BC, though it did not engage in any serious incursions due to the threat from neighbouring tribesmen. By the dawn of the fourth century BC, however, the neighbouring tribes had all been either subdued or conquered, and the stage was set for the rise of Qin expansionism. ","editDateTime":"2013-10-09 22:51:28","resourceCategoryId":1,"dynastyId":4,"x":511,"y":365,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":8,"name":"Growth of power","description":"Lord Shang Yang, a Qin statesman, introduced a number of militarily advantageous reforms from 361 BC until his death in 338 BC, and also helped construct the Qin capital, Xianyang. This latter accomplishment commenced in the mid-fourth century BC; the resulting city greatly resembled the capitals of other Warring States.","editDateTime":"2013-10-09 22:52:50","resourceCategoryId":1,"dynastyId":4,"x":498,"y":315,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":9,"name":"Conquest of the Warring States","description":"During the Warring States Period preceding the Qin Dynasty, the major states vying for dominance were Yan, Zhao, Qi, Chu, Han, Wei and Qin. The rulers of these states styled themselves as kings, rather than using the titles of lower nobility they had previously held. However, none elevated himself to believe that he had the \"Mandate of Heaven,\" as the Zhou emperors had claimed, nor that he had the right to offer sacrifices—they left this to the Zhou rulers.","editDateTime":"2013-10-10 00:35:14","resourceCategoryId":1,"dynastyId":4,"x":480,"y":348,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":10,"name":"Southward expansion","description":"In 214 BC Qin Shihuang secured his boundaries to the north with a fraction (100,000 men) of his large army, and sent the majority (500,000 men) of his army south to conquer the territory of the southern tribes. Prior to the events leading to Qin dominance over China, they had gained possession of much of Sichuan to the southwest. The Qin army was unfamiliar with the jungle terrain, and it was defeated by the southern tribes' guerrilla warfare tactics with over 100,000 men lost. However, in the defeat Qin was successful in building a canal to the south, which they used heavily for supplying and reinforcing their troops during their second attack to the south. Building on these gains, the Qin armies conquered the coastal lands surrounding Guangzhou, and took the provinces of Fuzhou and Guilin. They struck as far south as Hanoi. After these victories in the south, Qin Shihuang moved over 100,000 prisoners and exiles to colonize the newly conquered area. In terms of extending the boundaries of his empire, the First Emperor was extremely successful in the south.","editDateTime":"2013-10-10 00:35:17","resourceCategoryId":1,"dynastyId":4,"x":474,"y":389,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":39,"name":"The First Emperor The Man Who Made China (Part 1)","description":"assets/data/videos/The_First_Emperor_The_Man_Who_Made_China_P1.webm","editDateTime":"2013-10-10 21:31:36","resourceCategoryId":1,"dynastyId":4,"x":581,"y":436,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":0},{"id":40,"name":"The First Emperor The Man Who Made China (Part 2)","description":"assets/data/videos/The_First_Emperor_The_Man_Who_Made_China_P2.webm","editDateTime":"2013-10-10 21:32:56","resourceCategoryId":1,"dynastyId":4,"x":548,"y":387,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":0},{"id":41,"name":"The First Emperor The Man Who Made China (Part 3)","description":"assets/data/videos/The_First_Emperor_The_Man_Who_Made_China_P3.webm","editDateTime":"2013-10-10 21:34:24","resourceCategoryId":1,"dynastyId":4,"x":549,"y":334,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":0},{"id":68,"name":"The First Emperor The Man Who Made China (Part 4)","description":"assets/data/videos/The_First_Emperor_The_Man_Who_Made_China_P4.webm","editDateTime":"2013-12-04 23:48:34","resourceCategoryId":1,"dynastyId":4,"x":484,"y":408,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":0},{"id":94,"name":"The First Emperor The Man Who Made China (Part 5)","description":"assets/data/videos/The_First_Emperor_The_Man_Who_Made_China_P5.webm","editDateTime":"2013-12-07 16:58:01","resourceCategoryId":1,"dynastyId":4,"x":483,"y":311,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":0},{"id":95,"name":"The First Emperor The Man Who Made China (Part 6)","description":"assets/data/videos/The_First_Emperor_The_Man_Who_Made_China_P6.webm","editDateTime":"2013-12-07 16:58:08","resourceCategoryId":1,"dynastyId":4,"x":467,"y":348,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":0}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":11,"name":"Domestic life","description":"The aristocracy of the Qin were largely similar in their culture and daily life. Regional variations in culture were considered a symbol of the lower classes. This stemmed from the Zhou and was seized upon by the Qin, as such variations were seen as contrary to the unification that the government strove to achieve.","editDateTime":"2013-10-10 00:38:18","resourceCategoryId":2,"dynastyId":4,"x":442,"y":412,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":12,"name":"Architecture","description":"Warring States-era architecture had several definitive aspects. City walls, used for defense, were made longer, and indeed several secondary walls were also sometimes built to separate the different districts. Versatility in federal structures was emphasized, to create a sense of authority and absolute power. Architectural elements such as high towers, pillar gates, terraces, and high buildings amply conveyed this.[","editDateTime":"2013-10-10 00:39:54","resourceCategoryId":2,"dynastyId":4,"x":480,"y":446,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[{"id":14,"name":"Religion","description":"The dominant religious belief in China during the reign of the Qin, and, in fact, during much of early imperial China, was focused on the shen (roughly translating to \"spirits\"), yin (\"shadows\"), and the realm they were said to live in. The Chinese offered sacrifices in an attempt to contact this other world, which they believed to be parallel to the earthly one. The dead were said to simply have moved from one world to the other. The rituals mentioned, as well as others, served two purposes: to ensure that the dead journeyed and stayed in the other realm, and to receive blessings from the spirit realm.","editDateTime":"2013-10-10 00:42:04","resourceCategoryId":3,"dynastyId":4,"x":536,"y":447,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":1},{"id":16,"name":"Philosophy and literature","description":"During the Warring States Period, the Hundred Schools of Thought comprised many different philosophies proposed by Chinese scholars. In 221 BC, however, the First Emperor conquered all of the states and governed with a single philosophy, Legalism. At least one school of thought, Mohism, was eradicated, though the reason is not known. Despite the Qin's state ideology and Mohism being similar in certain regards, it is possible that Mohists were sought and killed by the state's armies due to paramilitary activities.","editDateTime":"2013-10-10 00:43:19","resourceCategoryId":3,"dynastyId":4,"x":573,"y":441,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":1},{"id":48,"name":"Departure Herald-Detail","description":"assets/data/images/Departure_Herald-Detail.jpg","editDateTime":"2013-10-10 22:21:31","resourceCategoryId":3,"dynastyId":4,"x":470,"y":375,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0}]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[{"id":13,"name":"Government and military","description":"The Qin government was highly bureaucratic, and was administered by a hierarchy of officials, all serving the First Emperor. The Qin put into practice the teachings of Han Fei, allowing the First Emperor to control all of his territories, including those recently conquered. All aspects of life were standardized, from measurements and language to more practical details, such as the length of chariot axles. Zheng and his advisers also introduced new laws and practices that ended feudalism in China, replacing it with a centralized, bureaucratic government. Under this system, both the military and government thrived, as talented individuals could be more easily identified in the transformed society. Later Chinese dynasties emulated the Qin government for its efficiency, despite its being condemned by Confucian philosophy.[15][36] Such a system, however, could be manipulated by power-hungry individuals; one example of such an occurrence was documented in the \"Records of Officialdom\". A commander named Hu ordered his men to attack peasants, in an attempt to increase the number of \"bandits\" he had killed; his superiors, likely eager to inflate their records as well, allowed this.","editDateTime":"2013-10-10 00:40:59","resourceCategoryId":4,"dynastyId":4,"x":508,"y":478,"resourceTypeId":1,"iconName":"icon_military","dynastyPeriod":1},{"id":47,"name":"Terracotta Army","description":"assets/data/images/800px-Terracotta_Army-China2.jpg","editDateTime":"2013-10-10 22:19:32","resourceCategoryId":4,"dynastyId":4,"x":529,"y":309,"resourceTypeId":2,"iconName":"icon_military","dynastyPeriod":0},{"id":96,"name":"The Evolution of Chinese Armor Shang to Qin Dynasty","description":"assets/data/videos/The_Evolution_of_Chinese_Armor_1_Shang_to_Qin_Dynasty.webm","editDateTime":"2013-12-07 16:59:30","resourceCategoryId":4,"dynastyId":4,"x":520,"y":443,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":0}]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[{"id":17,"name":"Inventions","description":"Legalism\r\nStandardized writing and language\r\nStandardized money\r\nStandardized system of measurement\r\nIrrigation projects\r\nBuilding of the Great Wall\r\nTerra cotta army\r\nExpanded Network of Roads and Canals\r\nMultiplication Table","editDateTime":"2013-10-10 00:46:02","resourceCategoryId":5,"dynastyId":4,"x":423,"y":455,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":1}]},{"id":6,"name":"introduction","chinese":"介绍","resources":[{"id":1,"name":"Qin Dynasty introduction","description":"The Qin Dynasty was the first imperial dynasty of China, lasting from 221 to 206 BC. The dynasty was formed after the conquest of the six other states by the state of Qin, and its founding emperor was known as Qin Shi Huang, the First Emperor of Qin. The Qin state derived its name from its heartland of Qin, in modern-day Gansu and Shaanxi. The strength of the Qin state was greatly increased by the legalist reforms of Shang Yang in the 4th century BC, during the Warring States period. In the mid and late third century BC, the Qin accomplished a series of swift conquests, first ending the powerless Zhou Dynasty, and eventually conquering the remaining six states of the major states to gain control over the whole of China, resulting in a unified China.","editDateTime":"2013-10-09 22:50:08","resourceCategoryId":6,"dynastyId":4,"x":561,"y":458,"resourceTypeId":1,"dynastyPeriod":0}]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":1,"period":0,"dynastyId":4,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":400,"delay":120,"scale":100,"mapZ":1.5},{"id":2,"period":1,"dynastyId":4,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":400,"delay":120,"scale":100,"mapZ":1.5}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"qin_0","audio":"assets/data/audios/qin_0.mp3","text":"Qin Dynasty was the first unified, multi-national and power-centralized state in the Chinese history","state":1},{"id":1,"audioId":"qin_1","audio":"assets/data/audios/qin_1.mp3","text":"It lasted from 221 BC to 207 BC","state":1},{"id":2,"audioId":"qin_2","audio":"assets/data/audios/qin_2.mp3","text":"Although surviving only 15 years","state":1},{"id":3,"audioId":"qin_3","audio":"assets/data/audios/qin_3.mp3","text":" the dynasty held an important role in Chinese history","state":1},{"id":4,"audioId":"qin_4","audio":"assets/data/audios/qin_4.mp3","text":" and it exerted great influence on the following dynasties","state":1},{"id":5,"audioId":"qin_5","audio":"assets/data/audios/qin_5.mp3","text":"Only two emperors","state":1},{"id":6,"audioId":"qin_6","audio":"assets/data/audios/qin_6.mp3","text":" Yingzheng - Emperor Qin Shi Huang","state":1},{"id":7,"audioId":"qin_7","audio":"assets/data/audios/qin_7.mp3","text":" the first emperor in the Chinese history","state":1},{"id":8,"audioId":"qin_8","audio":"assets/data/audios/qin_8.mp3","text":" and his son Hu Hai ever ruled the state","state":1},{"id":9,"audioId":"qin_9","audio":"assets/data/audios/qin_9.mp3","text":" which was finally overthrown by the people's uprising.\r\n","state":1}]},{"id":5,"name":"han","introduction":"The Han Dynasty (206 BCE-220 CE), was one of the longest of China’s major dynasties. In terms of power and prestige, the Han Dynasty in the East rivalled its almost contemporary Roman Empire in the West. With only minor interruptions it lasted a span of over four centuries, and was considered a golden age in Chinese history especially in arts, politics and technology. All subsequent Chinese dynasties looked back to the Han period, as an inspiring model of a united empire and self-perpetuating government.","startYear":-202,"endYear":220,"chinese":0,"enable":1,"totalPeriod":3,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":98,"name":"The Han Dynasty","description":"The Han Empire was divided into areas directly controlled by the central government, known as commanderies, and a number of semi-autonomous kingdoms. These kingdoms gradually lost all vestiges of their independence, particularly following the Rebellion of the Seven States. The Xiongnu, a nomadic steppe confederation, defeated the Han in 200 BC and forced the Han to submit as a de facto inferior partner, but continued their raids on the Han borders. Emperor Wu of Han (r. 141–87 BC) launched several military campaigns against them. The ultimate Han victory in these wars eventually forced the Xiongnu to accept vassal status as Han tributaries. These campaigns expanded Han sovereignty into the Tarim Basin of Central Asia, divided the Xiongnu into two separate confederations, and helped establish the vast trade network known as the Silk Road, which reached as far as the Mediterranean world. The territories north of Han's borders were quickly overrun by the nomadic Xianbei confederation. Emperor Wu also launched successful military expeditions in the south, annexing Nanyue in 111 BC and Dian in 109 BC, and in the Korean Peninsula where the Xuantu and Lelang Commanderies were established in 108 BC.","editDateTime":"2013-12-08 11:35:09","resourceCategoryId":1,"dynastyId":5,"x":590,"y":409,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":2},{"id":106,"name":"han-dynasty-tile","description":"assets/data/images/han-dynasty-tile.jpg","editDateTime":"2013-12-08 11:54:09","resourceCategoryId":1,"dynastyId":5,"x":538,"y":348,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":113,"name":"Female Dancer","description":"assets/data/images/h2_1992.165.19.jpg","editDateTime":"2013-12-08 12:04:40","resourceCategoryId":1,"dynastyId":5,"x":435,"y":430,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":114,"name":"Achievements During the Han Dynasty","description":"During Han times, pulleys and wheelbarrows were used to move goods. To pulverize ores and grains, they employed the water-powered trip-hammer and air was pumped into furnaces thanks to the aid of bellows.\r\n\r\nIt was a eunuch named Cai Lun who, around 105 CE, came up with an innovation that would be invaluable for learning. A screen was dipped into a vat of watery oatmeal-like pulp made of rice straw and inner tree bark. When the screen was raised, it had a layer of dripping slush on top, which was later pressed and dried. The end result was a sheet of paper. However, during Han times, paper was used largely to wrap fish rather than for written documents. Just a few written paper sheets survived to our days from Han times, mostly found in tombs. Tens of thousands of written documentshave come down to our day, most of them on wooden tablets and slips of bamboo. Examples include mathematical problems, historical records, poetry, government records, a massive dictionary, and the oldest surviving large-scale census of all history, which reports 57,671,400 people in 2 CE. All these documents have been critical in our fairly good historical knowledge of the Han dynasty.\r\n\r\nThe opening of the Silk Road was probably the major economic achievement of the Han Dynasty.","editDateTime":"2013-12-08 12:17:48","resourceCategoryId":1,"dynastyId":5,"x":571,"y":389,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":115,"name":"The Sack of Chan’gan","description":"Wang Man was a government official and a member of a powerful family who took control of the empire by usurping the throne and proclaiming the the beginning of a new dynasty called Xin, or “new”, in 9 CE. He took advantage of the fact that since the time Emperor Wu died in 87 BCE, the Han Dynasty had been immersed in various political and social conflicts. The gap between rich and poor was already a serious problem. Sima Qian reports about this period that exploiters “were busy accumulating wealth and forcing the poor into their hire”. The court was also affected by complicated political turmoil: endless accusations, executions, treason, and battles were weakening the government.","editDateTime":"2013-12-08 12:18:21","resourceCategoryId":1,"dynastyId":5,"x":533,"y":470,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":116,"name":"The Last Days of the Han Dynasty","description":"By the end of the 1st century CE, one Han emperor after another had died either young or without a chosen heir. When an emperor died without sons, a close relative, such as his cousin, was named emperor. In some cases the new ruler was a child or even an infant, in which case the real power was in the hands of a guardian from the family of the empress, since even infant rulers had to have an empress. This scenario led to all types of cunning schemes in the court.","editDateTime":"2013-12-08 12:18:42","resourceCategoryId":1,"dynastyId":5,"x":467,"y":472,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":117,"name":"The Legacy of the Han Dynasty","description":"The Han Dynasty has influenced the East just like Greece or Rome has influenced the West. The biggest Chinese historiographic work of antiquity was written during this period. Chinese calligraphy developed into an art. Confucianism was made the official state ideology during the time of Emperor Wu Di, who built an academy solely devoted to the works of Confucius. The philosopher had long been dead, but his disciples managed to preserve his teachings. Confucianism, favoured by the patronage of the state, gained a strength similar to Buddhism during the time of Emperor Ashoka or Christianity after Constantine. Thousands of Confucian academies were built, spreading Confucian ethics across China and most of East Asia and would dominate Chinese ethics during the centuries to come. Even today, the ethnic Chinese refer to themselves as Han rem (Han people). Although history tells us, then, that the Han Dynasty ended in 220 CE, from the examples cited above it is clear that the Han still lives on today in many different forms.","editDateTime":"2013-12-08 12:19:18","resourceCategoryId":1,"dynastyId":5,"x":584,"y":444,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":118,"name":"Western Han","description":"China's first imperial dynasty was the Qin Dynasty (221–206 BC). The Qin unified the Chinese Warring States by conquest, but their empire became unstable after the death of the first emperor Qin Shi Huangdi. Within four years, the dynasty's authority had collapsed in the face of rebellion. Two former rebel leaders, Xiang Yu (d. 202 BC) of Chu and Liu Bang (d. 195 BC) of Han, engaged in a war to decide who would become hegemon of China, which had fissured into 18 kingdoms, each claiming allegiance to either Xiang Yu or Liu Bang. Although Xiang Yu proved to be a capable commander, Liu Bang defeated him at Battle of Gaixia (202 BC), in modern-day Anhui. Liu Bang assumed the title \"emperor\" (huangdi) at the urging of his followers and is known posthumously as Emperor Gaozu (r. 202–195 BC). Chang'an was chosen as the new capital of the reunified empire under Han.","editDateTime":"2013-12-08 12:24:29","resourceCategoryId":1,"dynastyId":5,"x":545,"y":364,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":121,"name":"Wang Mang's reign and civil war","description":"Wang Zhengjun (71 BC–13 AD) was first empress, then empress dowager, and finally grand empress dowager during the reigns of the Emperors Yuan (r. 49–33 BC), Cheng (r. 33–7 BC), and Ai (r. 7–1 BC), respectively. During this time, a succession of her male relatives held the title of regent. Following the death of Ai, Wang Zhengjun's nephew Wang Mang (45 BC–23 AD) was appointed regent as Marshall of State on 16 August under Emperor Ping (r. 1 BC – 6 AD). When Ping died on 3 February 6 AD, Liu Ying (d. 25 AD) was chosen as the heir and Wang Mang was appointed to serve as acting emperor for the child. Wang promised to relinquish his control to Liu Ying once he came of age. Despite this promise, and against protest and revolts from the nobility, Wang Mang claimed on 10 January that the divine Mandate of Heaven called for the end of the Han Dynasty and the beginning of his own: the Xin Dynasty (9–23 AD).","editDateTime":"2013-12-08 12:27:19","resourceCategoryId":1,"dynastyId":5,"x":311,"y":233,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":122,"name":"Eastern Han","description":"The Eastern Han, also known as the Later Han, formally began on 5 August 25, when Liu Xiu became Emperor Guangwu of Han. During the widespread rebellion against Wang Mang, the Korean state of Goguryeo was free to raid Han's Korean commanderies; Han did not reaffirm its control over the region until AD 30.The Trưng Sisters of Vietnam rebelled against Han in AD 40. Their rebellion was crushed by Han general Ma Yuan (d. AD 49) in a campaign from AD 42–43. Wang Mang renewed hostilities against the Xiongnu, who were estranged from Han until their leader Bi (比), a rival claimant to the throne against his cousin Punu (蒲奴), submitted to Han as a tributary vassal in AD 50. This created two rival Xiongnu states: the Southern Xiongnu led by Bi, an ally of Han, and the Northern Xiongnu led by Punu, an enemy of Han.","editDateTime":"2013-12-08 12:28:11","resourceCategoryId":1,"dynastyId":5,"x":569,"y":359,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":123,"name":"Eunuchs in state affairs","description":"Emperor Zhang's (r. 75–88 AD) reign came to be viewed by later Eastern Han scholars as the high point of the dynastic house. Subsequent reigns were increasingly marked by eunuch intervention in court politics and their involvement in the violent power struggles of the imperial consort clans. With the aid of the eunuch Zheng Zhong (d. 107 AD), Emperor He (r. 88–105 AD) had Empress Dowager Dou (d. 97 AD) put under house arrest and her clan stripped of power. This was in revenge for Dou's purging of the clan of his natural mother—Consort Liang—and then concealing her identity from him. After Emperor He's death, his wife Empress Deng Sui (d. 121 AD) managed state affairs as the regent empress dowager during a turbulent financial crisis and widespread Qiang rebellion that lasted from 107 to 118 AD.","editDateTime":"2013-12-08 12:29:07","resourceCategoryId":1,"dynastyId":5,"x":529,"y":470,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":2},{"id":131,"name":"Taxation and property","description":"Aside from the landowner's land tax paid in a portion of their crop yield, the poll tax and property taxes were paid in coin cash. The annual poll tax rate for adult men and women was 120 coins and 20 coins for minors. Merchants were required to pay a higher rate of 240 coins. The poll tax stimulated a money economy that necessitated the minting of over 28,000,000,000 coins from 118 BC to 5 AD, an average of 220,000,000 coins a year. ","editDateTime":"2013-12-08 12:37:06","resourceCategoryId":1,"dynastyId":5,"x":476,"y":468,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":102,"name":"han gaozu","description":"assets/data/images/han_gaozu.jpg","editDateTime":"2013-12-08 11:45:42","resourceCategoryId":1,"dynastyId":5,"x":512,"y":319,"resourceTypeId":2,"iconName":"icon_history","dynastyPeriod":1}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":124,"name":"Social class","description":"n the hierarchical social order, the emperor was at the apex of Han society and government. However the emperor was often a minor, ruled over by a regent such as the empress dowager or one of her male relatives. Ranked immediately below the emperor were the kings who were of the same Liu family clan. The rest of society, including nobles lower than kings and all commoners excluding slaves belonged to one of twenty ranks (ershi gongcheng).","editDateTime":"2013-12-08 12:30:33","resourceCategoryId":2,"dynastyId":5,"x":480,"y":462,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":2},{"id":125,"name":"Marriage, gender, and kinship","description":"The Han-era family was patrilineal and typically had four to five nuclear family members living in one household. Multiple generations of extended family members did not occupy the same house, unlike families of later dynasties. According to Confucian family norms, various family members were treated with different levels of respect and intimacy. For example, there were different accepted time frames for mourning the death of a father versus a paternal uncle. Arranged marriages were the norm, with the father's input on his offspring's spouse being considered more important than the mother's. Monogamous marriages were also the norm, although nobles and high officials were wealthy enough to afford and support concubines as additional lovers. Under certain conditions dictated by custom, not law, both men and women were able to divorce their spouses and remarry.","editDateTime":"2013-12-08 12:31:51","resourceCategoryId":2,"dynastyId":5,"x":512,"y":450,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":126,"name":"Law and order","description":"Han scholars such as Jia Yi (201–169 BC) portrayed the previous Qin Dynasty as a brutal regime. However, archaeological evidence from Zhangjiashan and Shuihudi reveal that many of the statutes in the Han law code compiled by Chancellor Xiao He (d. 193 BC) were derived from Qin law. ","editDateTime":"2013-12-08 12:32:34","resourceCategoryId":2,"dynastyId":5,"x":478,"y":396,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":2},{"id":127,"name":"Food","description":"The most common staple crops consumed during Han were wheat, barley, foxtail millet, proso millet, rice, and beans. Commonly eaten fruits and vegetables included chestnuts, pears, plums, peaches, melons, apricots, strawberries, red bayberries, jujubes, calabash, bamboo shoots, mustard plant and taro. Domesticated animals that were also eaten included chickens, Mandarin ducks, geese, cows, sheep, pigs, camels and dogs (various types were bred specifically for food, while most were used as pets). Turtles and fish were taken from streams and lakes. Commonly hunted game, such as owl, pheasant, magpie, sika deer, and Chinese Bamboo Partridge were consumed. Seasonings included sugar, honey, salt and soy sauce. Beer and wine were regularly consumed.","editDateTime":"2013-12-08 12:33:39","resourceCategoryId":2,"dynastyId":5,"x":432,"y":436,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":2},{"id":130,"name":"Variations in currency","description":"The Han Dynasty inherited the ban liang coin type from the Qin. In the beginning of the Han, Emperor Gaozu closed the government mint in favor of private minting of coins. This decision was reversed in 186 BC by his widow Grand Empress Dowager Lü Zhi (d. 180 BC), who abolished private minting. In 182 BC, Lü Zhi issued a bronze coin that was much lighter in weight than previous coins. This caused widespread inflation that was not reduced until 175 BC when Emperor Wen allowed private minters to manufacture coins that were precisely 2.6 g (0.09 oz) in weight. ","editDateTime":"2013-12-08 12:36:25","resourceCategoryId":2,"dynastyId":5,"x":515,"y":483,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":97,"name":"han paper maker process","description":"assets/data/images/han_paper_maker_process.jpg","editDateTime":"2013-12-08 11:32:49","resourceCategoryId":2,"dynastyId":5,"x":561,"y":366,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":2},{"id":103,"name":"han nobles large","description":"assets/data/images/hannobles_large.jpg","editDateTime":"2013-12-08 11:47:22","resourceCategoryId":2,"dynastyId":5,"x":504,"y":453,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":0},{"id":109,"name":"Tomb panel with relief of figures","description":"assets/data/images/h2_20.99.jpg","editDateTime":"2013-12-08 11:58:00","resourceCategoryId":2,"dynastyId":5,"x":300,"y":215,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":1},{"id":112,"name":"game","description":"assets/data/images/h2_1994.285a-m.jpg","editDateTime":"2013-12-08 12:03:22","resourceCategoryId":2,"dynastyId":5,"x":248,"y":245,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":0}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[{"id":101,"name":"Chinese tomb guardian statues","description":"Chinese tomb guardian statues were used during the Han Dynasty (206 B.C.-220 A.D.) to protect the soul of the deceased and the objects included in one's burial from evil. With large and angry eyes wide open and a horn protruding between them, this powerful winged sculpture displays its fierce demeanor by means of its bared teeth and flared nostrils. Noblemen were believed to be able to ride the creature to heaven. This work of art is part of Treasures from Shanghai: 5,000 Years of Chinese Art and Culture, a selection of 77 objects that trace the development of Chinese civilization and art from Neolithic times (ca. 3000 B.C.) to the Qing Dynasty (1644-1911 A.D.). The first exhibition to come to the United States from the famous Shanghai Museum in more than 20 years, it includes bronze vessels, handscrolls with painted calligraphy and splendid landscapes, jade and bamboo carvings, lacquer works, paintings, polychrome pottery, porcelains and sculptures. Also on view are oracle bones whose carvings represent the earliest form of Chinese writing. Court culture and ceremonies are explored through some 20 bronze vessels, cookware and musical instruments. ","editDateTime":"2013-12-08 11:42:16","resourceCategoryId":3,"dynastyId":5,"x":532,"y":403,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":2},{"id":128,"name":"Clothing","description":"The types of clothing worn and the materials used during the Han period depended upon social class. Wealthy folk could afford silk robes, skirts, socks, and mittens, coats made of badger or fox fur, duck plumes, and slippers with inlaid leather, pearls, and silk lining. Peasants commonly wore clothes made of hemp, wool, and ferret skins. ","editDateTime":"2013-12-08 12:34:21","resourceCategoryId":3,"dynastyId":5,"x":388,"y":452,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":2},{"id":134,"name":"Western Han Chinese Silk","description":"assets/data/images/260px-Western_Han_Chinese_Silk.jpg","editDateTime":"2013-12-08 12:39:29","resourceCategoryId":3,"dynastyId":5,"x":549,"y":323,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":0},{"id":99,"name":"Covered jar (hu)","description":"assets/data/images/h2_1992.165.20ab.jpg","editDateTime":"2013-12-08 11:39:25","resourceCategoryId":3,"dynastyId":5,"x":546,"y":416,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":100,"name":"han Painted Pottery Tomb Guardian","description":"assets/data/images/han_Painted_Pottery_Tomb_Guardian.jpg","editDateTime":"2013-12-08 11:40:50","resourceCategoryId":3,"dynastyId":5,"x":522,"y":340,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":105,"name":"Han Art","description":"assets/data/images/Art-Chinadaily_US_Edition.jpg","editDateTime":"2013-12-08 11:52:11","resourceCategoryId":3,"dynastyId":5,"x":470,"y":348,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":107,"name":"Central watchtower","description":"assets/data/images/Central_watchtower.jpg","editDateTime":"2013-12-08 11:55:14","resourceCategoryId":3,"dynastyId":5,"x":473,"y":391,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":110,"name":"Animal pen with figures","description":"assets/data/images/h2_1994.605.21.jpg","editDateTime":"2013-12-08 11:59:51","resourceCategoryId":3,"dynastyId":5,"x":460,"y":346,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":111,"name":"Se player","description":"assets/data/images/h2_1994.605.85a-c.jpg","editDateTime":"2013-12-08 12:01:59","resourceCategoryId":3,"dynastyId":5,"x":244,"y":198,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0}]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[{"id":119,"name":"Military expansion","description":"To the north of China proper, the nomadic Xiongnu chieftain Modu Chanyu (r. 209–174 BC) conquered various tribes inhabiting the eastern portion of the Eurasian Steppe. By the end of his reign, he controlled Manchuria, Mongolia, and the Tarim Basin, subjugating over twenty states east of Samarkand. Emperor Gaozu was troubled about the abundant Han-manufactured iron weapons traded to the Xiongnu along the northern borders, and he established a trade embargo against the group. Although the embargo was in place, the Xiongnu found traders willing to supply their needs. Chinese forces also mounted surprise attacks against Xiongnu who traded at the border markets. In retaliation, the Xiongnu invaded what is now Shanxi province, where they defeated the Han forces at Baideng in 200 BC. After negotiations, the heqin agreement in 198 BC nominally held the leaders of the Xiongnu and the Han as equal partners in a royal marriage alliance, but the Han were forced to send large amounts of tribute items such as silk clothes, food, and wine to the Xiongnu.","editDateTime":"2013-12-08 12:24:37","resourceCategoryId":4,"dynastyId":5,"x":473,"y":403,"resourceTypeId":1,"iconName":"icon_military","dynastyPeriod":1},{"id":120,"name":"Military expansion part2","description":"Despite the tribute and a negotiation between Laoshang Chanyu (r. 174–160 BC) and Emperor Wen (r. 180–157 BC) to reopen border markets, many of the Chanyu's Xiongnu subordinates chose not to obey the treaty and periodically raided Han territories south of the Great Wall for additional goods.[21] In a court conference assembled by Emperor Wu (r. 141–87 BC) in 135 BC, the majority consensus of the ministers was to retain the heqin agreement. Emperor Wu accepted this, despite continuing Xiongnu raids.[22] However, a court conference the following year convinced the majority that a limited engagement at Mayi involving the assassination of the Chanyu would throw the Xiongnu realm into chaos and benefit the Han.[23] When this plot failed in 133 BE,[24] Emperor Wu launched a series of massive military invasions into Xiongnu territory. Chinese armies captured one stronghold after another and established agricultural colonies to strengthen their hold.[18] The assault culminated in 119 BC at the Battle of Mobei, where the Han commanders Huo Qubing (d. 117 BC) and Wei Qing (d. 106 BC) forced the Xiongnu court to flee north of the Gobi Desert.[25]","editDateTime":"2013-12-08 12:25:46","resourceCategoryId":4,"dynastyId":5,"x":579,"y":431,"resourceTypeId":1,"iconName":"icon_military","dynastyPeriod":1},{"id":104,"name":"Rare Old Chinese font","description":"assets/data/images/Rare-Old-Chinese-font.jpg","editDateTime":"2013-12-08 11:50:31","resourceCategoryId":4,"dynastyId":5,"x":428,"y":433,"resourceTypeId":2,"iconName":"icon_military","dynastyPeriod":0},{"id":108,"name":"The Evolution of Chinese Armor Han Dynasty","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-08 11:56:59","resourceCategoryId":4,"dynastyId":5,"x":228,"y":221,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":1}]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[{"id":129,"name":"Religion, cosmology, and metaphysics","description":"Families throughout Han China made ritual sacrifices of animals and foodstuffs to deities, spirits, and ancestors at temples and shrines, in the belief that these items could be utilized by those in the spiritual realm. It was thought that each person had a two-part soul: the spirit-soul which journeyed to the afterlife paradise of immortals (xian), and the body-soul  which remained in its grave or tomb on earth and was only reunited with the spirit-soul through a ritual ceremony. These tombs were commonly adorned with uniquely decorated hollow clay tiles that function also as a door jamb to the tomb. Otherwise known as tomb tiles, these artifacts feature holes in the top and bottom of the tile allowing it to pivot. Similar tiles have been found in the Chengdu area of Sichuan province in south-central China.","editDateTime":"2013-12-08 12:34:29","resourceCategoryId":5,"dynastyId":5,"x":538,"y":416,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":0},{"id":132,"name":"Writing materials","description":"Typical ancient Chinese writing materials were bronzewares and animal bones. By the beginning of the Han Dynasty, the chief writing materials were clay tablets, silk cloth, and rolled scrolls made from bamboo strips sewn together with hempen string; these were passed through drilled holes and secured with clay stamps.\r\nThe oldest known Chinese piece of hard, hempen wrapping paper dates to the 2nd century BC. The standard papermaking process was invented by Cai Lun (50–121 AD) in 105 AD. The oldest known surviving piece of paper with writing on it was found in the ruins of a Han watchtower that had been abandoned in 110 AD, in Inner Mongolia.","editDateTime":"2013-12-08 12:38:20","resourceCategoryId":5,"dynastyId":5,"x":460,"y":345,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":2},{"id":133,"name":"Metallurgy and agriculture","description":"Evidence suggests that blast furnaces, that convert raw iron ore into pig iron, which can be remelted in a cupola furnace to produce cast iron by means of a cold blast and hot blast, were operational in China by the late Spring and Autumn Period (722–481 BC). The bloomery was nonexistent in ancient China; however, the Han-era Chinese produced wrought iron by injecting excess oxygen into a furnace and causing decarburization. Cast iron and pig iron could be converted into wrought iron and steel using a fining process. ","editDateTime":"2013-12-08 12:38:35","resourceCategoryId":5,"dynastyId":5,"x":295,"y":213,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":2},{"id":135,"name":"Iron_scissors_E_Han","description":"assets/data/images/Iron_scissors_E_Han.jpg","editDateTime":"2013-12-08 12:40:25","resourceCategoryId":5,"dynastyId":5,"x":238,"y":230,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":2},{"id":136,"name":"Structural engineering","description":"Timber was the chief building material during the Han Dynasty; it was used to build palace halls, multi-story residential towers and halls and single-story houses. Because wood decays rapidly, the only remaining evidence of Han wooden architecture is a collection of scattered ceramic roof tiles. The oldest surviving wooden halls in China date to the Tang Dynasty (618–907 AD). Architectural historian Robert L. Thorp points out the scarcity of Han-era archaeological remains, and claims that often unreliable Han-era literary and artistic sources are used by historians for clues about lost Han architecture.","editDateTime":"2013-12-08 12:42:10","resourceCategoryId":5,"dynastyId":5,"x":503,"y":366,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":1}]},{"id":6,"name":"introduction","chinese":"介绍","resources":[]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":11,"period":0,"dynastyId":5,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5},{"id":12,"period":1,"dynastyId":5,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5},{"id":13,"period":2,"dynastyId":5,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"han_0","audio":"assets/data/audios/han_0.mp3","text":"The Han Dynasty (206 BCE-220 CE), was one of the longest of China’s major dynasties","state":1},{"id":1,"audioId":"han_1","audio":"assets/data/audios/han_1.mp3","text":"In terms of power and prestige","state":1},{"id":2,"audioId":"han_2","audio":"assets/data/audios/han_2.mp3","text":" the Han Dynasty in the East rivalled its almost contemporary Roman Empire in the West","state":1},{"id":3,"audioId":"han_3","audio":"assets/data/audios/han_3.mp3","text":"With only minor interruptions it lasted a span of over four centuries","state":1},{"id":4,"audioId":"han_4","audio":"assets/data/audios/han_4.mp3","text":" and was considered a golden age in Chinese history especially in arts","state":1},{"id":5,"audioId":"han_5","audio":"assets/data/audios/han_5.mp3","text":" politics and technology","state":1},{"id":6,"audioId":"han_6","audio":"assets/data/audios/han_6.mp3","text":"All subsequent Chinese dynasties looked back to the Han period","state":1},{"id":7,"audioId":"han_7","audio":"assets/data/audios/han_7.mp3","text":" as an inspiring model of a united empire and self-perpetuating government.","state":1}]},{"id":6,"name":"sanguo","introduction":"Just as the name implies, the Three Kingdoms were made up of three kingdoms - Wei, Shu and Wu. As a single dynasty, the Three Kingdoms Period originated in 220 AD ,when Wei replaced the Eastern Han Dynasty (25 AD-220 AD) ,and ended in 280 AD when the Wu was defeated by the Court of Jin. It is considered to be a special historical period, full of power struggles and sophisticated military strategies.","startYear":220,"endYear":280,"chinese":0,"enable":1,"totalPeriod":2,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":137,"name":"Three Kingdoms","description":"The \"Three Kingdoms\" (better: Three Empires) Sanguo   (220-280) were three states that succeeded the Eastern Han dynasty   (25-220 CE) and came into being as the surviving dominions of three warlords that contested for imperial power. The empire of Wei (220-265), founded by Cao Pi (known as Emperor Wen of Wei, r. 220-226), is normally seen as the righteous successor of the Han dynasty. It ruled over northern China, while the south was ruled by the empire of Wu (222-280), founded by Sun Quan. The region of Sichuan and Yunnan was ruled by the empire of Shu (221-263) that was founded by Liu Bei. The name \"Three Kingdoms\" has become the common term because it is the popular translation of the historical novel Sanguo yanyi.","editDateTime":"2013-12-08 14:23:44","resourceCategoryId":1,"dynastyId":6,"x":536,"y":474,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":138,"name":"Origin and structure","description":"Together with the Records of the Grand Historian, Book of Han and Book of the Later Han, the Sanguozhi is part of the early four historiographies of the Twenty-Four Histories canon. It contains 65 volumes and about 360,000 Chinese characters which are broken into three books. The Book of Wei contains 30 volumes, the Book of Shu contains 15 volumes while the Book of Wu contains 20 volumes. Each volume is organised in the form of one or more biographies. The amount of space a biography takes up is dictated by the importance of the figure.","editDateTime":"2013-12-08 14:24:11","resourceCategoryId":1,"dynastyId":6,"x":412,"y":445,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":139,"name":"Historical record","description":"The romantic and historical traditions for the Three Kingdoms period have been so confused over the centuries that the Sanguozhi is often regarded as an invaluable resource. Although it contains errors, it is nevertheless more historically accurate than the embellishments of writers in later periods. Many of the political, economic and military figures from the Three Kingdoms period have their own biographies in the Sanguozhi, as are those who contributed to the fields of culture, arts and science. In its nature, the work is indeed a chronicle, much like those of early Medieval Europe written much later. The text is bland and little more than a collection of historical facts.","editDateTime":"2013-12-08 14:24:42","resourceCategoryId":1,"dynastyId":6,"x":559,"y":332,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":140,"name":"Peach garden ceremony","description":"assets/data/images/732px-Peach_garden_ceremony.jpg","editDateTime":"2013-12-08 14:26:26","resourceCategoryId":2,"dynastyId":6,"x":361,"y":241,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":1}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[{"id":141,"name":"Three kingdoms total war2","description":"assets/data/videos/Three_kingdoms_total_war2.webm","editDateTime":"2013-12-08 14:31:37","resourceCategoryId":4,"dynastyId":6,"x":562,"y":435,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":0},{"id":142,"name":"Three kingdoms total war1","description":"assets/data/videos/Three_kingdoms_total_war1.webm","editDateTime":"2013-12-08 14:32:08","resourceCategoryId":4,"dynastyId":6,"x":296,"y":252,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":0},{"id":143,"name":"Zhao Yun vs Cao Ren","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-08 14:44:42","resourceCategoryId":4,"dynastyId":6,"x":545,"y":360,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":0},{"id":144,"name":"Zhao Yun at Battle ofChangban","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-08 14:45:44","resourceCategoryId":4,"dynastyId":6,"x":419,"y":426,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":0},{"id":145,"name":"Three Kingdoms Episode 2010","description":"assets/data/videos/Three_Kingdoms_Episode_2010.webm","editDateTime":"2013-12-08 15:09:39","resourceCategoryId":4,"dynastyId":6,"x":512,"y":440,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":0}]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[]},{"id":6,"name":"introduction","chinese":"介绍","resources":[]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":14,"period":0,"dynastyId":6,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5},{"id":15,"period":1,"dynastyId":6,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"sanguo_0","audio":"assets/data/audios/sanguo_0.mp3","text":"Just as the name implies, the Three Kingdoms were made up of three kingdoms - Wei, Shu and Wu","state":1},{"id":1,"audioId":"sanguo_1","audio":"assets/data/audios/sanguo_1.mp3","text":"As a single dynasty","state":1},{"id":2,"audioId":"sanguo_2","audio":"assets/data/audios/sanguo_2.mp3","text":" the Three Kingdoms Period originated in 220 AD ","state":1},{"id":3,"audioId":"sanguo_3","audio":"assets/data/audios/sanguo_3.mp3","text":"when Wei replaced the Eastern Han Dynasty (25 AD-220 AD) ","state":1},{"id":4,"audioId":"sanguo_4","audio":"assets/data/audios/sanguo_4.mp3","text":"and ended in 280 AD when the Wu was defeated by the Court of Jin","state":1},{"id":5,"audioId":"sanguo_5","audio":"assets/data/audios/sanguo_5.mp3","text":"It is considered to be a special historical period","state":1},{"id":6,"audioId":"sanguo_6","audio":"assets/data/audios/sanguo_6.mp3","text":" full of power struggles and sophisticated military strategies.","state":1}]},{"id":7,"name":"jin","introduction":"The Jin Dynasty consists of two dynasties, the Western Jin (265 -316) and the Eastern Jin (317 - 420), the Western Jin was founded by Sima Yan with Luoyang as its capital city, while the Eastern Jin was founded by Sima Rui with Jiankang, (currently Nanjing) as its capital.","startYear":265,"endYear":420,"chinese":0,"enable":1,"totalPeriod":2,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":146,"name":"Foundation","description":"The Sima clan was initially subordinate to the Wei dynasty, but the clan's influence and power grew greatly after the incident at Gaoping tombs in 249. In 263, Sima Zhao unified the lands of Shu and captured Liu Shan. In 264, Zhong Hui rebelled against Sima Zhao. In 265, Sima Yan forced emperor Cao Huan of Wei to abdicate the throne to him, ending Wei and starting Jin (as Emperor Wu). He named his dynasty after the state of Jin of the Spring and Autumn Period that once ruled the Sima clan's home county of Wen in Henei (present day Wen County, Henan). In 280, the Jin conquered Eastern Wu and unified China, but internal conflicts, corruption, and political turmoil quickly weakened the dynasty, and the unification lasted only ten years. Upon the advent of the second Jin emperor, Emperor Hui, various imperial princes tried to grab power in the devastating War of the Eight Princes. The Wu Hu uprising followed, during which large numbers of refugees fled south while the north was occupied by various nomadic groups. This marked the end of the Western Jin dynasty in 316 when the Jin court evacuated to the region south of the Huai River, and the beginning of the Eastern Jin and the Sixteen Kingdoms period.","editDateTime":"2013-12-08 16:46:48","resourceCategoryId":1,"dynastyId":7,"x":442,"y":464,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":157,"name":"Jin ceramics","description":"The Jin Dynasty is well known for the quality of its greenish celadon porcelain wares, which immediately followed the development of proto-celadon. Jar designs often incorporated animal, as well as Buddhist, figures.","editDateTime":"2013-12-08 17:06:50","resourceCategoryId":2,"dynastyId":7,"x":515,"y":443,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[{"id":147,"name":"Celadon lion shaped Bixie","description":"assets/data/images/Celadon_lion_shaped_Bixie_Western_Jin_period_265_317CE.jpg","editDateTime":"2013-12-08 16:47:58","resourceCategoryId":3,"dynastyId":7,"x":396,"y":471,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":148,"name":"Celadon Lian bowl with Buddhist figures","description":"assets/data/images/794px-Celadon_Lian_bowl_with_Buddhist_figures_Western_Jin_265_317CE.jpg","editDateTime":"2013-12-08 16:49:50","resourceCategoryId":3,"dynastyId":7,"x":577,"y":451,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":149,"name":"Celadon jar","description":"assets/data/images/496px-Celadon_jar_Eastern_Jin_317_420_CE.jpg","editDateTime":"2013-12-08 16:51:14","resourceCategoryId":3,"dynastyId":7,"x":559,"y":361,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":150,"name":"Seven Sages of the Bamboo Grove","description":"assets/data/images/assets/Seven_Sages_of_the_Bamboo_Grove.jpg","editDateTime":"2013-12-08 16:52:32","resourceCategoryId":3,"dynastyId":7,"x":525,"y":407,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":151,"name":"Celadon jar with brown spots","description":"assets/data/images/499px-Celadon_jar_with_brown_spots_Eastern_Jin_317_420_CE.jpg","editDateTime":"2013-12-08 16:54:40","resourceCategoryId":3,"dynastyId":7,"x":500,"y":463,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":152,"name":"mural painting ","description":"assets/data/images/muralpaintingsofeasternjindynasty-travel.jpg","editDateTime":"2013-12-08 16:56:50","resourceCategoryId":3,"dynastyId":7,"x":477,"y":480,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":153,"name":"Wu Daozi Sage in Chinese Painting","description":"assets/data/images/Wu_Daozi_Sage_in_Chinese_Painting.jpg","editDateTime":"2013-12-08 16:59:45","resourceCategoryId":3,"dynastyId":7,"x":433,"y":428,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":154,"name":"Nymph of the Luo River","description":"assets/data/images/Nymph_of_the_Luo_River.jpg","editDateTime":"2013-12-08 17:01:33","resourceCategoryId":3,"dynastyId":7,"x":468,"y":357,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":155,"name":"Paintings of Sui Tang King","description":"assets/data/images/Nymph_of_the_Luo_River.jpg","editDateTime":"2013-12-08 17:02:43","resourceCategoryId":3,"dynastyId":7,"x":556,"y":456,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":178,"name":"Paintings","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-08 18:53:02","resourceCategoryId":3,"dynastyId":7,"x":577,"y":426,"resourceTypeId":3,"iconName":"icon_culture","dynastyPeriod":1}]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[{"id":156,"name":"The Evolution of Chinese Armor Han to Sui Dynasty","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-08 17:04:52","resourceCategoryId":4,"dynastyId":7,"x":271,"y":251,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":0}]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[]},{"id":6,"name":"introduction","chinese":"介绍","resources":[]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":16,"period":0,"dynastyId":7,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5},{"id":17,"period":1,"dynastyId":7,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"jin_0","audio":"assets/data/audios/jin_0.mp3","text":"The Jin Dynasty consists of two dynasties","state":1},{"id":1,"audioId":"jin_1","audio":"assets/data/audios/jin_1.mp3","text":" the Western Jin (265 -316) and the Eastern Jin (317 - 420)","state":1},{"id":2,"audioId":"jin_2","audio":"assets/data/audios/jin_2.mp3","text":" the Western Jin was founded by Sima Yan with Luoyang as its capital city","state":1},{"id":3,"audioId":"jin_3","audio":"assets/data/audios/jin_3.mp3","text":" while the Eastern Jin was founded by Sima Rui with Jiankang","state":1},{"id":4,"audioId":"jin_4","audio":"assets/data/audios/jin_4.mp3","text":" (currently Nanjing) as its capital.","state":1}]},{"id":9,"name":"nanbeichao","introduction":"China was divided to the northern part, and the southern part in Dong Jin dynasty. The northern was apposed by the southern for a long time. There were four dynasties in the south, Song, Qi, Liang, Chen. They replaced each other from the begin to the end. The dynasties in the south sharing one capital, in Jiang Kang( Nan Jing in today) besides Jiang Ling, which is the capital city of Liang Yuan Di.","startYear":386,"endYear":589,"chinese":0,"enable":1,"totalPeriod":2,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":158,"name":"General Introduction","description":"China was divided to the northern part and the southern part in Dong Jin dynasty. The northern was apposed by the southern for a long time. There were four dynasties in the south, Song, Qi, Liang, Chen. They replaced each other from the begin to the end. The dynasties in the south sharing one capital in Jiang Kang( Nan Jing in today) besides Jiang Ling, which is the capital city of Liang Yuan Di.","editDateTime":"2013-12-08 18:11:45","resourceCategoryId":1,"dynastyId":9,"x":456,"y":414,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":159,"name":"History","description":"China was at that time divided into a single state in the south and full of small states in the north from 316, the year the Hun took power has Chang’an. Hun tribes  is supposedly to be  named  Xiongnu, powerful groups in steppes of central and eastern Asia, probably one state or confederation, mostly nomadic people living at China borders known also as Mongolia tribes. \r\n\r\nChang’an is known as Xi’an in Shaanxi province. Competitor against Roma and Constantinople as biggest city in the world under Sui and Tang dynasties. Also known to be the place of Terra cotta warriors army.","editDateTime":"2013-12-08 18:15:35","resourceCategoryId":1,"dynastyId":9,"x":432,"y":463,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":160,"name":"The sixteen dynasties","description":"The time while the Jin dynasty in the south was pushed out but maintained itself as the “eastern Jin dynasty” is called the time of the sixteen dynasties because in the north of China, no fewer than 16 kingdoms were formed, mostly by “barbarian” peoples. These Hun, Tibetan, or Mongolian “dynasties” were not in the slightest reminiscent of Chinese culture, keeping their own customs, languages, and administrative techniques.","editDateTime":"2013-12-08 18:16:08","resourceCategoryId":1,"dynastyId":9,"x":503,"y":472,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":161,"name":"The sixteen dynasties continue","description":"One exception was the Toba, who in 386 founded the Wei dynasty in the north and whose rulers, like their Chinese models, designated themselves emperors; the Toba brought the entire north under their control by 439 C.E., ending the period of the sixteen dynasties. They modeled themselves after the Chinese civil administration, carried out a land reform, and in general became more Chinese-like. The Toba emperor Xiao Wen (reign: 471 – 499) particularly drove such developments: he specified that Chinese be the only recognized official language, the Toba had to take on Chinese names and wear clothes patterned after Chinese style. But the “sinologization” failed at court because of inner resistance, and the Toba realm disintegrated into many smaller empires.","editDateTime":"2013-12-08 18:16:12","resourceCategoryId":1,"dynastyId":9,"x":546,"y":423,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":162,"name":"The sixteen dynasties in the north","description":"In the course of these rotating dynasties, neither northern tribes nor southern houses of lords was able to gain the upper hand over the other.","editDateTime":"2013-12-08 18:16:39","resourceCategoryId":1,"dynastyId":9,"x":550,"y":458,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":163,"name":"Background","description":"After the collapse of a united China under the Han dynasty in 220 due in large part to the Yellow Turban and Five Pecks of Rice rebellions, China eventually coalesced into the Three Kingdoms. Of these Three Kingdoms, Cao Wei was the strongest followed by Eastern Wu and Shu Han, but they were initially in a relatively stable formation. After a 249 coup by Sima Yi, the Sima family essentially controlled Cao Wei and soon conquered Shu Han. Following a failed coup by the ruling Cao family against the Sima family, the final Cao ruler abdicated. Sima Yan then founded the Jin Dynasty and in 280 conquered Eastern Wu, ending the Three Kingdoms and uniting China again.","editDateTime":"2013-12-08 18:18:59","resourceCategoryId":1,"dynastyId":9,"x":434,"y":290,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":164,"name":"The Southern Dynasties","description":"The Jin were supplanted by the Liu Song (420–479), the Southern Qi (479–502), the Liang Dynasty (502–557), and then the Chen Dynasty (557–589). Because all of these dynasties had their capital at Jiankang (with the exception of Liang after they moved their capital), they are sometimes grouped together with Eastern Wu and Eastern Jin as the Six Dynasties. The rulers of these short-lived dynasties were generals who seized and then held power for several decades, but were unable to securely pass power of rule onto their heirs to continue their dynasty successfully. Emperor Wu of Liang (502–549), however, was the most notable ruler of his age, being a patron of the arts and of Buddhism. Under the later waning leadership of the Chen Dynasty, the southern Chinese were unable to resist the military power amassed in the north by Yang Jian, who declared himself Emperor Wen of Sui and invaded the south to reunify China.","editDateTime":"2013-12-08 18:19:53","resourceCategoryId":1,"dynastyId":9,"x":472,"y":331,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":165,"name":"Liu Song (420–479)","description":"Liu Song founder Liu Yu was originally a leader of the Army of the Northern Garrison that notably won the Battle of Fei River in 383. In 404, he helped suppress Huan Xuan's rebellion, leading to his dominance over the Eastern Jin court. In order to gain popularity to take the throne, Liu Yu undertook two northern expeditions against the Sixteen Kingdoms, capturing Shandong, Henan, and briefly Guanzhong by 416. He gave up Guanzhong to try to take the throne. Because he believed in a prophecy saying there would be one more emperor after Emperor An of Jin, he deposed Emperor An, and soon afterwards Emperor An's replacement, Emperor Gong of Jin in 420, ending the Eastern Jin dynasty. Even after crowning himself Emperor Wu of Liu Song, he remained diligently frugal. However, he did not care for education and trusted unsavory people. He felt that the nobility had too much power, so he tended to appoint the lower classes to government positions and gave military power to imperial kinsmen. Ironically, because the imperial kinsmen stabilized their military power and wished to gain political power, Emperor Wu was afraid they would have thoughts of usurping the throne. Thus, he frequently killed his kinsmen.","editDateTime":"2013-12-08 18:20:34","resourceCategoryId":1,"dynastyId":9,"x":461,"y":403,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":166,"name":"Southern Qi (479–502)","description":"Though distantly related, the Southern Qi and the following Liang dynasty were members of the Xiao family from Lanling (in modern Cangshan County, Shandong). Because Emperor Gao had a low social standing, he earned the disdain of nobility. His style of governance was similar to the early style of the Liu Song dynasty and was very economical. He died in the fourth year of his reign and his heir, who was only 13 years younger than him, succeeded him as Emperor Wu of Southern Qi. Emperor Wu made peace with the Northern Wei, content to protect his borders. This period of peace was known as Yongming Administration. He also used government secretaries appointed with provincial governors and members of the imperial clan to monitor them.","editDateTime":"2013-12-08 18:21:35","resourceCategoryId":1,"dynastyId":9,"x":544,"y":322,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":167,"name":"Liang (502–557)","description":"Emperor Wu was economical, worked hard at governing, and cared for the common people. His early reign was known as Tianjian Administration. The Liang dynasty's military strength gradually surpassed the strength of the Northern Wei, who suffered internal strife due to their policy of sinicization. In 503, the Northern Wei invaded but were defeated at Zhongli (modern Bengbu). Emperor Wu supported the Northern Expeditions but did not aggressively take advantage of his victory in 516 at Shouyang due to heavy casualties. Given the excessive kin-slaughter in the Liu Song and Southern Qi dynasties, Emperor Wu was very lenient to imperial clansmen, not even investigating them when they committed crimes. Because he was very learned, supported scholars, and encouraged the flourishing education system, the Liang dynasty reached a cultural peak. An avid poet, Emperor Wu was fond of gathering many literary talents at court, and even held poetry competitions with prizes of gold or silk for those considered the best.","editDateTime":"2013-12-08 18:22:06","resourceCategoryId":1,"dynastyId":9,"x":507,"y":451,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":168,"name":"Chen (557–589)","description":"Emperor Wu of Chen came from the region of Wu (a region near modern-day Shanghai). At that time, due to the Hou Jing rebellion, the Qiao and Wu clans were greatly weakened, and many independent regimes emerged. Emperor Wu could not pacify all the independent regimes, so he adopted conciliatory measures. After the sudden death of Emperor Wu, his nephew Chen Qian took power as Emperor Wen of Chen. After the fall of Liang, the general Wang Lin had established an independent kingdom based in modern day Hunan and Hubei provinces and was now starting to cause trouble. Wang Lin allied with Northern Wei and Northern Qi to conquer the Chen capital at Jiankang. Emperor Wen first defeated the combined forces of Northern Qi and Wang Lin before preventing the forces of Northern Wei from entering the South at Yueyang. Furthermore, through Emperor Wen's extensive efforts at good governance, the economic situation of the South was greatly improved, restoring his kingdom's national strength.","editDateTime":"2013-12-08 18:22:50","resourceCategoryId":1,"dynastyId":9,"x":525,"y":485,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":171,"name":"Demographic changes","description":"It was during the Southern and Northern Dynasties period that the earliest recorded migration of ethnic Han Chinese to southern China (below the Yangtze River) took place. This sinicisation helped to develop the region from its previous state of being inhabited by only small and isolated communities separated by vast uncolonized wilderness of non-Chinese tribes. During this period, the south went from being nearly a frontier to being on a path to the thriving, urbanized, sinicized region that it became in later centuries. In his book Buddhism in Chinese History, Arthur F. Wright points out this fact by stating","editDateTime":"2013-12-08 18:27:23","resourceCategoryId":2,"dynastyId":9,"x":371,"y":269,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":0},{"id":173,"name":"Emperor Wu of Chen","description":"assets/data/images/Emperor_Wu_of_Chen.jpg","editDateTime":"2013-12-08 18:29:49","resourceCategoryId":2,"dynastyId":9,"x":586,"y":439,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":1},{"id":177,"name":"The_Northern and Southern dynasties","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-08 18:48:09","resourceCategoryId":2,"dynastyId":9,"x":473,"y":365,"resourceTypeId":3,"iconName":"icon_society","dynastyPeriod":1}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[{"id":172,"name":"Riders on Horseback, Northern Qi Dynasty","description":"assets/data/images/Riders_on_Horseback_Northern_Qi_Dynasty.jpg","editDateTime":"2013-12-08 18:27:37","resourceCategoryId":3,"dynastyId":9,"x":541,"y":456,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":174,"name":"Northern WeiMaitreya","description":"assets/data/images/NorthernWeiMaitreya.jpg","editDateTime":"2013-12-08 18:32:13","resourceCategoryId":3,"dynastyId":9,"x":568,"y":388,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":176,"name":"Nvshizhentu","description":"assets/data/images/800px-Nvshizhentu.jpg","editDateTime":"2013-12-08 18:34:01","resourceCategoryId":3,"dynastyId":9,"x":477,"y":305,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0}]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[{"id":169,"name":"Philosophy","description":"Confucianism's unchallenged domination of Chinese culture and thought was greatly weakened during the Jin Dynasty, which lead to a wide diversification of political thought and philosophy by the time of the Southern and Northern Dynasties. This era produced a myriad of writers that advocated practical systems of governance and administration, such as Cao Cao and Zhuge Liang in the Three Kingdoms Period, Wang Dao and Bao Jingyan of the Eastern Jin, as well as Fan Zhen, Xing Shao, and Fan Xun of the Southern and Northern period. Much of the philosophy of the period is despondent and dispirited, and a number of scholars and poets became reclusive mountain hermits living apart from society.[2] Of these various trends, the most influential was Neo-Daoism. Neo-Daoism was highly influential during the Southern Dynasty, to the point that Emperor Wen of Liu Song established a Neo-Daoist Academy and promoted it, along with Confucianism, literature, and history, as the four great subjects of study. A phenomenon known as \"empty chat\" became common, where educated men would meet and talk about philosophy all day without paying any attention to \"mundane\" things such as their profession or family. The phenomenon gradually waned during the Sui Dynasty, though it did not fully disappear until the Tang Dynasty.","editDateTime":"2013-12-08 18:23:26","resourceCategoryId":5,"dynastyId":9,"x":536,"y":323,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":0},{"id":170,"name":"Literature","description":"Literature was particularly vibrant during the Southern Dynasty and tended to be flowery and frilly, while Northern Dynasty literature was rougher and more straightforward. Notable writers include Yu Xin, Xing Fang, Wei Shou, and Wen Zisheng of the Northern Dynasty. In poetry, fu poetry continued to be a dominant genre, though the five-syllable form that achieved great prominence during the Tang dynasty gradually increased in popularity. In the Southern Dynasty, a type of essay known as pian wen, which used metered rhyme, flowery language, and classical allusions, became popular. Writings often spoke of removing oneself from everyday material existence and jettisoning cares and anxiety.","editDateTime":"2013-12-08 18:25:39","resourceCategoryId":5,"dynastyId":9,"x":438,"y":276,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":0}]},{"id":6,"name":"introduction","chinese":"介绍","resources":[]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":18,"period":0,"dynastyId":9,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5},{"id":19,"period":1,"dynastyId":9,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"nanbeichao_0","audio":"assets/data/audios/nanbeichao_0.mp3","text":"China was divided to the northern part, and the southern part in Dong Jin dynasty","state":1},{"id":1,"audioId":"nanbeichao_1","audio":"assets/data/audios/nanbeichao_1.mp3","text":"The northern was apposed by the southern for a long time","state":1},{"id":2,"audioId":"nanbeichao_2","audio":"assets/data/audios/nanbeichao_2.mp3","text":"There were four dynasties in the south, Song, Qi, Liang, Chen","state":1},{"id":3,"audioId":"nanbeichao_3","audio":"assets/data/audios/nanbeichao_3.mp3","text":"They replaced each other from the begin to the end","state":1},{"id":4,"audioId":"nanbeichao_4","audio":"assets/data/audios/nanbeichao_4.mp3","text":"The dynasties in the south sharing one capital","state":1},{"id":5,"audioId":"nanbeichao_5","audio":"assets/data/audios/nanbeichao_5.mp3","text":" in Jiang Kang( Nan Jing in today) besides Jiang Ling","state":1},{"id":6,"audioId":"nanbeichao_6","audio":"assets/data/audios/nanbeichao_6.mp3","text":" which is the capital city of Liang Yuan Di.","state":1}]},{"id":10,"name":"sui","introduction":"Started from 581 and ended in 618, the Sui Dynasty lasted for only 38 years and had only three emperors. With a tyrannical second emperor - Emperor Yang, this dynasty was often compared to the Qin Dynasty (221 BC - 206 BC). However, the whole nation was reunified and certain economic, and political advances were achieved in the period.","startYear":581,"endYear":618,"chinese":0,"enable":1,"totalPeriod":2,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":179,"name":"Emperor Wen and the founding of the Sui Dynasty","description":"When the Northern Zhou Dynasty defeated the Northern Qi Dynasty in 577 CE, this was the culminating moment and ultimate advantage for the northern Chinese to face south. The southern dynasties had lost hope in conquering the north, and the situation of conquest from north-to-south was only delayed in 523 with civil war.\r\n\r\nIn his campaign for southern conquest, Emperor Wen assembled thousands of boats to confront the naval forces of the Chen Dynasty on the Yangtze River. The largest of these ships were very tall, having five layered decks and the capacity for 800 passengers. They were outfitted with six 50-foot-long booms that were used to swing and damage enemy ships, or to pin them down so that Sui marine troops could use act-and-board techniques.[3] Besides employing Xianbei and other Chinese ethnic groups for the fight against Chen, Emperor Wen also employed the service of aborigines from southeastern Sichuan, a people that Sui had recently conquered.[3]\r\nIn 588 CE, the Sui had amassed 518,000 troops along the northern bank of the Yangtze River, stretching from Sichuan to the Pacific Ocean.[4] Meanwhile, the Chen Dynasty was collapsing and could not withstand such an assault. By 589 CE, Sui troops entered Jiankang (Nanjing) and the last emperor of the southern Chen dynasty surrendered. The city was razed to the ground, while Sui troops escorted Chen nobles back north, where the northern aristocrats became fascinated with everything the south had to provide culturally and intellectually.\r\nAlthough Emperor Wen was famous for bankrupting the state treasury with warfare and construction projects, he made many improvements to infrastructure during his early reign. He established granaries as sources of food and as a means to regulate market prices from the taxation of crops, much like the earlier Han Dynasty.","editDateTime":"2013-12-08 21:49:36","resourceCategoryId":1,"dynastyId":10,"x":555,"y":421,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":180,"name":"Emperor Yang of Sui","description":"Emperor Yang of Sui gained the throne after his father's death, possibly by murder. He further extended the empire but unlike his father he did not seek to gain support from the nomads. Instead, he restored Confucian education and the Confucian examination system for bureaucrats. By supporting educational reforms, he lost the support of the nomads. He also started many expensive construction projects such as the Grand Canal of China, and became embroiled in several costly wars. Between these policies, invasions into China from Turkic nomads, and his growing life of decadent luxury at the expense of the peasantry, he lost public support and was eventually assassinated by his own ministers.","editDateTime":"2013-12-08 21:50:02","resourceCategoryId":1,"dynastyId":10,"x":546,"y":354,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":181,"name":"Goguryeo-Sui wars","description":"The biggest factor that led to the downfall of Sui Dynasty was a series of massive expeditions into the Korean Peninsula to invade Goguryeo, one of the Three Kingdoms of Korea. The Sui Dynasty's second emperor, Emperor Yang conscripted many soldiers for the campaign. This army was so enormous it recorded in historical texts that it took 30 days for all the armies to exit their last rallying point near Shanhaiguan before invading Korea. In one instance the soldiers—both conscripted and paid—listed over 3000 warships, up to 1.15 million infantry, 50,000 cavalry, 5000 artillery, and more. There were as many supporting laborers and an exorbitant military budget that included mounds of equipment and rations (most of which never reached the Chinese vanguard, as they were captured by Goguryeo armies already). The army stretched to 1000 li or about 410 kilometers across rivers and valleys, over mountains and hills.","editDateTime":"2013-12-08 21:50:21","resourceCategoryId":1,"dynastyId":10,"x":505,"y":316,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":182,"name":"Fall","description":"One great accomplishment was rebuilding the Great Wall of China[citation needed], but this, along with other large projects, strained the economy and angered the resentful workforce employed. During the last few years of the Sui Dynasty, the rebellion that rose against it took many of China's able-bodied men from rural farms and other occupations, which in turn damaged the agricultural base and the economy further. Men would deliberately break their limbs in order to avoid military conscription, calling the practice \"propitious paws\" and \"fortunate feet.\" In the year 642, Emperor Taizong of Tang made an effort to eradicate this practice by issuing a decree of a stiffer punishment for those who were found to deliberately injure and heal themselves.","editDateTime":"2013-12-08 21:51:05","resourceCategoryId":1,"dynastyId":10,"x":486,"y":411,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":183,"name":"Buddhism","description":"Buddhism was popular during the Six Dynasties period that preceded the Sui dynasty, spreading from India through Kushan Afghanistan into China during the Late Han period. Buddhism gained prominence during the period when central political control was limited. Buddhism created a unifying cultural force that uplifted the people out of war and into the Sui Dynasty. In many ways, Buddhism was responsible for the rebirth of culture in China under the Sui Dynasty.","editDateTime":"2013-12-08 21:52:38","resourceCategoryId":1,"dynastyId":10,"x":501,"y":471,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":187,"name":"Establishment","description":"At the end of the Northern and Southern Dynasties (386 - 589), the whole nation had undergone a long period of division. People who had endured sufferings of war were longing for the unification but neither the Northern Dynasties nor Southern Dynasties realized this goal.","editDateTime":"2013-12-08 21:56:48","resourceCategoryId":1,"dynastyId":10,"x":489,"y":417,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":185,"name":"Sui Dynasty Pilgrim Flask","description":"assets/data/images/559px-Sui_Dynasty_Pilgrim_Flask.jpg","editDateTime":"2013-12-08 21:54:30","resourceCategoryId":1,"dynastyId":10,"x":371,"y":287,"resourceTypeId":2,"iconName":"icon_history","dynastyPeriod":1},{"id":186,"name":"Cernuschi Museum","description":"assets/data/images/204px-Cernuschi_Museum_20060812_111.jpg","editDateTime":"2013-12-08 21:55:33","resourceCategoryId":1,"dynastyId":10,"x":554,"y":446,"resourceTypeId":2,"iconName":"icon_history","dynastyPeriod":0}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":188,"name":"Economical and Political Prosperity","description":"As a result of the reunification, the society became stable and peaceful which encouraged economical and political development.","editDateTime":"2013-12-08 21:57:49","resourceCategoryId":2,"dynastyId":10,"x":541,"y":365,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":0},{"id":190,"name":"The Sui Dynasty A Violent Reunification","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-08 22:14:07","resourceCategoryId":2,"dynastyId":10,"x":403,"y":292,"resourceTypeId":3,"iconName":"icon_society","dynastyPeriod":0}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[{"id":175,"name":"Buddhist paintings Yungang","description":"assets/data/images/450px-Buddhist_paintings_Yungang.jpg","editDateTime":"2013-12-08 18:33:11","resourceCategoryId":3,"dynastyId":10,"x":331,"y":285,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":184,"name":"Sui Bod hi sattva","description":"assets/data/images/SuiBodhisattva.jpg","editDateTime":"2013-12-08 21:53:24","resourceCategoryId":3,"dynastyId":10,"x":432,"y":321,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1}]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[{"id":189,"name":"The Evolution of Chinese Armor Han to Sui Dynasty","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-08 22:10:54","resourceCategoryId":4,"dynastyId":10,"x":504,"y":324,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":0}]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[]},{"id":6,"name":"introduction","chinese":"介绍","resources":[]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":20,"period":0,"dynastyId":10,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5},{"id":21,"period":1,"dynastyId":10,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"sui_0","audio":"assets/data/audios/sui_0.mp3","text":"Started from 581 and ended in 618","state":1},{"id":1,"audioId":"sui_1","audio":"assets/data/audios/sui_1.mp3","text":" the Sui Dynasty lasted for only 38 years and had only three emperors","state":1},{"id":2,"audioId":"sui_2","audio":"assets/data/audios/sui_2.mp3","text":"With a tyrannical second emperor - Emperor Yang","state":1},{"id":3,"audioId":"sui_3","audio":"assets/data/audios/sui_3.mp3","text":" this dynasty was often compared to the Qin Dynasty (221 BC - 206 BC). However","state":1},{"id":4,"audioId":"sui_4","audio":"assets/data/audios/sui_4.mp3","text":" the whole nation was reunified and certain economic","state":1},{"id":5,"audioId":"sui_5","audio":"assets/data/audios/sui_5.mp3","text":" and political advances were achieved in the period.","state":1}]},{"id":11,"name":"tang","introduction":"Tang Dynasty was the most glistening historic period in China's history. Founded in 618 and ending in 907, the state, under the ruling of the Tang Emperors, became the most powerful and prosperous country in the world. Particularly, in this glorious period, the economy, politics, culture and military strength reached an unparalleled advanced level.","startYear":618,"endYear":907,"chinese":0,"enable":1,"totalPeriod":4,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":19,"name":"Establishment","description":"The Li family belonged to the northwest military aristocracy prevalent during the reign of the Sui emperors. The mothers of both Emperor Yang of Sui (r. 604–617) and the founding emperor of Tang were sisters, making these two emperors of different dynasties first cousins. Li Yuan (later to become Emperor Gaozu of Tang, r. 618–626) was the Duke of Tang and former governor of Taiyuan when other government officials were fighting off bandit leaders in the collapse of the Sui Empire, caused in part by a failed Korean campaign. With prestige and military experience, he later rose in rebellion along with his son and his equally militant daughter Princess Pingyang (d. 623) who raised her own troops and commanded them. In 617, Li Yuan occupied Chang'an and acted as regent over a puppet child emperor of the Sui, relegating Emperor Yang to the position of Taishang Huang, or retired emperor/father of the present emperor. With the news of Emperor Yang's murder by his general Yuwen Huaji (d. 619), on June 18, 618, Li Yuan declared himself the emperor of a new dynasty, the Tang.","editDateTime":"2013-10-10 20:33:52","resourceCategoryId":1,"dynastyId":11,"x":496,"y":417,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":20,"name":"Initial reforms","description":"Taizong set out to solve internal problems within the government which had constantly plagued past dynasties. Building upon the Sui legal code, he issued a new legal code that subsequent Chinese dynasties would model theirs upon, as well as neighboring polities in Vietnam, Korea, and Japan. The earliest law code to survive though was the one established in the year 653, which was divided into 500 articles specifying different crimes and penalties ranging from ten blows with a light stick, one hundred blows with a heavy rod, exile, penal servitude, or execution. The legal code clearly distinguished different levels of severity in meted punishments when different members of the social and political hierarchy committed the same crime. For example, the severity of punishment was different when a servant or nephew killed a master or an uncle than when a master or uncle killed a servant or nephew. The Tang Code was largely retained by later codes such as the early Ming Dynasty (1368–1644) code of 1397, yet there were several revisions in later times, such as improved property rights for women during the Song Dynasty","editDateTime":"2013-10-10 20:36:01","resourceCategoryId":1,"dynastyId":11,"x":448,"y":475,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":21,"name":"Imperial examinations","description":"Following the Sui Dynasty's example, the Tang abandoned the nine-rank system in favor of a service system. Students of Confucian studies were potential candidates for the imperial examinations, the graduates of which could be appointed as state bureaucrats in the local, provincial, and central government. There were two types of exams that were given, mingjing ('illuminating the classics examination') and jinshi ('presented scholar examination').  The mingjing was based upon the Confucian classics and tested the student's knowledge of a broad variety of texts. The jinshi tested a student's literary abilities in writing essay-style responses to questions on matters of governance and politics, as well as their skills in composing poetry. Candidates were also judged on their skills of deportment, appearance, speech, and level of skill in calligraphy, all of which were subjective criteria that allowed the already wealthy members of society to be chosen over ones of more modest means who were unable to be educated in rhetoric or fanciful writing skills. There was a disproportionate number of civil officials coming from aristocratic as opposed to non-aristocratic families. The exams were open to all male subjects whose fathers were not of the artisan or merchant classes, although having wealth or noble status was not a prerequisite in receiving a recommendation. In order to promote widespread Confucian education, the Tang government established state-run schools and issued standard versions of the Five Classics with selected commentaries.","editDateTime":"2013-10-10 20:37:28","resourceCategoryId":1,"dynastyId":11,"x":570,"y":455,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":22,"name":"Religion and politics","description":"From the outset, religion played a role in Tang politics. In his bid for power, Li Yuan had attracted a following by claiming descent from the Daoist sage Laozi (fl. 6th century BC). People bidding for office would have monks from Buddhist temples pray for them in public in return for cash donations or gifts if the person was selected. Before the persecution of Buddhism in the 9th century, Buddhism and Daoism were accepted side by side, and Emperor Xuanzong of Tang (r. 712–56) invited monks and clerics of both religions to his court. At the same time Xuanzong exalted the ancient Laozi by granting him grand titles, wrote commentary on the Daoist Laozi, set up a school to prepare candidates for examinations on Daoist scriptures, and called upon the Indian monk Vajrabodhi (671–741) to perform Tantric rites to avert a drought in the year 726. In 742 Emperor Xuanzong personally held the incense burner during the ceremony of the Ceylonese monk Amoghavajra (705–74) reciting \"mystical incantations to secure the victory of Tang forces.\" While religion played a role in politics, politics also played a role in religion. In the year 714, Emperor Xuanzong forbade shops and vendors in the city of Chang'an to sell copied Buddhist sutras, instead giving the Buddhist clergy of the monasteries the sole right to distribute sutras to the laity. In the previous year of 713, Emperor Xuanzong had liquidated the highly lucrative Inexhaustible Treasury, which was run by a prominent Buddhist monastery in Chang'an. This monastery collected vast amounts of money, silk, and treasures through multitudes of anonymous people's repentances, leaving the donations on the monastery's premise. Although the monastery was generous in donations, Emperor Xuanzong issued a decree abolishing their treasury on grounds that their banking practices were fraudulent, collected their riches, and distributed the wealth to various other Buddhist monasteries, Daoist abbeys, and to repair statues, halls, and bridges in the city.","editDateTime":"2013-10-10 20:38:45","resourceCategoryId":1,"dynastyId":11,"x":498,"y":466,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":23,"name":"Taxes and the census","description":"The Tang Dynasty government attempted to create an accurate census of the size of their empire's population, mostly for effective taxation and matters of military conscription for each region. The early Tang government established both the grain tax and cloth tax at a relatively low rate for each household under the empire. This was meant to encourage households to enroll for taxation and not avoid the authorities, thus providing the government with the most accurate estimate possible. In the census of 609, the population was tallied by efforts of the government at a size of 9 million households, or about 50 million people. The Tang census of 742 again approximated the size of China's population at about 50 million people. Patricia Ebrey writes that even if a rather significant number of people had avoided the registration process of the tax census, the population size during the Tang had not grown significantly since the earlier Han Dynasty (the census of the year 2 recording a population of roughly 58 million people in China). S.A.M. Adshead disagrees, estimating that there were about 75 million people by 750","editDateTime":"2013-10-10 20:40:11","resourceCategoryId":1,"dynastyId":11,"x":548,"y":401,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":26,"name":"Turkic and Western regions","description":"The Sui and Tang carried out very successful military campaigns against the steppe nomads. Chinese foreign policy to the north and west now had to deal with Turkic nomads, who were becoming the most dominant ethnic group in Central Asia.[58][59] To handle and avoid any threats posed by the Turks, the Sui government repaired fortifications and received their trade and tribute missions.[29] They sent royal princesses off to marry Turkic clan leaders, a total of four of them in 597, 599, 614, and 617. The Sui stirred trouble and conflict amongst ethnic groups against the Turks.[60][61] As early as the Sui Dynasty, the Turks had become a major militarized force employed by the Chinese. When the Khitans began raiding northeast China in 605, a Chinese general led 20,000 Turks against them, distributing Khitan livestock and women to the Turks as a reward.[62] On two occasions between 635 to 636, Tang royal princesses were married to Turk mercenaries or generals in Chinese service.[61] Throughout the Tang Dynasty until the end of 755, there were approximately ten Turkic generals serving under the Tang.[63][64] While most of the Tang army was made of fubing Chinese conscripts, the majority of the troops led by Turkic generals were of non-Chinese origin, campaigning largely in the western frontier where the presence of fubing troops was low.[65] Some \"Turkic\" troops were nomadisized Han Chinese, a desinicized people.","editDateTime":"2013-10-10 20:43:11","resourceCategoryId":2,"dynastyId":11,"x":631,"y":253,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":2},{"id":27,"name":"Silk Road","description":"The Silk Road was the most important pre-modern Eurasian trade route. During this period of the Pax Sinica, the Silk Road reached its golden age, whereby Persian and Sogdian merchants benefited from the commerce between East and West. At the same time, the Chinese empire welcomed foreign cultures making it very cosmopolitan in its urban centers.","editDateTime":"2013-10-10 20:44:08","resourceCategoryId":2,"dynastyId":11,"x":475,"y":363,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":2},{"id":45,"name":"Emperor Taizong gives an audience to the ambassador of Tibet","description":"assets/data/images/800px-Emperor_Taizong.jpg","editDateTime":"2013-10-10 21:46:18","resourceCategoryId":2,"dynastyId":11,"x":499,"y":466,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":2},{"id":191,"name":"Tang Dynasty makeup","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-08 22:49:09","resourceCategoryId":2,"dynastyId":11,"x":275,"y":224,"resourceTypeId":3,"iconName":"icon_society","dynastyPeriod":1}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[{"id":28,"name":"Seaports and maritime trade","description":"Chinese envoys had been sailing through the Indian Ocean to India since perhaps the 2nd century BC,  yet it was during the Tang Dynasty that a strong Chinese maritime presence could be found in the Persian Gulf and Red Sea, into Persia, Mesopotamia (sailing up the Euphrates River in modern-day Iraq), Arabia, Egypt, Aksum (Ethiopia), and Somalia in the Horn of Africa. From the same Quraysh tribe of Muhammad, Sa'd ibn Abi-Waqqas sailed from Ethiopia to China during the reign of Emperor Gaozu. He later traveled back to China with a copy of the Quran, establishing China's first mosque, the Mosque of Remembrance, during the reign of Emperor Gaozong. To this day he is still buried in a Muslim cemetery at Guangzhou.","editDateTime":"2013-10-10 20:45:17","resourceCategoryId":3,"dynastyId":11,"x":504,"y":487,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":3},{"id":29,"name":"An Shi Rebellion and catastrophe","description":"he Tang Empire was at its height of power up until the middle of the 8th century, when the An Shi Rebellion (December 16, 755 – February 17, 763) destroyed the prosperity of the empire. An Lushan was a half-Sogdian, half-Turk Tang commander since 744, had experience fighting the Khitans of Manchuria with a victory in 744,[52][150] yet most of his campaigns against the Khitans were unsuccessful.[151] He was given great responsibility in Hebei, which allowed him to rebel with an army of more than one hundred thousand troops.[52] After capturing Luoyang, he named himself emperor of a new, but short-lived, Yan state.[150] Despite early victories scored by Tang General Guo Ziyi (697–781), the newly recruited troops of the army at the capital were no match for An Lushan's die-hard frontier veterans, so the court fled Chang'an.[52] While the heir apparent raised troops in Shanxi and Xuanzong fled to Sichuan province, they called upon the help of the Uyghur Turks in 756.[152] The Uyghur khan Moyanchur was greatly excited at this prospect, and married his own daughter to the Chinese diplomatic envoy once he arrived, receiving in turn a Chinese princess as his bride.[152] The Uyghurs helped recapture the Tang capital from the rebels, but they refused to leave until the Tang paid them an enormous sum of tribute in silk.[52][152] Even Abbasid Arabs assisted the Tang in putting down An Lushan's rebellion.[152][153] The Tibetans took hold of the opportunity and raided many areas under Chinese control, and even after the Tibetan Empire had fallen apart in 842 (and the Uyghurs soon after) the Tang were in no position to reconquer Central Asia after 763.[52][154] So significant was this loss that half a century later jinshi examination candidates were required to write an essay on the causes of the Tang's decline.[155] Although An Lushan was killed by one of his eunuchs in 757,[152] this time of troubles and widespread insurrection continued until rebel Shi Siming was killed by his own son in 763.","editDateTime":"2013-10-10 20:47:36","resourceCategoryId":3,"dynastyId":11,"x":538,"y":431,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":3},{"id":31,"name":"Chang'an, the Tang capital","description":"Although Chang'an was the capital of the earlier Han and Jin dynasties, after subsequent destruction in warfare, it was the Sui Dynasty model that comprised the Tang era capital. The roughly square dimensions of the city had six miles (10 km) of outer walls running east to west, and more than five miles (8 km) of outer walls running north to south.[16] The royal palace, the Taiji Palace, stood north of the city's central axis.[181] From the large Mingde Gates located mid-center of the main southern wall, a wide city avenue stretched from there all the way north to the central administrative city, behind which was the Chentian Gate of the royal palace, or Imperial City. Intersecting this were fourteen main streets running east to west, while eleven main streets ran north to south. These main intersecting roads formed 108 rectangular wards with walls and four gates each, and each ward filled with multiple city blocks. The city was made famous for this checkerboard pattern of main roads with walled and gated districts, its layout even mentioned in one of Du Fu's poems.[182] During the Heian period, the city of Heian kyō (present-day Kyoto) of Japan like many cities was arranged in the checkerboard street grid pattern of the Tang capital and in accordance with traditional geomancy following the model of Chang'an.[29] Of these 108 wards in Chang'an, two of them (each the size of two regular city wards) were designated as government-supervised markets, and other space reserved for temples, gardens, ponds, etc.[16] Throughout the entire city, there were 111 Buddhist monasteries, 41 Daoist abbeys, 38 family shrines, 2 official temples, 7 churches of foreign religions, 10 city wards with provincial transmission offices, 12 major inns, and 6 graveyards.[183] Some city wards were literally filled with open public playing fields or the backyards of lavish mansions for playing horse polo and cuju football.[184] In 662, Emperor Gaozong moved the imperial court to the Daming Palace, which became the political center of the empire and served as the royal residence of the Tang emperors for more than 220 years.","editDateTime":"2013-10-10 20:51:25","resourceCategoryId":3,"dynastyId":11,"x":487,"y":412,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":3},{"id":32,"name":"Literature","description":"The Tang period was a golden age of Chinese literature and art. There are over 48,900 poems penned by some 2,200 Tang authors that have survived until modern times.[194][195] Skill in the composition of poetry became a required study for those wishing to pass imperial examinations,[196] while poetry was also heavily competitive; poetry contests amongst guests at banquets and courtiers were common.[197] Poetry styles that were popular in the Tang included gushi and jintishi, with the renowned poet Li Bai (701–762) famous for the former style, and poets like Wang Wei (701–761) and Cui Hao (704–754) famous for their use of the latter. Jintishi poetry, or regulated verse, is in the form of eight-line stanzas or seven characters per line with a fixed pattern of tones that required the second and third couplets to be antithetical (although the antithesis is often lost in translation to other languages).[198] Tang poems remained popular and great emulation of Tang era poetry began in the Song Dynasty; in that period, Yan Yu (嚴羽; active 1194–1245) was the first to confer the poetry of the High Tang (c. 713–766) era with \"canonical status within the classical poetic tradition.\" Yan Yu reserved the position of highest esteem among all Tang poets for Du Fu (712–770), who was not viewed as such in his own era, and was branded by his peers as an anti-traditional rebel.","editDateTime":"2013-10-10 20:52:12","resourceCategoryId":3,"dynastyId":11,"x":559,"y":360,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":3},{"id":33,"name":"Religion and philosophy","description":"Since ancient times, the Chinese believed in a folk religion that incorporated many deities. The Chinese believed that the afterlife was a reality parallel to the living world, complete with its own bureaucracy and afterlife currency needed by dead ancestors.[211] Funerary practices included providing the deceased with everything they might need in the afterlife, including animals, servants, entertainers, hunters, homes, and officials. This ideal is reflected in Tang dynasty art.[111] This is also reflected in many short stories written in the Tang about people accidentally winding up in the realm of the dead, only to come back and report their experiences.","editDateTime":"2013-10-10 20:52:54","resourceCategoryId":3,"dynastyId":11,"x":510,"y":305,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":3},{"id":46,"name":"Gilt silver eared cup","description":"assets/data/images/Gilt_silver_eared_cup.jpg","editDateTime":"2013-10-10 21:47:02","resourceCategoryId":3,"dynastyId":11,"x":420,"y":440,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":192,"name":"Dynasty Music and Dance Show","description":"assets/data/videos/Tang_Dynasty_Music_and_Dance_Show_1.webm","editDateTime":"2013-12-08 22:50:18","resourceCategoryId":3,"dynastyId":11,"x":626,"y":183,"resourceTypeId":3,"iconName":"icon_culture","dynastyPeriod":1},{"id":193,"name":"Dynasty Music and Dance Show","description":"assets/data/videos/Tang_Dynasty_Music_and_Dance_Show_2.webm","editDateTime":"2013-12-08 22:51:06","resourceCategoryId":3,"dynastyId":11,"x":645,"y":245,"resourceTypeId":3,"iconName":"icon_culture","dynastyPeriod":1},{"id":194,"name":"Landscape Painting","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-08 22:52:16","resourceCategoryId":3,"dynastyId":11,"x":472,"y":387,"resourceTypeId":3,"iconName":"icon_culture","dynastyPeriod":1}]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[{"id":24,"name":"Protectorates and tributaries","description":"The 7th century and first half of the 8th century is generally considered the zenith era of the Tang Dynasty. Emperor Tang Xuanzong brought the Middle Kingdom to its golden age while the Silk Road thrived, with sway over Indochina in the south, and to the west Tang China was master of the Pamirs (modern-day Tajikistan) and protector of Kashmir bordering Persia. \r\nSome of the kingdoms paying tribute to the Tang Dynasty included Kashmir, Nepal, Khotan, Kucha, Kashgar, Japan, Korea, Champa, and kingdoms located in Amu Darya and Syr Darya valley.  Turkic nomads addressed the Emperor of Tang China as Tian Kehan.  After the widespread Göktürk revolt of Shabolüe Khan (d. 658) was put down at Issyk Kul in 657 by Su Dingfang (591–667), Emperor Gaozong established several protectorates governed by a Protectorate General or Grand Protectorate General, which extended the Chinese sphere of influence as far as Herat in Western Afghanistan. Protectorate Generals were given a great deal of autonomy to handle local crises without waiting for central admission. After Xuanzong's reign, military governors (jiedushi) were given enormous power, including the ability to maintain their own armies, collect taxes, and pass their titles on hereditarily. This is commonly recognized as the beginning of the fall of Tang's central government.","editDateTime":"2013-10-10 20:41:15","resourceCategoryId":4,"dynastyId":11,"x":549,"y":321,"resourceTypeId":1,"iconName":"icon_military","dynastyPeriod":0},{"id":25,"name":"Soldiers and conscription","description":"By the year 737, Emperor Xuanzong discarded the policy of conscripting soldiers that were replaced every three years, replacing them with long-service soldiers who were more battle-hardened and efficient.[54] It was more economically feasible as well, since training new recruits and sending them out to the frontier every three years drained the treasury.[54] By the late 7th century, the fubing troops began abandoning military service and the homes provided to them in the equal-field system. The supposed standard of 100 mu of land allotted to each family was in fact decreasing in size in places where population expanded and the wealthy bought up most of the land.[55] Hard-pressed peasants and vagrants were then induced into military service with benefits of exemption from both taxation and corvée labor service, as well as provisions for farmland and dwellings for dependents who accompanied soldiers on the frontier.[56] By the year 742 the total number of enlisted troops in the Tang armies had risen to about 500,000 men.","editDateTime":"2013-10-10 20:42:05","resourceCategoryId":4,"dynastyId":11,"x":527,"y":447,"resourceTypeId":1,"iconName":"icon_military","dynastyPeriod":1},{"id":195,"name":"Tang Dynasty Armor","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-08 22:53:27","resourceCategoryId":4,"dynastyId":11,"x":230,"y":209,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":0}]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[{"id":34,"name":"Engineering","description":"Technology during the Tang period was built also upon the precedents of the past. Advancements in clockworks and timekeeping included the mechanical gear systems of Zhang Heng (78–139) and Ma Jun (fl. 3rd century) gave the Tang engineer, astronomer, and monk Yi Xing (683–727) inspiration when he invented the world's first clockwork escapement mechanism in 725.[249] This was used alongside a clepsydra clock and waterwheel to power a rotating armillary sphere in representation of astronomical observation.[250] Yi Xing's device also had a mechanically timed bell that was struck automatically every hour, and a drum that was struck automatically every quarter hour; essentially, a striking clock.[251] Yi Xing's astronomical clock and water-powered armillary sphere became well known throughout the country, since students attempting to pass the imperial examinations by 730 had to write an essay on the device as an exam requirement.[252] However, the most common type of public and palace timekeeping device was the inflow clepsydra. Its design was improved c. 610 by the Sui-dynasty engineers Geng Xun and Yuwen Kai. They provided a steelyard balance that allowed seasonal adjustment in the pressure head of the compensating tank and could then control the rate of flow for different lengths of day and night.","editDateTime":"2013-10-10 20:53:48","resourceCategoryId":5,"dynastyId":11,"x":614,"y":207,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":3},{"id":35,"name":"Woodblock printing","description":"Woodblock printing made the written word available to vastly greater audiences. One of the world's oldest surviving printed documents is a miniature Buddhist dharani sutra unearthed at Xi'an in 1974 and dated roughly from 650 to 670.[260] The Diamond Sutra is the first full-length book printed at regular size, complete with illustrations embedded with the text and dated precisely to 868.[261][262] Among the earliest documents to be printed were Buddhist texts as well as calendars, the latter essential for calculating and marking which days were auspicious and which days were not.[263] With so many books coming into circulation for the general public, literacy rates could improve, along with the lower classes being able to obtain cheaper sources of study. Therefore, there were more lower-class people seen entering the Imperial Examinations and passing them by the later Song Dynasty.[33][264][265] Although the later Bi Sheng's movable type printing in the 11th century was innovative for his period, woodblock printing that became widespread in the Tang would remain the dominant printing type in China until the more advanced printing press from Europe became widely accepted and used in East Asia.[266] The first use of the playing card during the Tang Dynasty was an auxiliary invention of the new age of printing.","editDateTime":"2013-10-10 20:54:30","resourceCategoryId":5,"dynastyId":11,"x":602,"y":153,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":3},{"id":36,"name":"Medicine","description":"The Chinese of the Tang era were also very interested in the benefits of officially classifying all of the medicines used in pharmacology. In 657, Emperor Gaozong of Tang (r. 649–683) commissioned the literary project of publishing an official materia medica, complete with text and illustrated drawings for 833 different medicinal substances taken from different stones, minerals, metals, plants, herbs, animals, vegetables, fruits, and cereal crops.[268] In addition to compiling pharmacopeias, the Tang fostered learning in medicine by upholding imperial medical colleges, state examinations for doctors, and publishing forensic manuals for physicians.[245] Authors of medicine in the Tang include Zhen Chuan (d. 643) and Sun Simiao (581–682), the former who first identified in writing that patients with diabetes had an excess of sugar in their urine, and the latter who was the first to recognize that diabetic patients should avoid consuming alcohol and starchy foods.[269] As written by Zhen Chuan and others in the Tang, the thyroid glands of sheep and pigs were successfully used to treat goiters; thyroid extracts were not used to treat patients with goiter in the West until 1890.[270] The use of the dental amalgam, manufactured from tin and silver, was first introduced in the medical text Hsin Hsiu Pen Tsao written by Su Kung in 659.","editDateTime":"2013-10-10 20:55:18","resourceCategoryId":5,"dynastyId":11,"x":638,"y":177,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":2},{"id":38,"name":"Historiography","description":"The first classic work about the Tang is the Book of Tang by Liu Xu (887–946 AD) et al. of the Later Jin, who redacted it during the last years of his life. This was edited into another history (labelled the New Book of Tang) in order to distinguish it, which was a work by the Song historians Ouyang Xiu (1007–1072), Song Qi (998–1061), et al. of the Song Dynasty (between the years 1044 and 1060). Both of them were based upon earlier annals, yet those are now lost.[284] Both of them also rank among the Twenty-Four Histories of China. One of the surviving sources of the Book of Tang, primarily covering up to 756, is the Tongdian, which Du You presented to the emperor in 801. The Tang period was again placed into the enormous universal history text of the Zizhi Tongjian, edited, compiled, and completed in 1084 by a team of scholars under the Song Dynasty Chancellor Sima Guang (1019–1086). This historical text, written with 3 million Chinese characters in 294 volumes, covered the history of China from the beginning of the Warring States (403 BC) until the beginning of the Song Dynasty (960)","editDateTime":"2013-10-10 20:59:09","resourceCategoryId":5,"dynastyId":11,"x":555,"y":394,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":2},{"id":37,"name":"Cartography","description":"In the realm of cartography, there were further advances beyond the map-makers of the Han Dynasty. When the Tang chancellor Pei Ju (547–627) was working for the Sui Dynasty as a Commercial Commissioner in 605, he created a well-known gridded map with a graduated scale in the tradition of Pei Xiu (224–271).[273] The Tang chancellor Xu Jingzong (592–672) was also known for his map of China drawn in the year 658.[274] In the year 785 the Emperor Dezong had the geographer and cartographer Jia Dan (730–805) complete a map of China and her former colonies in Central Asia.[274] Upon its completion in 801, the map was 9.1 m (30 ft) in length and 10 m (33 ft) in height, mapped out on a grid scale of one inch equaling one hundred li (Chinese unit of measuring distance).[274] A Chinese map of 1137 is similar in complexity to the one made by Jia Dan, carved on a stone stele with a grid scale of 100 li.[275] However, the only type of map that has survived from the Tang period are star charts. Despite this, the earliest extant terrain maps of China come from the ancient State of Qin; maps from the 4th century BC that were excavated in 1986.","editDateTime":"2013-10-10 20:56:14","resourceCategoryId":5,"dynastyId":11,"x":566,"y":461,"resourceTypeId":2,"iconName":"icon_technology","dynastyPeriod":2}]},{"id":6,"name":"introduction","chinese":"介绍","resources":[{"id":18,"name":"Introduction","description":"The Tang Dynasty (618 – 907 AD) was an imperial dynasty of China preceded by the Sui Dynasty and followed by the Five Dynasties and Ten Kingdoms period. It was founded by the Li family, who seized power during the decline and collapse of the Sui Empire. The dynasty was interrupted briefly by the Second Zhou Dynasty (October 8, 690 – March 3, 705) when Empress Wu Zetian seized the throne, becoming the only Chinese empress regnant to rule in her own right.","editDateTime":"2013-10-10 20:32:02","resourceCategoryId":6,"dynastyId":11,"x":0,"y":0,"resourceTypeId":1,"dynastyPeriod":-1}]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":3,"period":0,"dynastyId":11,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":120,"scale":100,"mapZ":1.5},{"id":22,"period":1,"dynastyId":11,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5},{"id":23,"period":2,"dynastyId":11,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5},{"id":24,"period":3,"dynastyId":11,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"tang_0","audio":"assets/data/audios/tang_0.mp3","text":"Tang Dynasty was the most glistening historic period in China's history","state":1},{"id":1,"audioId":"tang_1","audio":"assets/data/audios/tang_1.mp3","text":"Founded in 618 and ending in 907","state":1},{"id":2,"audioId":"tang_2","audio":"assets/data/audios/tang_2.mp3","text":" the state","state":1},{"id":3,"audioId":"tang_3","audio":"assets/data/audios/tang_3.mp3","text":" under the ruling of the Tang Emperors","state":1},{"id":4,"audioId":"tang_4","audio":"assets/data/audios/tang_4.mp3","text":" became the most powerful and prosperous country in the world","state":1},{"id":5,"audioId":"tang_5","audio":"assets/data/audios/tang_5.mp3","text":"Particularly","state":1},{"id":6,"audioId":"tang_6","audio":"assets/data/audios/tang_6.mp3","text":" in this glorious period","state":1},{"id":7,"audioId":"tang_7","audio":"assets/data/audios/tang_7.mp3","text":" the economy","state":1},{"id":8,"audioId":"tang_8","audio":"assets/data/audios/tang_8.mp3","text":" politics","state":1},{"id":9,"audioId":"tang_9","audio":"assets/data/audios/tang_9.mp3","text":" culture and military strength reached an unparalleled advanced level.","state":1}]},{"id":12,"name":"song","introduction":"Song Dynasty consisted of the Northern Song (960-1127) and the Southern Song (1127-1279), with a prosperous economy and radiant culture, this period was considered as another period of 'golden age', after the glorious Tang Dynasty (618 - 907).","startYear":960,"endYear":1276,"chinese":0,"enable":1,"totalPeriod":3,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":216,"name":"Northern Song, 960–1127","description":"Emperor Taizu of Song (r. 960–976) unified China by conquering other lands during his reign, ending the upheaval of the Five Dynasties and Ten Kingdoms period. In Kaifeng, he established a strong central government over the empire. He ensured administrative stability by promoting the civil service examination system of drafting state bureaucrats by skill and merit (instead of aristocratic or military position) and promoted projects that ensured efficiency in communication throughout the empire. In one such project, cartographers created detailed maps of each province and city that were then collected in a large atlas. Emperor Taizu also promoted groundbreaking science and technological innovations by supporting such works as the astronomical clock tower designed and built by the engineer Zhang Sixun","editDateTime":"2013-12-08 23:54:28","resourceCategoryId":1,"dynastyId":12,"x":495,"y":415,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":2},{"id":217,"name":"Southern Song, 1127–1279","description":"Although weakened and pushed south along the Huai River, the Southern Song found new ways to bolster its strong economy and defend its own state against the Jin Dynasty. They had able military officers such as Yue Fei and Han Shizhong. The government sponsored massive shipbuilding and harbor improvement projects, and the construction of beacons and seaport warehouses in order to support maritime trade abroad and the major international seaports, such as Quanzhou, Guangzhou, and Xiamen, that were sustaining China's commerce. To protect and support the multitudes of ships sailing for maritime interests into the waters of the East China Sea and Yellow Sea (to Korea and Japan), Southeast Asia, the Indian Ocean, and the Red Sea, it was a necessity to establish an official standing navy. The Song Dynasty therefore established China's first permanent navy in 1132, with a headquarters at Dinghai. With a permanent navy, the Song were prepared to face the naval forces of the Jin on the Yangtze River in 1161, in the Battle of Tangdao and the Battle of Caishi. During these battles the Song navy employed swift paddle wheel driven naval vessels armed with trebuchet catapults aboard the decks that launched gunpowder bombs. Although the Jin forces boasted 70,000 men on 600 warships, and the Song forces only 3,000 men on 120 warships, the Song Dynasty forces were victorious in both battles due to the destructive power of the bombs and the rapid assaults by paddle wheel ships. The strength of the navy was heavily emphasized after that. A century after the navy was founded it had grown in size to 52,000 fighting marines. The Song government confiscated portions of land owned by the landed gentry in order to raise revenue for these projects, an act which caused dissension and loss of loyalty amongst leading members of Song society but did not stop the Song's defensive preparations. Financial matters were made worse by the fact that many wealthy, land-owning families—some which had officials working for the government—used their social connections with those in office in order to obtain tax-exempt status.","editDateTime":"2013-12-08 23:54:53","resourceCategoryId":1,"dynastyId":12,"x":470,"y":391,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":2},{"id":223,"name":"Economy, industry, and trade","description":"The economy of the Song Dynasty was one of the most prosperous and advanced economies in the medieval world. Song Chinese invested their funds in joint stock companies and in multiple sailing vessels at a time when monetary gain was assured from the vigorous overseas trade and domestic trade along the Grand Canal and Yangzi River.[126] Prominent merchant families and private businesses were allowed to occupy industries that were not already government-operated monopolies.[22][127] Both private and government-controlled industries met the needs of a growing Chinese population in the Song.[22][127] Both artisans and merchants formed guilds which the state had to deal with when assessing taxes, requisitioning goods, and setting standard worker's wages and prices on goods.","editDateTime":"2013-12-09 00:03:33","resourceCategoryId":1,"dynastyId":12,"x":586,"y":424,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":2},{"id":215,"name":"Song Taizu","description":"assets/data/images/song_1_Song_Taizu.jpg","editDateTime":"2013-12-08 23:51:27","resourceCategoryId":1,"dynastyId":12,"x":471,"y":357,"resourceTypeId":2,"iconName":"icon_history","dynastyPeriod":1},{"id":225,"name":"The Song Dynasty","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-09 00:10:09","resourceCategoryId":1,"dynastyId":12,"x":507,"y":462,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":2}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":218,"name":"Society","description":"The Song Dynasty (or Sung Dynasty) was an era of administrative sophistication and complex social organization. Some of the largest cities in the world were found in China during this period (Kaifeng and Hangzhou had populations of over a million). People enjoyed various social clubs and entertainment in the cities, and there were many schools and temples to provide the people with education and religious services. The Song government supported multiple forms of social welfare programs, including the establishment of retirement homes, public clinics, and pauper's graveyards. The Song Dynasty supported a widespread postal service that was modeled on the earlier Han Dynasty (202 BC – AD 220) postal system to provide swift communication throughout the empire. The central government employed thousands of postal workers of various ranks and responsibilities to provide service for post offices and larger postal stations. In rural areas, farming peasants either owned their own plots of land, paid rents as tenant farmers, or were serfs on large estates.","editDateTime":"2013-12-08 23:56:44","resourceCategoryId":2,"dynastyId":12,"x":466,"y":362,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":0},{"id":219,"name":"Religion","description":"Religion in China during this period had a great effect on people's lives, beliefs, and daily activities, and Chinese literature on spirituality was popular. The major deities of Daoism and Buddhism, ancestral spirits, and the many deities of Chinese folk religion were worshiped with sacrificial offerings. Tansen Sen asserts that more Buddhist monks from India traveled to China during the Song than in the previous Tang Dynasty (618–907). With many ethnic foreigners traveling to China to conduct trade or live permanently, there came many foreign religions; religious minorities in China included Middle Eastern Muslims, the Kaifeng Jews, and Persian Manichaeans.","editDateTime":"2013-12-08 23:59:16","resourceCategoryId":2,"dynastyId":12,"x":571,"y":358,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":0},{"id":224,"name":"Living Art","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-09 00:09:15","resourceCategoryId":2,"dynastyId":12,"x":552,"y":474,"resourceTypeId":3,"iconName":"icon_society","dynastyPeriod":2}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[{"id":222,"name":"Arts, literature, and philosophy","description":"The visual arts during the Song Dynasty were heightened by new developments such as advances in landscape and portrait painting. The gentry elite engaged in the arts as accepted pastimes of the cultured scholar-official, including painting, composing poetry, and writing calligraphy.[110] The poet and statesman Su Shi and his associate Mi Fu (1051–1107) enjoyed antiquarian affairs, often borrowing or buying art pieces to study and copy.[21] Poetry and literature profited from the rising popularity and development of the ci poetry form. Enormous encyclopedic volumes were compiled, such as works of historiography and dozens of treatises on technical subjects. This included the universal history text of the Zizhi Tongjian, compiled into 1000 volumes of 9.4 million written Chinese characters. The genre of Chinese travel literature also became popular with the writings of the geographer Fan Chengda (1126–1193) and Su Shi, the latter of whom wrote the 'daytrip essay' known as Record of Stone Bell Mountain that used persuasive writing to argue for a philosophical point.[111] Although an early form of the local geographic gazetteer existed in China since the 1st century, the matured form known as \"treatise on a place\", or fangzhi, replaced the old \"map guide\", or tujing, during the Song Dynasty.","editDateTime":"2013-12-09 00:02:58","resourceCategoryId":3,"dynastyId":12,"x":534,"y":344,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":1},{"id":196,"name":"Finches and Bamboo","description":"assets/data/images/song_0_Finches_and_Bamboo.jpg","editDateTime":"2013-12-08 23:18:24","resourceCategoryId":3,"dynastyId":12,"x":533,"y":410,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":197,"name":"Tea bowl","description":"assets/data/images/song_Tea_bowl.jpg","editDateTime":"2013-12-08 23:20:05","resourceCategoryId":3,"dynastyId":12,"x":579,"y":424,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":198,"name":"Palace Banquet","description":"assets/data/images/song_0_Palace_Banquet.jpg","editDateTime":"2013-12-08 23:21:51","resourceCategoryId":3,"dynastyId":12,"x":481,"y":456,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":199,"name":"Old Trees Level Distance","description":"assets/data/images/song_0_Old_Trees_Level_Distance.jpg","editDateTime":"2013-12-08 23:22:56","resourceCategoryId":3,"dynastyId":12,"x":531,"y":472,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":200,"name":"Portrait of Bi Shichang","description":"assets/data/images/song_0_Portrait_of_Bi_Shichang.jpg","editDateTime":"2013-12-08 23:25:00","resourceCategoryId":3,"dynastyId":12,"x":585,"y":452,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":201,"name":"The Classic of Filial Piety","description":"assets/data/images/song_0_The_Classic_of_Filial_Piety.jpg","editDateTime":"2013-12-08 23:26:53","resourceCategoryId":3,"dynastyId":12,"x":548,"y":382,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":202,"name":"Sailing on the Wu River","description":"assets/data/images/song_0_Sailing_on_the_Wu_River.jpg","editDateTime":"2013-12-08 23:28:14","resourceCategoryId":3,"dynastyId":12,"x":539,"y":475,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":203,"name":"Summer Mountains","description":"assets/data/images/song_0_Summer_Mountains.jpg","editDateTime":"2013-12-08 23:29:33","resourceCategoryId":3,"dynastyId":12,"x":570,"y":446,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":204,"name":"Silver service","description":"assets/data/images/song_0_Silver_service.jpg","editDateTime":"2013-12-08 23:30:41","resourceCategoryId":3,"dynastyId":12,"x":575,"y":405,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":205,"name":"Ewer","description":"assets/data/images/song_0_Ewer.jpg","editDateTime":"2013-12-08 23:32:16","resourceCategoryId":3,"dynastyId":12,"x":481,"y":493,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":206,"name":"Pillow","description":"assets/data/images/song_0_Pillow.jpg","editDateTime":"2013-12-08 23:33:25","resourceCategoryId":3,"dynastyId":12,"x":521,"y":446,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":207,"name":"Viewing Plum Blossoms","description":"assets/data/images/song_1_Old_Trees_Level_Distance.jpg","editDateTime":"2013-12-08 23:39:24","resourceCategoryId":3,"dynastyId":12,"x":555,"y":444,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":208,"name":"Quatrain on Spring's Radiance","description":"assets/data/images/song_1_Quatrain_on_Springs_Radiance.jpg","editDateTime":"2013-12-08 23:40:31","resourceCategoryId":3,"dynastyId":12,"x":472,"y":482,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":209,"name":"Scholar by a Waterfall","description":"assets/data/images/song_1_Quatrain_on_Springs_Radiance.jpg","editDateTime":"2013-12-08 23:41:54","resourceCategoryId":3,"dynastyId":12,"x":516,"y":490,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":210,"name":"Orchids","description":"assets/data/images/song_1_Orchids.jpg","editDateTime":"2013-12-08 23:43:12","resourceCategoryId":3,"dynastyId":12,"x":467,"y":441,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":211,"name":"Narcissus","description":"assets/data/images/song_1_Narcissus.jpg","editDateTime":"2013-12-08 23:44:17","resourceCategoryId":3,"dynastyId":12,"x":497,"y":461,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":212,"name":"Poem of Farewell to Liu Man","description":"assets/data/images/song_1_Poem_of_Farewell_to_Liu_Man.jpg","editDateTime":"2013-12-08 23:45:36","resourceCategoryId":3,"dynastyId":12,"x":462,"y":417,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":213,"name":"Mountain Market in Clearing Mist","description":"assets/data/images/song_1_Mountain_Market_in_Clearing_Mist.jpg","editDateTime":"2013-12-08 23:48:04","resourceCategoryId":3,"dynastyId":12,"x":529,"y":340,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":214,"name":"Vase","description":"assets/data/images/song_1_Vase.jpg","editDateTime":"2013-12-08 23:49:06","resourceCategoryId":3,"dynastyId":12,"x":495,"y":365,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1}]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[{"id":221,"name":"Military and methods of warfare","description":"The Song military was chiefly organized to ensure that the army could not threaten Imperial control, often at the expense of effectiveness in war. Northern Song's Military Council operated under a Chancellor, who had no control over the imperial army. The imperial army was divided among three marshals, each independently responsible to the Emperor. Since the Emperor rarely led campaigns personally, Song forces lacked unity of command. The imperial court often believed that successful generals endangered royal authority, and relieved or even executed them (notably Li Gang, Yue Fei, and Han Shizhong).\r\nAlthough the scholar-officials viewed military soldiers as lower members in the hierarchic social order, a person could gain status and prestige in society by becoming a high-ranking military officer with a record of victorious battles. At its height, the Song military had one million soldiers divided into platoons of 50 troops, companies made of two platoons, and one battalion composed of 500 soldiers. Crossbowmen were separated from the regular infantry and placed in their own units as they were prized combatants, providing effective missile fire against cavalry charges. The government was eager to sponsor new crossbow designs that could shoot at longer ranges, while crossbowmen were also valuable when employed as long-range snipers. Song cavalry employed a slew of different weapons, including halberds, swords, bows, spears, and 'fire lances' that discharged a gunpowder blast of flame and shrapnel.","editDateTime":"2013-12-09 00:02:18","resourceCategoryId":4,"dynastyId":12,"x":533,"y":416,"resourceTypeId":1,"iconName":"icon_military","dynastyPeriod":2},{"id":226,"name":"Song Dynasty war","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-09 00:10:41","resourceCategoryId":4,"dynastyId":12,"x":552,"y":380,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":1},{"id":227,"name":"Song Armor","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-09 00:11:20","resourceCategoryId":4,"dynastyId":12,"x":519,"y":414,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":1}]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[{"id":220,"name":"Law, justice, and forensic science","description":"The Song judicial system retained most of the legal code of the earlier Tang Dynasty, the basis of traditional Chinese law up until the modern era. Roving sheriffs maintained law and order in the municipal jurisdictions and occasionally ventured into the countryside. Official magistrates overseeing court cases were not only expected to be well-versed in written law but also to promote morality in society. Magistrates such as the famed Bao Qingtian (999–1062) embodied the upright, moral judge who upheld justice and never failed to live up to his principles. Song judges specified the guilty person or party in a criminal act and meted out punishments accordingly, often in the form of caning. A guilty individual or parties brought to court for a criminal or civil offense were not viewed as wholly innocent until proven otherwise, while even accusers were viewed with a high level of suspicion by the judge. Due to costly court expenses and immediate jailing of those accused of criminal offenses, people in the Song preferred to settle disputes and quarrels privately, without the court's interference.","editDateTime":"2013-12-09 00:00:55","resourceCategoryId":5,"dynastyId":12,"x":480,"y":393,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":0}]},{"id":6,"name":"introduction","chinese":"介绍","resources":[]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":25,"period":0,"dynastyId":12,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5},{"id":26,"period":1,"dynastyId":12,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5},{"id":27,"period":2,"dynastyId":12,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"song_0","audio":"assets/data/audios/song_0.mp3","text":"Song Dynasty consisted of the Northern Song (960-1127) and the Southern Song (1127-1279)","state":1},{"id":1,"audioId":"song_1","audio":"assets/data/audios/song_1.mp3","text":" with a prosperous economy and radiant culture","state":1},{"id":2,"audioId":"song_2","audio":"assets/data/audios/song_2.mp3","text":" this period was considered as another period of 'golden age'","state":1},{"id":3,"audioId":"song_3","audio":"assets/data/audios/song_3.mp3","text":" after the glorious Tang Dynasty (618 - 907).","state":1}]},{"id":13,"name":"yuan","introduction":"Since the late period of the 12th century, an ethnic minority group called Mongolian had grown up in the northern areas of China. In 1204, one of the leaders of the Mongolian tribes, Tiemuzhen, unified all the internal tribes. Two years later, Tiemuzhen was honored as Genghis Khan (meaning - the ruler of the world), and soon established the Mongolian Empire. Successively, it captured Xixia and the Jin Dynasty (1115 - 1234), after which the combative Mongolian army sent its military forces into Central Asia and Europe.","startYear":1271,"endYear":1368,"chinese":0,"enable":1,"totalPeriod":3,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":229,"name":"Yuan art","description":"Lacking experience in the administration of a complex empire, the Mongols gradually adopted Chinese political and cultural models. Ruling from their capital in Dadu (also known as Khanbalik; now Beijing), the Mongol Khans increasingly assumed the role of Chinese emperors. During the 1340s and 1350s, however, internal political cohesion disintegrated as growing factionalism at court, rampant corruption, and a succession of natural calamities led to rebellion and, finally, dynastic collapse.","editDateTime":"2013-12-09 21:25:05","resourceCategoryId":1,"dynastyId":13,"x":418,"y":158,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":249,"name":"Impact","description":"A rich cultural diversity developed during the Yuan Dynasty. The major cultural achievements were the development of drama and the novel and the increased use of the written vernacular. The political unity of China and much of central Asia promoted trade between East and West. The Mongols' extensive West Asian and European contacts produced a fair amount of cultural exchange. The other cultures and peoples in the Mongol World Empire also very much influenced China. It had significantly eased trade and commerce across Asia until its decline; the communications between Yuan Dynasty and its ally and subordinate in Persia, the Ilkhanate, encouraged this development. Buddhism had a great influence in the Yuan government, and the Tibetan-rite Tantric Buddhism had significantly influenced China during this period. The Muslims of the Yuan Dynasty introduced Middle Eastern cartography, astronomy, medicine, clothing, and diet in East Asia. Eastern crops such as carrots, turnips, new varieties of lemons, eggplants, and melons, high-quality granulated sugar, and cotton were all either introduced or successfully popularized during the Yuan Dynasty.","editDateTime":"2013-12-09 23:05:19","resourceCategoryId":1,"dynastyId":13,"x":493,"y":318,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":250,"name":"Impact continue","description":"The first recorded travels by Europeans to China and back date from this time. The most famous traveler of the period was the Venetian Marco Polo, whose account of his trip to \"Cambaluc,\" the capital of the Great Khan, and of life there astounded the people of Europe. The account of his travels, Il milione (or, The Million, known in English as the Travels of Marco Polo), appeared about the year 1299. Some argue the accuracy of Marco Polo's accounts due to the lack of mentioning the Great Wall of China, tea houses, which would have been a prominent sight since Europeans had yet to adopt a tea culture, as well the practice of foot binding by the women in capital of the Great Khan. Some suggest that Marco Polo acquired much of his knowledge through contact with Persian traders since many of the places he named were in Persian.","editDateTime":"2013-12-09 23:05:54","resourceCategoryId":1,"dynastyId":13,"x":353,"y":312,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":251,"name":"Government","description":"The structure of the Yuan government took shape during the reign of Kublai Khan (1260–1294). While some changes took place such as the functions of certain institutions, the essential components of the government bureaucracy remained intact from the beginning to the end of the dynasty in 1368.","editDateTime":"2013-12-09 23:06:14","resourceCategoryId":1,"dynastyId":13,"x":435,"y":318,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":252,"name":"Imperial lifestyle","description":"Since its invention in 1269, the 'Phags-pa script, a unified script for spelling Mongolian' Tibetan, and Chinese languages, was preserved in the court until the end of the Dynasty. Most of the Emperors could not master written Chinese, but they could generally converse well in the language. The Mongol custom of long standing quda/marriage alliance with Mongol clans, the Onggirat and the Ikeres, kept the imperial blood purely Mongol until the reign of Tugh Temur whose mother was a Tangut concubine. The Mongol Emperors had built large palaces and pavilions, but some still continued to live as nomads at times. Nevertheless, a few other Yuan emperors actively sponsored cultural activities; an example is Tugh Temur (Emperor Wenzong), who wrote poetry, painted, read Chinese classical texts, and ordered compilation of books.","editDateTime":"2013-12-09 23:06:55","resourceCategoryId":1,"dynastyId":13,"x":387,"y":355,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":253,"name":"Culture","description":"n the China of the Yuan, or Mongol era, various important developments in the arts occurred or continued in their development. These developments included the areas of painting, mathematics, calligraphy, poetry, and theater, with many great artists and writers being famous today. Due to the coming together of painting, poetry, and calligraphy at this time many of the artists practicing these different pursuits were the same individuals, though perhaps more famed for one area of their achievements than others. Often in terms of the further development of landscape painting as well as the classical joining together of the arts of painting, poetry, and calligraphy, the Song Dynasty and the Yuan Dynasty are linked together. In the area of Chinese painting during the Yuan Dynasty there were many famous painters. In the area of calligraphy many of the great calligraphers were from the Yuan Dynasty era. In Yuan poetry, the main development was the qu, which was used among other poetic forms by most of the famous Yuan poets. Many of the poets were also involved in the major developments in the theater during this time, and the other way around, with people important in the theater becoming famous through the development of the sanqu type of qu. One of the key factors in the mix of the zaju variety show was the incorporation of poetry both classical and of the newer qu form. ","editDateTime":"2013-12-09 23:07:15","resourceCategoryId":1,"dynastyId":13,"x":496,"y":265,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":2},{"id":254,"name":"Social classes","description":"Politically, the system of government created by Kublai Khan was the product of a compromise between Mongolian patrimonial feudalism and the traditional Chinese autocratic-bureaucratic system. Nevertheless, socially the educated Chinese elite were in general not given the degree of esteem that they had been accorded previously under native Chinese dynasties. Although the traditional Chinese elite were not given their share of power, the Mongols and the Semuren (various allied groups from Central Asia and the western end of the empire) largely remained strangers to the mainstream Chinese culture, and this dichotomy gave the Yuan regime a somewhat strong \"colonial\" coloration. The unequal treatment is possibly due to the fear of transferring power to the ethnic Chinese under their rule. The Mongols and Semuren were given certain advantages in the dynasty, and this would last even after the restoration of the imperial examination in the early 14th century. In general there were very few North Chinese or Southerners reaching the highest-post in the government compared with the possibility that Persians did so in the Ilkhanate. Later the Yongle Emperor of the Ming Dynasty had also mentioned about the discrimination existed during the Yuan Dynasty.","editDateTime":"2013-12-09 23:11:30","resourceCategoryId":1,"dynastyId":13,"x":580,"y":260,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":2},{"id":255,"name":"Administrative divisions","description":"The territory of the Yuan Dynasty was divided into the Central Region and places under control of various Xing Zhongshusheng or the Xuanzheng Yuan.\r\nThe Central Region, consisting of present-day Hebei, Shandong, Shanxi, the south-eastern part of present-day Inner Mongolia and the Henan areas to the north of the Yellow River, was considered the most important region of the dynasty and directly governed by Zhongshusheng at Khanbaliq; similarly, another top-level administrative department called the Xuanzheng Yuan governed the whole of modern-day Tibet and a part of Kashmir.\r\nXing Zhongshusheng or simply Xingsheng, were provincial-level administrative organizations or institutions, sometimes roughly translated as \"Province\", though they were not exactly provinces in modern sense. There were 11 Xing Zhongshusheng or Xingsheng in Yuan Dynasty.[40]","editDateTime":"2013-12-09 23:12:16","resourceCategoryId":1,"dynastyId":13,"x":525,"y":362,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":230,"name":"belt slide","description":"assets/data/images/yuan_0_Belt_slide.jpg\r\n","editDateTime":"2013-12-09 21:26:54","resourceCategoryId":1,"dynastyId":13,"x":478,"y":137,"resourceTypeId":2,"iconName":"icon_history","dynastyPeriod":0},{"id":258,"name":"Yuan Dynasty 1","description":"assets/data/videos/Yuan_Dynasty_1.webm","editDateTime":"2013-12-09 23:27:33","resourceCategoryId":1,"dynastyId":13,"x":422,"y":349,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":2},{"id":259,"name":"Yuan Dynasty 2","description":"assets/data/videos/Yuan_Dynasty_2.webm","editDateTime":"2013-12-09 23:28:06","resourceCategoryId":1,"dynastyId":13,"x":414,"y":359,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":1},{"id":260,"name":"Mongolian Empire","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-09 23:28:57","resourceCategoryId":1,"dynastyId":13,"x":479,"y":392,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":1}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":235,"name":"Fisherman","description":"assets/data/images/yuan_0_Fisherman.jpg\r\n","editDateTime":"2013-12-09 22:45:28","resourceCategoryId":2,"dynastyId":13,"x":487,"y":203,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":0},{"id":236,"name":"Pavilion","description":"assets/data/images/yuan_1_Pavilion.jpg\r\n","editDateTime":"2013-12-09 22:46:56","resourceCategoryId":2,"dynastyId":13,"x":475,"y":141,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":1},{"id":237,"name":"Tiantai Mountains","description":"assets/data/images/yuan_0_Tiantai_Mountains.jpg\r\n","editDateTime":"2013-12-09 22:47:52","resourceCategoryId":2,"dynastyId":13,"x":437,"y":240,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":0},{"id":238,"name":"Mongol passport","description":"assets/data/images/yuan_0_Mongol_passport.jpg\r\n","editDateTime":"2013-12-09 22:49:05","resourceCategoryId":2,"dynastyId":13,"x":549,"y":170,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":1},{"id":240,"name":"Plate","description":"assets/data/images/yuan_1_Plate.jpg\r\n","editDateTime":"2013-12-09 22:53:59","resourceCategoryId":2,"dynastyId":13,"x":569,"y":238,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":1},{"id":242,"name":"Seven lobed platter with scene of children","description":"assets/data/images/yuan_0_Seated_bodhisattva.jpg\r\n","editDateTime":"2013-12-09 22:55:57","resourceCategoryId":2,"dynastyId":13,"x":339,"y":323,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":1},{"id":243,"name":"The Simple Retreat","description":"assets/data/images/yuan_2_The_Simple_Retreat.jpg\r\n","editDateTime":"2013-12-09 22:56:52","resourceCategoryId":2,"dynastyId":13,"x":399,"y":160,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":2},{"id":244,"name":"Spring Dawn over the Elixir Terrace","description":"assets/data/images/yuan_2_Spring_Dawn_over_the_Elixir_Terrace.jpg\r\n","editDateTime":"2013-12-09 22:58:07","resourceCategoryId":2,"dynastyId":13,"x":470,"y":159,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":2},{"id":246,"name":"Wang Xizhi Watching Geese","description":"assets/data/images/yuan_1_Wang_Xizhi_Watching_Geese.jpg\r\n","editDateTime":"2013-12-09 23:00:02","resourceCategoryId":2,"dynastyId":13,"x":575,"y":174,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":2}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[{"id":248,"name":"Yuan Porcelain","description":"Yesterday’s post concerning the Yuan dynasty was in preparation for today’s post about Yuan dynasty porcelain.  The blue and white cobalt porcelain which has become famously emblematic of Chinese ceramics (to such an extent that “China” became the name of the country and the product in England) was first manufactured in the Middle Kingdom during the Yuan dynasty. The blue and white vases and plates from the Yuan dynasty are more robust and bold then the famous Ming blue and white ware which succeeded them, but the lovely pure aestheticism of great Chinese porcelain is fully there.  The best pieces feature a lovely syncretism of cultural motifs and forms which come together around a central symbol.","editDateTime":"2013-12-09 23:02:36","resourceCategoryId":3,"dynastyId":13,"x":416,"y":311,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":1},{"id":228,"name":"Cup stand","description":"assets/data/images/yuan_0_Cup_stand.jpg\r\n","editDateTime":"2013-12-09 21:22:03","resourceCategoryId":3,"dynastyId":13,"x":382,"y":175,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":231,"name":"Beneficent Rain","description":"assets/data/images/yuan_0_Beneficent_Rain.jpg\r\n","editDateTime":"2013-12-09 21:28:01","resourceCategoryId":3,"dynastyId":13,"x":539,"y":149,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":232,"name":"Guanyin Pusa","description":"assets/data/images/yuan_0_Guanyin_Pusa.jpg\r\n","editDateTime":"2013-12-09 21:29:10","resourceCategoryId":3,"dynastyId":13,"x":591,"y":166,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":233,"name":"Canopy with phoenixes","description":"assets/data/images/yuan_0_Canopy_with_phoenixes.jpg\r\n","editDateTime":"2013-12-09 22:40:48","resourceCategoryId":3,"dynastyId":13,"x":553,"y":197,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":0},{"id":234,"name":"Cosmological Mandala with Mount Meru","description":"assets/data/images/yuan_1_Cosmological_Mandala_with_Mount_Meru.jpg\r\n","editDateTime":"2013-12-09 22:42:51","resourceCategoryId":3,"dynastyId":13,"x":402,"y":180,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":239,"name":"Pair of incense burners","description":"assets/data/images/yuan_1_Pair_of_incense_burners.jpg\r\n","editDateTime":"2013-12-09 22:50:41","resourceCategoryId":3,"dynastyId":13,"x":498,"y":230,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":241,"name":"Seated bodhisattva","description":"assets/data/images/yuan_0_Seated_bodhisattva.jpg\r\n","editDateTime":"2013-12-09 22:54:42","resourceCategoryId":3,"dynastyId":13,"x":625,"y":255,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":245,"name":"Twin Pines Level Distance","description":"assets/data/images/yuan_2_Twin_Pines_Level_Distance.jpg\r\n","editDateTime":"2013-12-09 22:59:05","resourceCategoryId":3,"dynastyId":13,"x":638,"y":141,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":247,"name":"Yamantaka Mandala","description":"assets/data/images/yuan_2_Yamantaka_Mandala.jpg\r\n","editDateTime":"2013-12-09 23:01:02","resourceCategoryId":3,"dynastyId":13,"x":439,"y":211,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":257,"name":"Yuan Dynasty Music","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-09 23:26:57","resourceCategoryId":3,"dynastyId":13,"x":504,"y":381,"resourceTypeId":3,"iconName":"icon_culture","dynastyPeriod":0}]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[{"id":256,"name":"Chinese Armor Song and Yuan Dynasty","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-09 23:26:13","resourceCategoryId":4,"dynastyId":13,"x":514,"y":310,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":2}]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[]},{"id":6,"name":"introduction","chinese":"介绍","resources":[]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":29,"period":0,"dynastyId":13,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":68.3,"mapZ":1.88},{"id":30,"period":1,"dynastyId":13,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":68.3,"mapZ":1.88},{"id":31,"period":2,"dynastyId":13,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":68.3,"mapZ":1.88}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"yuan_0","audio":"assets/data/audios/yuan_0.mp3","text":"Since the late period of the 12th century","state":1},{"id":1,"audioId":"yuan_1","audio":"assets/data/audios/yuan_1.mp3","text":" an ethnic minority group called Mongolian had grown up in the northern areas of China","state":1},{"id":2,"audioId":"yuan_2","audio":"assets/data/audios/yuan_2.mp3","text":"In 1204, one of the leaders of the Mongolian tribes, Tiemuzhen, unified all the internal tribes","state":1},{"id":3,"audioId":"yuan_3","audio":"assets/data/audios/yuan_3.mp3","text":"Two years later","state":1},{"id":4,"audioId":"yuan_4","audio":"assets/data/audios/yuan_4.mp3","text":" Tiemuzhen was honored as Genghis Khan (meaning - the ruler of the world)","state":1},{"id":5,"audioId":"yuan_5","audio":"assets/data/audios/yuan_5.mp3","text":" and soon established the Mongolian Empire","state":1},{"id":6,"audioId":"yuan_6","audio":"assets/data/audios/yuan_6.mp3","text":"Successively","state":1},{"id":7,"audioId":"yuan_7","audio":"assets/data/audios/yuan_7.mp3","text":" it captured Xixia and the Jin Dynasty (1115 - 1234)","state":1},{"id":8,"audioId":"yuan_8","audio":"assets/data/audios/yuan_8.mp3","text":" after which the combative Mongolian army sent its military forces into Central Asia and Europe.","state":1}]},{"id":14,"name":"ming","introduction":"Ming dynasty, Wade-Giles romanization Ming,  (1368–1644), Chinese dynasty that provided an interval of native Chinese rule between, eras of Mongol and Manchu dominance. During the reign of the Ming dynasty, China exerted immense cultural, and political influence on East Asia and the Turks to the west, as well as on Vietnam and Myanmar to the south.","startYear":1368,"endYear":1644,"chinese":0,"enable":1,"totalPeriod":3,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":261,"name":"Revolt and rebel rivalry","description":"The Mongol-led Yuan Dynasty (1271–1368) ruled before the establishment of the Ming Dynasty. Alongside institutionalized ethnic discrimination against Han Chinese that stirred resentment and rebellion, other explanations for the Yuan's demise included overtaxing areas hard-hit by inflation, and massive flooding of the Yellow River as a result of the abandonment of irrigation projects. Consequently, agriculture and the economy were in shambles and rebellion broke out among the hundreds of thousands of peasants called upon to work on repairing the dykes of the Yellow River.","editDateTime":"2013-12-10 00:13:33","resourceCategoryId":1,"dynastyId":14,"x":585,"y":125,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":262,"name":"Reign of the Hongwu Emperor","description":"Hongwu made an immediate effort to rebuild state infrastructure. He built a 48 km (30 mi) long wall around Nanjing, as well as new palaces and government halls. The History of Ming states that as early as 1364 Zhu Yuanzhang had begun drafting a new Confucian law code, the Da Ming Lü, which was completed by 1397 and repeated certain clauses found in the old Tang Code of 653. Hongwu organized a military system known as the weisuo, which was similar to the fubing system of the Tang Dynasty (618–907).\r\n\r\nPortrait of the Hongwu Emperor (ruled in 1368–98)\r\nIn 1380 Hongwu had the Chancellor Hu Weiyong executed upon suspicion of a conspiracy plot to overthrow him; after that Hongwu abolished the Chancellery and assumed this role as chief executive and emperor, a precedent mostly followed throughout the Ming period. With a growing suspicion of his ministers and subjects, Hongwu established the Jinyiwei, a network of secret police drawn from his own palace guard. They were partly responsible for the loss of 100,000 lives in several purges over three decades of his rule. ","editDateTime":"2013-12-10 00:16:17","resourceCategoryId":1,"dynastyId":14,"x":629,"y":154,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":263,"name":"South-Western frontier","description":"In Qinghai, the Salar Muslims voluntarily came under Ming rule, their clan leaders capitulating around 1370. Uyghur troops under Uyghur general Hala Bashi suppressed the Miao Rebellions of the 1370s and settled in Changde, Hunan. Hui Muslim troops also settled in Changde, Hunan after serving the Ming in campaigns against other aboriginal tribes. In 1381, the Ming Dynasty annexed the areas of the southwest that had once been part of the Kingdom of Dali following the successful effort by Hui Muslim Ming armies to defeat Yuan-loyalist Mongol and Hui Muslim troops holding out in Yunnan province. The Hui troops under General Mu Ying, who was appointed Governor of Yunnan, were resettled in the region as part of a colonization effort. By the end of the 14th century, some 200,000 military colonists settled some 2,000,000 mu (350,000 acres) of land in what is now Yunnan and Guizhou. Roughly half a million more Chinese settlers came in later periods; these migrations caused a major shift in the ethnic make-up of the region, since formerly more than half of the population were non-Han peoples. Resentment over such massive changes in population and the resulting government presence and policies sparked more Miao and Yao revolts in 1464 to 1466, which were crushed by an army of 30,000 Ming troops (including 1,000 Mongols) joining the 160,000 local Guangxi (see Miao Rebellions (Ming dynasty)). After the scholar and philosopher Wang Yangming (1472–1529) suppressed another rebellion in the region, he advocated single, unitary administration of Chinese and indigenous ethnic groups in order to bring about sinification of the local peoples. ","editDateTime":"2013-12-10 00:16:49","resourceCategoryId":1,"dynastyId":14,"x":653,"y":172,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":264,"name":"Relations with Tibet","description":"The Mingshi— the official history of the Ming Dynasty compiled later by the Qing Dynasty in 1739 —states that the Ming established itinerant commanderies overseeing Tibetan administration while also renewing titles of ex-Yuan Dynasty officials from Tibet and conferring new princely titles on leaders of Tibet's Buddhist sects. However, Turrell V. Wylie states that censorship in the Mingshi in favor of bolstering the Ming emperor's prestige and reputation at all costs obfuscates the nuanced history of Sino-Tibetan relations during the Ming era.\r\nModern scholars debate whether the Ming Dynasty had sovereignty over Tibet. Some believe it was a relationship of loose suzerainty which was largely cut off when the Jiajing Emperor (r. 1521–67) persecuted Buddhism in favor of Daoism at court Others argue that the significant religious nature of the relationship with Tibetan lamas is underrepresented in modern scholarship. Others note the Ming need for Central Asian horses and the need to maintain the tea-horse trade.","editDateTime":"2013-12-10 00:18:11","resourceCategoryId":1,"dynastyId":14,"x":698,"y":199,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":265,"name":"Rise to power","description":"The Hongwu Emperor specified his grandson Zhu Yunwen as his successor, and he assumed the throne as the Jianwen Emperor (1398–1402) after Hongwu's death in 1398. The most powerful of Hongwu's sons, Zhu Di, then the militarily mighty disagreed with this, and soon a political showdown erupted between him and his nephew Jianwen. After Jianwen arrested many of Zhu Di's associates, Zhu Di plotted a rebellion that sparked a three-year civil war. Under the pretext of rescuing the young Jianwen from corrupting officials, Zhu Di personally led forces in the revolt; the palace in Nanjing was burned to the ground, along with Jianwen himself, his wife, mother, and courtiers. Zhu Di assumed the throne as the Yongle Emperor (1402–1424); his reign is universally viewed by scholars as a \"second founding\" of the Ming Dynasty since he reversed many of his father's policies. ","editDateTime":"2013-12-10 00:18:33","resourceCategoryId":1,"dynastyId":14,"x":621,"y":257,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":266,"name":"New capital and foreign engagement","description":"Yongle demoted Nanjing to a secondary capital and in 1403 announced the new capital of China was to be at his power base in Beijing. Construction of a new city there lasted from 1407 to 1420, employing hundreds of thousands of workers daily. At the center was the political node of the Imperial City, and at the center of this was the Forbidden City, the palatial residence of the emperor and his family. By 1553, the Outer City was added to the south, which brought the overall size of Beijing to 4 by 4½ miles.","editDateTime":"2013-12-10 00:18:54","resourceCategoryId":1,"dynastyId":14,"x":513,"y":303,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":267,"name":"Treasure voyages","description":"Beginning in 1405, the Yongle Emperor entrusted his favored eunuch commander Zheng He (1371–1433) as the admiral for a gigantic new fleet of ships designated for international tributary missions. The Chinese had sent diplomatic missions over land and west since the Han Dynasty (202 BCE – 220 CE) and had been engaged in private overseas trade leading all the way to East Africa for centuries— culminating in the Song and Yuan dynasties —but no government-sponsored tributary mission of this grandeur and size had ever been assembled before. To service seven different tributary missions abroad, the Nanjing shipyards constructed two thousand vessels from 1403 to 1419, which included the large treasure ships that measured 112 m (370 ft) to 134 m (440 ft) in length and 45 m (150 ft) to 54 m (180 ft) in width.","editDateTime":"2013-12-10 00:19:36","resourceCategoryId":1,"dynastyId":14,"x":554,"y":334,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":268,"name":"Tumu Crisis and the Ming Mongols","description":"The Oirat Mongol leader Esen Tayisi launched an invasion into Ming China in July 1449. The chief eunuch Wang Zhen encouraged the Zhengtong Emperor (r. 1435–49) to lead a force personally to face the Mongols after a recent Ming defeat; marching off with 50,000 troops,[citation needed] the emperor left the capital and put his half-brother Zhu Qiyu in charge of affairs as temporary regent. On September 8, Esen routed Zhengtong's army, and Zhengtong was captured—an event known as the Tumu Crisis. The Mongols held the Zhengtong Emperor for ransom. However, this scheme was foiled once the emperor's younger brother assumed the throne under the era name Jingtai (r. 1449–57); the Mongols were also repelled once the Jingtai Emperor's confidant and defense minister Yu Qian (1398–457) gained control of the Ming armed forces. Holding the Zhengtong Emperor in captivity was a useless bargaining chip for the Mongols as long as another sat on his throne, so they released him back into Ming China. The former emperor was placed under house arrest in the palace until the coup against the Jingtai Emperor in 1457 known as the \"Wresting the Gate Incident\". The former emperor retook the throne under the new era name Tianshun (r. 1457–64).","editDateTime":"2013-12-10 00:20:13","resourceCategoryId":1,"dynastyId":14,"x":272,"y":322,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":269,"name":"Reign of the Wanli Emperor","description":"The financial drain of the Imjin War in Korea against the Japanese was one of the many problems—fiscal or other—facing Ming China during the reign of the Wanli Emperor (r. 1572–1620). In the beginning of his reign, Wanli surrounded himself with able advisors and made a conscientious effort to handle state affairs. His Grand Secretary Zhang Juzheng (1572–82) built up an effective network of alliances with senior officials. However, there was no one after him skilled enough to maintain the stability of these alliances; officials soon banded together in opposing political factions. Over time Wanli grew tired of court affairs and frequent political quarreling amongst his ministers, preferring to stay behind the walls of the Forbidden City and out of his officials' sight. Scholar-officials lost prominence in administration as eunuchs became intermediaries between the aloof emperor and his officials; any senior official who wanted to discuss state matters had to persuade powerful eunuchs with a bribe simply to have his demands or message relayed to the emperor.","editDateTime":"2013-12-10 00:20:35","resourceCategoryId":1,"dynastyId":14,"x":310,"y":363,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":270,"name":"Role of eunuchs","description":"The Hongwu Emperor forbade eunuchs to learn how to read or engage in politics. Whether or not these restrictions were carried out with absolute success in his reign, eunuchs during the Yongle Emperor's reign and afterwards managed huge imperial workshops, commanded armies, and participated in matters of appointment and promotion of officials. The eunuchs developed their own bureaucracy that was organized parallel to but was not subject to the civil service bureaucracy. Although there were several dictatorial eunuchs throughout the Ming, such as Wang Zhen, Wang Zhi, and Liu Jin, excessive tyrannical eunuch power did not become evident until the 1590s when the Wanli Emperor increased their rights over the civil bureaucracy and granted them power to collect provincial taxes.","editDateTime":"2013-12-10 00:21:10","resourceCategoryId":1,"dynastyId":14,"x":365,"y":321,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":271,"name":"Economic breakdown and natural disasters","description":"During the last years of the Wanli era and those of his two successors, an economic crisis developed that was centered around a sudden widespread lack of the empire's chief medium of exchange: silver. Philip IV of Spain (reigned 1621–1665) began cracking down on illegal smuggling of silver from New Spain and Peru across the Pacific towards China, in favor of shipping American-mined silver through Spanish ports. In 1639 the new Tokugawa regime of Japan shut down most of its foreign trade with European powers, cutting off another source of silver coming into China. These events occurring at roughly the same time caused a dramatic spike in the value of silver and made paying taxes nearly impossible for most provinces. People began hoarding precious silver as there was progressively less of it, forcing the ratio of the value of copper to silver into a steep decline. In the 1630s a string of one thousand copper coins equaled an ounce of silver; by 1640 that sum could fetch half an ounce; and, by 1643 only one-third of an ounce. For peasants this meant economic disaster, since they paid taxes in silver while conducting local trade and crop sales in copper.","editDateTime":"2013-12-10 00:21:44","resourceCategoryId":1,"dynastyId":14,"x":397,"y":380,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":272,"name":"Rise of the Manchu","description":"A Jurchen tribal leader named Nurhaci (r. 1616–26), starting with just a small tribe, rapidly gained control over all the Manchurian tribes. During the Japanese invasions of Korea in the 1590s, he offered to lead his tribes in support of the Ming and Joseon army. This offer was declined, but he was granted honorific Ming titles for his gesture. Recognizing the weakness of Ming authority north of their border, he united all of the adjacent northern tribes and consolidated power in the region surrounding his homeland as the Jurchen Jin Dynasty had done previously. In 1610, he broke relations with the Ming court; in 1618, he demanded the Ming pay tribute to him to redress \"Seven Grievances\" which he documented and sent to the Ming court. This was effectively a declaration of war, as the Ming were not about to pay money to a former tributary.","editDateTime":"2013-12-10 00:22:06","resourceCategoryId":1,"dynastyId":14,"x":390,"y":452,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":273,"name":"Rebellion, invasion, collapse","description":"A peasant soldier named Li Zicheng mutinied with his fellow soldiers in western Shaanxi in the early 1630s after the Ming government failed to ship much-needed supplies there. In 1634 he was captured by a Ming general and released only on the terms that he return to service. The agreement soon broke down when a local magistrate had thirty-six of his fellow rebels executed; Li's troops retaliated by killing the officials and continued to lead a rebellion based in Rongyang, central Henan province by 1635. By the 1640s, an ex-soldier and rival to Li—Zhang Xianzhong (1606–47) —had created a firm rebel base in Chengdu, Sichuan, while Li's center of power was in Hubei with extended influence over Shaanxi and Henan.","editDateTime":"2013-12-10 00:22:45","resourceCategoryId":1,"dynastyId":14,"x":443,"y":401,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":274,"name":"Province, prefecture, subprefecture, county","description":"The Ming emperors took over the provincial administration system of the Yuan Dynasty, and the thirteen Ming provinces are the precursors of the modern provinces. Throughout the Song Dynasty, the largest political division was the circuit (lu 路). However, after the Jurchen invasion in 1127, the Song court established four semi-autonomous regional command systems based on territorial and military units, with a detached service secretariat that would become the provincial administrations of the Yuan, Ming, and Qing dynasties. Copied on the Yuan model, the Ming provincial bureaucracy contained three commissions: one civil, one military, and one for surveillance. Below the level of the province were prefectures (fu 府) operating under a prefect, followed by subprefectures under a subprefect. The lowest unit was the county (xian 縣), overseen by a magistrate. Besides the provinces, there were also two large areas that belonged to no province, but were metropolitan areas (jing 亰) attached to Nanjing and Beijing.","editDateTime":"2013-12-10 00:23:41","resourceCategoryId":1,"dynastyId":14,"x":509,"y":375,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":275,"name":"Institutional trends","description":"Departing from the main central administrative system generally known as the Three Departments and Six Ministries system, which was instituted by various dynasties since late Han (202 BCE – 220 CE), the Ming administration had only one Department, the Secretariat, that controlled the Six Ministries. Following the execution of the Chancellor Hu Weiyong in 1380, the Hongwu Emperor abolished the Secretariat, the Censorate, and the Chief Military Commission and personally took charge of the Six Ministries and the regional Five Military Commissions. Thus a whole level of administration was cut out and only partially rebuilt by subsequent rulers. The Grand Secretariat, at the beginning a secretarial institution that assisted the emperor with administrative paperwork, was instituted, but without employing grand counselors, or chancellors. The ministries, headed by a minister and run by directors remained under direct control of the emperor until the end of the Ming.","editDateTime":"2013-12-10 00:24:04","resourceCategoryId":1,"dynastyId":14,"x":568,"y":412,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":276,"name":"Grand Secretariat and Six Ministries","description":"overnmental institutions in China conformed to a similar pattern for some two thousand years, but each dynasty installed special offices and bureaus, reflecting its own particular interests. The Ming administration had the Grand Secretaries assisting the emperor, with paperwork handled by them under Yongle's reign and finally appointed as top officials of agencies and Grand Preceptor, a top-ranking, non-functional civil service post, under the Hongxi Emperor (ruled in 1424–5). The Grand Secretariat drew its members from the Hanlin Academy and were considered part of the imperial authority, not the ministerial one (hence being at odds with both the emperor and ministers at times). The Secretariat was a coordinating agency, whereas the Six Ministries","editDateTime":"2013-12-10 00:24:47","resourceCategoryId":1,"dynastyId":14,"x":500,"y":442,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":277,"name":"Scholar-officials","description":"After the reign of Hongwu—who from 1373 to 84 staffed his bureaus with officials gathered through recommendations only—the scholar-officials who populated the many ranks of bureaucracy were recruited through a rigorous examination system that was first established by the Sui Dynasty (581–618). Theoretically the system of exams allowed anyone to join the ranks of imperial officials (although frowned upon for merchants to join); in reality the time and funding needed to support the study in preparation for the exam generally limited participants to those already coming from the landholding class. However, the government did exact provincial quotas while drafting officials. This was an effort to curb monopolization of power by landholding gentry who came from the most prosperous regions, where education was the most advanced.  The expansion of the printing industry since Song times enhanced the spread of knowledge and number of potential exam candidates throughout the provinces. For young schoolchildren there were printed multiplication tables and primers for elementary vocabulary; for adult examination candidates there were mass-produced, inexpensive volumes of Confucian classics and successful examination answers.","editDateTime":"2013-12-10 00:25:20","resourceCategoryId":1,"dynastyId":14,"x":578,"y":125,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":278,"name":"Lesser functionaries","description":"Scholar-officials who entered civil service through examinations acted as executive officials to a much larger body of non-ranked personnel called lesser functionaries. They outnumbered officials by four to one; Charles Hucker estimates that they were perhaps as many as 100,000 throughout the empire. These lesser functionaries performed clerical and technical tasks for government agencies. Yet they should not be confused with lowly lictors, runners, and bearers; lesser functionaries were given periodic merit evaluations like officials and after nine years of service might be accepted into a low civil service rank.The one great advantage of the lesser functionaries over officials was that officials were periodically rotated and assigned to different regional posts and had to rely on the good service and cooperation of the local lesser functionaries.","editDateTime":"2013-12-10 00:25:54","resourceCategoryId":1,"dynastyId":14,"x":612,"y":157,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":283,"name":"Urban and rural life","description":"Wang Gen was able to give philosophical lectures to many commoners from different regions because—following the trend already apparent in the Song Dynasty—communities in Ming society were becoming less isolated as the distance between market towns was shrinking. Schools, descent groups, religious associations, and other local voluntary organizations were increasing in number and allowing more contact between educated men and local villagers. Jonathan Spence writes that the distinction between what was town and country was blurred in Ming China, since suburban areas with farms were located just outside and in some cases within the walls of a city. Not only was the blurring of town and country evident, but also of socioeconomic class in the traditional four occupations, since artisans sometimes worked on farms in peak periods and farmers often traveled into the city to find work during times of dearth.","editDateTime":"2013-12-10 00:29:53","resourceCategoryId":1,"dynastyId":14,"x":544,"y":297,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":284,"name":"Science and technology","description":"Compared to the flourishing of science and technology in the Song Dynasty, the Ming Dynasty perhaps saw fewer advancements in science and technology compared to the pace of discovery in the Western world. In fact, key advances in Chinese science in the late Ming were spurred by contact with Europe. In 1626 Johann Adam Schall von Bell wrote the first Chinese treatise on the telescope, the Yuanjingshuo (Far Seeing Optic Glass); in 1634 the Chongzhen Emperor acquired the telescope of the late Johann Schreck (1576–1630). The heliocentric model of the solar system was rejected by the Catholic missionaries in China, but Johannes Kepler and Galileo Galilei's ideas slowly trickled into China starting with the Polish Jesuit Michael Boym (1612–59) in 1627, Adam Schall von Bell's treatise in 1640, and finally Joseph Edkins, Alex Wylie, and John Fryer in the 19th century. Catholic Jesuits in China would promote Copernican theory at court, yet at the same time embrace the Ptolemaic system in their writing; it was not until 1865 that Catholic missionaries in China sponsored the heliocentric model as their Protestant peers did. Although Shen Kuo (1031–95) and Guo Shoujing (1231–316) had laid the basis for trigonometry in China, another important work in Chinese trigonometry would not be published again until 1607 with the efforts of Xu Guangqi and Matteo Ricci. Ironically, some inventions which had their origins in ancient China were reintroduced to China from Europe during the late Ming; for example, the field mill.","editDateTime":"2013-12-10 00:34:29","resourceCategoryId":1,"dynastyId":14,"x":504,"y":312,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":285,"name":"Science and technology","description":"The Chinese calendar was in need of reform since it inadequately measured the solar year at 365 ¼ days, giving an error of 10 min and 14 sec a year or roughly a full day every 128 years.  Although the Ming had adopted Guo Shoujing's Shoushi calendar of 1281, which was just as accurate as the Gregorian Calendar, the Ming Directorate of Astronomy failed to periodically readjust it; this was perhaps due to their lack of expertise since their offices had become hereditary in the Ming and the Statutes of the Ming prohibited private involvement in astronomy. A sixth-generation descendant of Emperor Hongxi, the \"Prince\" Zhu Zaiyu (1536–611), submitted a proposal to fix the calendar in 1595, but the ultra-conservative astronomical commission rejected it. This was the same Zhu Zaiyu who discovered the system of tuning known as equal temperament, a discovery made simultaneously by Simon Stevin (1548–1620) in Europe. In addition to publishing his works on music, he was able to publish his findings on the calendar in 1597. A year earlier, the memorial of Xing Yunlu suggesting a calendar improvement was rejected by the Supervisor of the Astronomical Bureau due to the law banning private practice of astronomy; Xing would later serve with Xu Guangqi in reforming the calendar in 1629 according to Western standards.","editDateTime":"2013-12-10 00:37:17","resourceCategoryId":1,"dynastyId":14,"x":380,"y":265,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":280,"name":"Religion","description":"The dominant religious beliefs during the Ming dynasty were the various forms of Chinese folk religion and the Three Teachings – Confucianism, Taoism, and Buddhism. The Yuan-supported Tibetan lamas fell from favor and the early Ming emperors particularly favored Taoism granting its practitioners many positions in the state's ritual offices.[135] The Hongwu Emperor curtailed the cosmopolitan culture of the Mongol Yuan Dynasty, and the prolific Prince of Ning Zhu Quan even composed one encyclopedia attacking Buddhism as a foreign \"mourning cult\" deleterious to the state and another encyclopedia that subsequently joined the Taoist canon.","editDateTime":"2013-12-10 00:27:14","resourceCategoryId":2,"dynastyId":14,"x":639,"y":222,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":282,"name":"Conservative reaction","description":"ther scholar-bureaucrats were wary of Wang's heterodoxy, the increasing number of his disciples while still in office, and his overall socially-rebellious message. To curb his influence, he was often sent out to deal with military affairs and rebellions far away from the capital. Yet his ideas penetrated mainstream Chinese thought and spurred new interest in Taoism and Buddhism. Furthermore, people began to question the validity of the social hierarchy and the idea that the scholar should be above the farmer. Wang Yangming's disciple and salt-mine worker Wang Gen gave lectures to commoners about pursuing education to improve their lives, while his follower He Xinyin challenged the elevation and emphasis of the family in Chinese society. His contemporary Li Zhi even taught that women were the intellectual equals of men and should be given a better education; both Li and He eventually died in prison, jailed on charges of spreading \"dangerous ideas\".Yet these \"dangerous ideas\" of educating women had long been embraced by some mothers and by courtesans who were as literate and skillful in calligraphy, painting, and poetry as their male guests.","editDateTime":"2013-12-10 00:28:35","resourceCategoryId":2,"dynastyId":14,"x":637,"y":280,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":286,"name":"Population","description":"Sinologist historians debate the population figures for each era in the Ming Dynasty. The historian Timothy Brook notes that the Ming government census figures are dubious since fiscal obligations prompted many families to underreport the number of people in their households and many county officials to underreport the number of households in their jurisdiction. Children were often underreported, especially female children, as shown by skewed population statistics throughout the Ming. Even adult women were underreported; for example, the Daming Prefecture in North Zhili reported a population of 378 167 males and 226 982 females in 1502. The government attempted to revise the census figures using estimates of the expected average number of people in each household, but this did not solve the widespread problem of tax registration. Some part of the gender imbalance may be attributed to the practice of female infanticide. The practice is well documented in China, going back over two thousand years, and it was described as \"rampant\" and \"practiced by almost every family\" by contemporary authors. However, the dramatically skewed sex ratios, which many counties reported exceeding 2:1 by 1586, can't likely be explained by infanticide alone.","editDateTime":"2013-12-10 00:37:53","resourceCategoryId":2,"dynastyId":14,"x":346,"y":300,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":298,"name":"Cup","description":"assets/data/images/ming_Cup.jpg","editDateTime":"2013-12-10 00:56:16","resourceCategoryId":2,"dynastyId":14,"x":677,"y":231,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":2},{"id":310,"name":"The Ming Dynasty Part 02","description":"assets/data/videos/The_Ming_Dynasty_Part_02.webm","editDateTime":"2013-12-10 01:10:49","resourceCategoryId":2,"dynastyId":14,"x":499,"y":482,"resourceTypeId":3,"iconName":"icon_society","dynastyPeriod":2},{"id":311,"name":"The Ming Dynasty Part 01","description":"assets/data/videos/The_Ming_Dynasty_Part_01.webm","editDateTime":"2013-12-10 01:11:33","resourceCategoryId":2,"dynastyId":14,"x":562,"y":461,"resourceTypeId":3,"iconName":"icon_society","dynastyPeriod":2},{"id":312,"name":"Ming Dynasty Armor","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-10 01:12:02","resourceCategoryId":2,"dynastyId":14,"x":433,"y":359,"resourceTypeId":3,"iconName":"icon_society","dynastyPeriod":2},{"id":313,"name":"Zhu Yuanzhang","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-10 01:12:42","resourceCategoryId":2,"dynastyId":14,"x":485,"y":433,"resourceTypeId":3,"iconName":"icon_society","dynastyPeriod":2}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[{"id":279,"name":"Literature and arts","description":"The Ming Dynasty saw a flourishing literature, painting, poetry, music, and Chinese opera of various types, especially in the prosperous commercial lower Yangzi valley.\r\nAlthough short fiction had been popular as far back as the Tang Dynasty (618–907), and the works of contemporaneous authors such as Xu Guangqi, Xu Xiake, and Song Yingxing were often technical and encyclopedic, the most striking literary development was the vernacular novel. While the gentry elite were educated enough to fully comprehend the language of Classical Chinese, those with rudimentary education— such as women in educated families, merchants, and shop clerks —became a large potential audience for literature and performing arts that employed Vernacular Chinese. Literati scholars edited or developed major Chinese novels into mature form in this period, such as Water Margin and Journey to the West. Jin Ping Mei, published in 1610, although incorporating earlier material, marks the trend toward independent composition and concern with psychology. In the later years of the dynasty, Feng Menglong and Ling Mengchu innovated with vernacular short fiction. Theater scripts were equally imaginative. The most famous, The Peony Pavilion, was written by Tang Xianzu (1550–1616), with its first performance at the Pavilion of Prince Teng in 1598.","editDateTime":"2013-12-10 00:26:49","resourceCategoryId":3,"dynastyId":14,"x":664,"y":167,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":1},{"id":287,"name":"Dragon Pine","description":"assets/data/images/ming_Dragon_Pine.jpg","editDateTime":"2013-12-10 00:39:55","resourceCategoryId":3,"dynastyId":14,"x":255,"y":319,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":288,"name":"Sutra box","description":"assets/data/images/ming_Sutra_box.jpg","editDateTime":"2013-12-10 00:40:53","resourceCategoryId":3,"dynastyId":14,"x":318,"y":362,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":289,"name":"Bodhisattva Manjushri","description":"assets/data/images/ming_Bodhisattva_Manjushri.jpg","editDateTime":"2013-12-10 00:41:49","resourceCategoryId":3,"dynastyId":14,"x":402,"y":367,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":290,"name":"Rank badge","description":"assets/data/images/ming_Rank_badge.jpg","editDateTime":"2013-12-10 00:42:54","resourceCategoryId":3,"dynastyId":14,"x":393,"y":452,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":291,"name":"Dish with scalloped rim","description":"assets/data/images/ming_Dish_with_scalloped_rim.jpg","editDateTime":"2013-12-10 00:44:45","resourceCategoryId":3,"dynastyId":14,"x":486,"y":410,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":292,"name":"Elegant Gathering in the Apricot Garden","description":"assets/data/images/ming_Dish_with_scalloped_rim.jpg","editDateTime":"2013-12-10 00:49:19","resourceCategoryId":3,"dynastyId":14,"x":558,"y":390,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":293,"name":"jar","description":"assets/data/images/ming_jar.jpg","editDateTime":"2013-12-10 00:50:22","resourceCategoryId":3,"dynastyId":14,"x":547,"y":459,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":294,"name":"Bamboo in Wind","description":"assets/data/images/ming_Bamboo_in_Wind.jpg","editDateTime":"2013-12-10 00:51:13","resourceCategoryId":3,"dynastyId":14,"x":575,"y":433,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":295,"name":"Welcoming Spring","description":"assets/data/images/ming_Bamboo_in_Wind.jpg","editDateTime":"2013-12-10 00:52:15","resourceCategoryId":3,"dynastyId":14,"x":610,"y":120,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":296,"name":"Two Hawks in a Thicket","description":"assets/data/images/ming_Two_Hawks_in_a_Thicket.jpg","editDateTime":"2013-12-10 00:54:09","resourceCategoryId":3,"dynastyId":14,"x":655,"y":157,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":297,"name":"Garden of the Unsuccessful Politician","description":"assets/data/images/ming_Garden_of_the_Unsuccessful_Politician.jpg","editDateTime":"2013-12-10 00:55:10","resourceCategoryId":3,"dynastyId":14,"x":705,"y":185,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":299,"name":"Dish","description":"assets/data/images/ming_Dish.jpg","editDateTime":"2013-12-10 00:57:11","resourceCategoryId":3,"dynastyId":14,"x":540,"y":324,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":300,"name":"Shaded Dwellings among Streams and Mountains","description":"assets/data/images/ming_Shaded_Dwellings_among_Streams_and_Mountains.jpg","editDateTime":"2013-12-10 00:58:17","resourceCategoryId":3,"dynastyId":14,"x":504,"y":368,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":301,"name":"Pipa","description":"assets/data/images/ming_Pipa.jpg","editDateTime":"2013-12-10 00:59:27","resourceCategoryId":3,"dynastyId":14,"x":271,"y":325,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":302,"name":"Jar","description":"assets/data/images/ming_Jar_2.jpg","editDateTime":"2013-12-10 01:00:35","resourceCategoryId":3,"dynastyId":14,"x":320,"y":361,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":303,"name":"Landscape","description":"assets/data/images/ming_Landscape.jpg","editDateTime":"2013-12-10 01:01:36","resourceCategoryId":3,"dynastyId":14,"x":406,"y":401,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":304,"name":"Wardrobe","description":"assets/data/images/ming_Wardrobe.jpg","editDateTime":"2013-12-10 01:03:03","resourceCategoryId":3,"dynastyId":14,"x":482,"y":392,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":305,"name":"Portrait of the Artist's Great Grand Uncle","description":"assets/data/images/ming_Portrait_of_the_Artist.jpg","editDateTime":"2013-12-10 01:03:54","resourceCategoryId":3,"dynastyId":14,"x":545,"y":399,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":306,"name":"The Sixteen Luohans","description":"assets/data/images/xia_culture1.jpg","editDateTime":"2013-12-10 01:04:55","resourceCategoryId":3,"dynastyId":14,"x":567,"y":434,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":307,"name":"Medallion with Return from a Spring Outing","description":"assets/data/images/ming_Medallion_with_Return_from_a_Spring_Outing.jpg","editDateTime":"2013-12-10 01:05:43","resourceCategoryId":3,"dynastyId":14,"x":516,"y":461,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":308,"name":"Rag–dung","description":"assets/data/images/ming_Rag–dung.jpg","editDateTime":"2013-12-10 01:06:46","resourceCategoryId":3,"dynastyId":14,"x":434,"y":440,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":309,"name":"Incense holder","description":"assets/data/images/ming_Incense_holder.jpg","editDateTime":"2013-12-10 01:07:34","resourceCategoryId":3,"dynastyId":14,"x":396,"y":472,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2}]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[{"id":281,"name":"Philosophy","description":"During the Ming Dynasty, the Neo-Confucian doctrines of the Song scholar Zhu Xi were embraced by the court and the Chinese literati at large, although the direct line of his school was destroyed by the Yongle Emperor's extermination of the ten degrees of kinship of Fang Xiaoru in 1402.\r\nThe Ming scholar most influential upon subsequent generations, however, was Wang Yangming (1472–1529), whose teachings were attacked in his own time for their similarity to Chan Buddhism. Building upon Zhu Xi's concept of the \"extension of knowledge\" , gaining understanding through careful and rational investigation of things and events, Wang argued that universal concepts would appear in the minds of anyone. Therefore, he claimed that anyone – no matter their pedigree or education – could become as wise as Confucius and Mencius had been and that their writings were not sources of truth but merely guides which might have flaws when carefully examined.  A peasant with a great deal of experience and intelligence would then be wiser than an official who had memorized the Classics but not experienced the real world.","editDateTime":"2013-12-10 00:27:23","resourceCategoryId":5,"dynastyId":14,"x":708,"y":209,"resourceTypeId":1,"iconName":"icon_technology","dynastyPeriod":1}]},{"id":6,"name":"introduction","chinese":"介绍","resources":[]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":32,"period":0,"dynastyId":14,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5},{"id":33,"period":1,"dynastyId":14,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5},{"id":34,"period":2,"dynastyId":14,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":100,"mapZ":1.5}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"ming_0","audio":"assets/data/audios/ming_0.mp3","text":"Ming dynasty","state":1},{"id":1,"audioId":"ming_1","audio":"assets/data/audios/ming_1.mp3","text":" Wade-Giles romanization Ming","state":1},{"id":2,"audioId":"ming_2","audio":"assets/data/audios/ming_2.mp3","text":"  (1368–1644)","state":1},{"id":3,"audioId":"ming_3","audio":"assets/data/audios/ming_3.mp3","text":" Chinese dynasty that provided an interval of native Chinese rule between","state":1},{"id":4,"audioId":"ming_4","audio":"assets/data/audios/ming_4.mp3","text":" eras of Mongol and Manchu dominance","state":1},{"id":5,"audioId":"ming_5","audio":"assets/data/audios/ming_5.mp3","text":"During the reign of the Ming dynasty","state":1},{"id":6,"audioId":"ming_6","audio":"assets/data/audios/ming_6.mp3","text":" China exerted immense cultural","state":1},{"id":7,"audioId":"ming_7","audio":"assets/data/audios/ming_7.mp3","text":" and political influence on East Asia and the Turks to the west","state":1},{"id":8,"audioId":"ming_8","audio":"assets/data/audios/ming_8.mp3","text":" as well as on Vietnam and Myanmar to the south.","state":1}]},{"id":15,"name":"qing","introduction":"Before Qing's establishment, there was a regime called 'Latter Jin' that had been set up by Nurhachu, leader of the Man Ethnic Minority. Actually, Man people were the offspring of the Nuzhen people, who had always been living in Northeast China. After reunifying all the Nuzhen tribes, Nurhachu proclaimed himself emperor in 1616. Thus a new regime called Latter Jin, was founded in Hetu Ala (in current Liaoning Province), during the reign of Emperor Shenzong of the Ming Dynasty (1368 - 1644).","startYear":1644,"endYear":1911,"chinese":0,"enable":1,"totalPeriod":3,"categories":[{"id":1,"name":"history","chinese":"历史","iconName":"icon_history","resources":[{"id":314,"name":"Formation of the Manchu state","description":"The Qing Dynasty was founded not by Han Chinese, who form the majority of the Chinese population, but by a semi-sedentary people known as the Jurchen, a Tungusic people who lived around the region now comprising the Chinese provinces of Jilin and Heilongjiang. What was to become the Manchu state was founded by Nurhachi, the chieftain of a minor Jurchen tribe – the Aisin Gioro – in Jianzhou in the early 17th century. Originally a vassal of the Ming emperors, Nurhachi embarked on an inter-tribal feud in 1582 that escalated into a campaign to unify the nearby tribes. By 1616, he had sufficiently consolidated Jianzhou so as to be able to proclaim himself Khan of the Great Jin in reference to the previous Jurchen dynasty.","editDateTime":"2013-12-10 19:13:39","resourceCategoryId":1,"dynastyId":15,"x":267,"y":218,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":315,"name":"Formation of the Manchu state","description":"Two years later, Nurhachi announced the \"Seven Grievances\" and openly renounced the sovereignty of Ming overlordship in order to complete the unification of those Jurchen tribes still allied with the Ming emperor. After a series of successful battles, he relocated his capital from Hetu Ala to successively bigger captured Ming cities in Liaodong Province: first Liaoyang in 1621, then Shenyang (Mukden) in 1625. ","editDateTime":"2013-12-10 19:14:05","resourceCategoryId":1,"dynastyId":15,"x":247,"y":264,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":316,"name":"Claiming the Mandate of Heaven","description":"Hong Taiji died suddenly in September 1643 without a designated heir. As the Jurchens had traditionally \"elected\" their leader through a council of nobles, the Qing state did not have in place a clear succession system until the reign of the Kangxi Emperor. The leading contenders for power at this time were Hong Taiji's oldest son Hooge and Hong Taiji's agnate half brother Dorgon. In the ensuing political impasse between the two bitter political rivals, a compromise candidate in the person of Hong Taiji's five-year-old son Fulin, was installed as the Shunzhi Emperor, with Dorgon as regent and de facto leader of the Manchu nation.\r\nThe Manchus' archenemy, the Ming Dynasty, was fighting for its own survival against a long peasant rebellion and was unable to capitalise on the Qing court's political uncertainty over the succession dispute and installation of a minor as emperor. The Ming Dynasty's internal crisis came to a head in April 1644, when the capital at Beijing was sacked by a coalition of rebel forces led by Li Zicheng, a former minor Ming official who became the leader of the peasant revolt and established a short-lived Shun Dynasty. The last Ming ruler, the Chongzhen Emperor, committed suicide when the city fell, marking the official end of the dynasty.","editDateTime":"2013-12-10 19:14:36","resourceCategoryId":1,"dynastyId":15,"x":314,"y":250,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":317,"name":"The Kangxi Emperor's reign and consolidation","description":"The sixty-one year reign of the Kangxi Emperor was the longest of any Chinese emperor. But more importantly, apart from its length, Kangxi's reign is also celebrated as the beginning of an era called \"Kang-Qian Golden Age\", also known as \"High Qing\", during which the Qing Dynasty reached the zenith of its social, economic and military power. Kangxi's long reign started when he was eight years old upon the untimely demise of his father. To prevent a repeat of Dorgon's dictatorial monopolizing of state power during the period of regency, the Shunzhi Emperor, on his deathbed, hastily appointed four senior cabinet ministers to govern on behalf of his young son. The four ministers — Sonin, Ebilun, Suksaha, and Oboi — were chosen for their long service to the emperor, but also to counteract each other's influences. Most importantly, the four were not closely related to the imperial family and laid no claim to the throne. However as time passed, through chance and machination, Oboi, the most junior of the four ministers, was able to achieve political dominance to such an extent as to become a potential threat to the crown. Even though Oboi's loyalty was never an issue, his personal arrogance and political conservatism led him to come into ever escalating conflict with the young Kangxi Emperor. In 1669 Kangxi, through trickery, disarmed and imprisoned Oboi — a not insignificant victory for the fifteen-year-old emperor, as Oboi was not only a wily old politician but also an experienced military commander.","editDateTime":"2013-12-10 19:14:44","resourceCategoryId":1,"dynastyId":15,"x":327,"y":311,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":318,"name":"Reigns of the Yongzheng and Qianlong emperors","description":"The reigns of the Yongzheng Emperor (r. 1723–1735) and his son, the Qianlong Emperor (r. 1735–1796), marked the height of the Qing Dynasty's power. During this period, the Qing Empire ruled over 13 million square kilometres of territory.\r\nAfter the Kangxi Emperor's death in the winter of 1722, his fourth son, Prince Yong, succeeded him as the Yongzheng Emperor. Yongzheng remained a controversial character because of rumours about him usurping the throne, and in the late years of Kangxi's reign, he was involved in great political struggles with his brothers. Yongzheng was a hardworking administrator who ruled with an iron hand. His first big step towards a stronger regime came when he brought the State Examination System back to its original standards. In 1724, he cracked down on illegal exchange rates of coins, which was being manipulated by officials to fit their financial needs. Those who were found in violation of new laws on finances were removed from office, or in extreme cases, executed.","editDateTime":"2013-12-10 19:15:43","resourceCategoryId":1,"dynastyId":15,"x":418,"y":259,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":319,"name":"Rebellion, unrest and external pressure","description":"The Qing struggled with the concept of international and state to state relations. Prior to the 19th-century, the Chinese empire was generally the hegemonic power in East Asia. However, the 18th century saw the European empires gradually expand across the world, as European states developed stronger economies built on maritime trade. European colonies had been established in nearby India and on the islands that are now part of Indonesia, whilst the Russian Empire advanced into the areas north of China. The Qing response was successful for a time in establishing the Canton System, which restricted and controlled maritime trade and the Treaty of Nerchinsk (1689), which stabilized relations with Czarist Russia.","editDateTime":"2013-12-10 19:16:39","resourceCategoryId":1,"dynastyId":15,"x":409,"y":338,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":320,"name":"Rebellion, unrest and external pressure","description":"In 1793, the British East India Company, with the support of the British government sent a delegation to China under Lord George Macartney in order to change the nature of trade between the two countries in a direction which they believed was more befitting for a country of Britain's status. Up to this point, all Western powers were forced to trade only at one port (at Canton) and traded very much on the Chinese system. This was formed around a fundamental disdain for both Western merchants and their goods. The government viewed trade as unimportant. For the British, however, maritime trade was the key to sustaining their economy.","editDateTime":"2013-12-10 19:17:04","resourceCategoryId":1,"dynastyId":15,"x":436,"y":404,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":321,"name":"Self-strengthening and the frustration of reforms","description":"Yet the dynasty rallied. Chinese generals and officials such as Zuo Zongtang had led the suppression of rebellions and stood behind the Manchus. When the Tongzhi Emperor came to the throne at the age of five in 1861, these officials rallied around him in what was called the Tongzhi Restoration. Their aim was to adopt western military technology in order to preserve Confucian values. Zeng Guofan, in alliance with Prince Gong, sponsored the rise of younger officials such as Li Hongzhang who put the dynasty back on its feet financially and instituted the Self-Strengthening Movement. The reformers then proceeded with institutional reforms, including the formation of modernized armies, such as the Beiyang Army, as well as a navy.","editDateTime":"2013-12-10 19:17:25","resourceCategoryId":1,"dynastyId":15,"x":513,"y":326,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":322,"name":"Incursions","description":"Starting in the 1840s, France increasingly seized control of Indochina, despite Chinese claims. By 1883 France was in full control of Indochina, and had reached the Chinese border. In 1884, the Sino-French War over Tonkin, once a Qing tributary state, broke out, ending with French victory over China and Chinese recognition of all the French claims. \r\nIn 1884, the Gapsin Coup, led by pro-Japanese Koreans, occurred in Seoul. The incident led to tensions between China and Japan over the peninsula, after China went in to suppress the uprising. In an effort to alleviate the tensions, Japanese Prime Minister Ito Hirobumi and Li Hongzhang signed the Convention of Tientsin, in which both China and Japan agreed to simultaneously withdraw troops from the Korean Peninsula.","editDateTime":"2013-12-10 19:17:49","resourceCategoryId":1,"dynastyId":15,"x":619,"y":202,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":323,"name":"Rule of Empress Dowager Cixi","description":"The Empress Dowager Cixi (Wade-Giles: Tz'u-Hsi), concubine to the Xianfeng Emperor (r. 1850–1861) came to power in 1861 after her five year-old son, the Tongzhi Emperor ascended the throne, and a coup that had been staged that ousted several regents for the boy emperor. Between 1861 and 1873, she and the Empress Dowager Ci'an, who had been Xianfeng's empress, served as regents for Tongzhi, \"ruling from behind the curtain.\"[c] Cixi, however, proved to be the more assertive of the two women. Following the emperor's death in 1875, Cixi's nephew, the Guangxu Emperor took the throne, and another regency began. In the spring of 1881, Ci'an suddenly died, aged only forty-three, leaving Cixi as sole regent.","editDateTime":"2013-12-10 19:18:46","resourceCategoryId":1,"dynastyId":15,"x":517,"y":426,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":324,"name":"Boxers","description":"In the years before the turn of the century, the Boxers United in Righteousness emerged as a violent anti-foreign force in North China. In 1900 local groups of Boxers, in the \"Boxer Rebellion,\" murdered large numbers of Chinese Christians and then converged on Beijing to besiege the Foreign Legation Quarter. The Eight-Nation Alliance then entered China without diplomatic notice or permission. Cixi declared war on all eight nations, only to lose control of Beijing after a short but hard fought campaign. She fled to Xi'an. The victorious alliance listed scores of demands on the Qing government, including compensation for their expenses in invading China and execution of complicit officials. Li Hongzhang was sent to negotiate and the alliance backed down from several of the demands.","editDateTime":"2013-12-10 19:19:40","resourceCategoryId":1,"dynastyId":15,"x":422,"y":451,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":0},{"id":325,"name":"Fall of the dynasty","description":"By the early 20th century, mass civil disorder had begun and continuously grown. To overcome such problems, Empress Dowager Cixi issued an imperial edict in 1901 calling for reform proposals from the governors-general and governors and initiated the era of the dynasty's \"New Policy\", also known as the \"Late Qing Reform\". The edict paved the way for the most far-reaching reforms in terms of their social consequences, including the creation of a national education system and the abolition of the imperial examinations in 1905.","editDateTime":"2013-12-10 19:20:27","resourceCategoryId":1,"dynastyId":15,"x":272,"y":251,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":326,"name":"Central government agencies","description":"The Qing Dynasty inherited many important institutions from the preceding Ming Dynasty. The formal structure of the Qing government centered on the Emperor as the absolute ruler, who presided over six Boards (Ministries), each headed by two presidents[e] and assisted by four vice presidents. In contrast to the Ming system, however, Qing ethnic policy dictated that appointments were split between Manchu noblemen and Han officials who had passed the highest levels of the state examinations. The Grand Secretariat, which had been an important policy-making body under the Ming Dynasty, lost its importance during the Qing Dynasty and evolved into an imperial chancery. The institutions which had been inherited from the Ming Dynasty formed the core of the Qing \"outer court,\" which handled routine matters and was located in the southern part of the Forbidden City.","editDateTime":"2013-12-10 19:21:30","resourceCategoryId":1,"dynastyId":15,"x":343,"y":230,"resourceTypeId":1,"iconName":"icon_history","dynastyPeriod":1},{"id":348,"name":"Qing Emperors","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-10 19:49:14","resourceCategoryId":1,"dynastyId":15,"x":547,"y":321,"resourceTypeId":3,"iconName":"icon_history","dynastyPeriod":2}]},{"id":2,"name":"society","chinese":"社会","iconName":"icon_society","resources":[{"id":327,"name":"Administrative divisions","description":"Qing China reached its largest extent during the 18th century, when it ruled China proper (eighteen provinces) as well as the areas of present day Manchuria (Northeast China), Inner Mongolia, Outer Mongolia, Xinjiang and Tibet, at approximately 13 million km2 in size. There were originally 18 provinces, all of which in China proper, but later this number was increased to 22, with Manchuria and Xinjiang being divided or turned into provinces. Taiwan, originally part of Fujian province, became a province of its own in the 19th century, but was ceded to the Empire of Japan following the First Sino-Japanese War by the end of the century. In addition, many surrounding countries, such as Korea (Joseon Dynasty), Vietnam and Nepal, were tributary states of China during much of this period. The Katoor Dynasty of Afghanistan also paid tribute to the Qing Dynasty of China until the mid-19th century. During the Qing Dynasty the Chinese claimed suzerainty over the Taghdumbash Pamir in the south west of Tashkurgan Tajik Autonomous County but permitted the Mir of Hunza to administer the region in return for a tribute. Until 1937 the inhabitants paid tribute to the Mir of Hunza, who exercised control over the pastures. Khanate of Kokand were forced to submit as protectorate and pay tribute to the Qing dynasty in China between 1774 and 1798.","editDateTime":"2013-12-10 19:22:10","resourceCategoryId":2,"dynastyId":15,"x":455,"y":233,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":328,"name":"Territorial administration","description":"The original provinces of Qing China was based on the fifteen administrative units set up by the Ming Dynasty, though some minor reforms took place to become the eighteen provinces (for example, Huguang was split into Hubei and Hunan provinces). Adopted the model used by the Yuan and Ming dynasties, the Qing provincial bureaucracy also contained three commissions: one civil, one military, and one for surveillance. Each province was administered by a governor and a provincial military commander. Below the province were prefectures operating under a prefect, followed by subprefectures under a subprefect. The lowest unit was the county, overseen by a magistrate. These areas under the administration of the eighteen provinces are also known as \"China proper\". The position of viceroy or governor-general was the highest rank in the provincial administration. There were eight regional viceroys in China proper, each usually took charge of two or three provinces. The Viceroy of Zhili, who was responsible for the area surrounding the capital Beijing, is usually considered as the most honorable and powerful viceroy among the eight.","editDateTime":"2013-12-10 19:23:13","resourceCategoryId":2,"dynastyId":15,"x":536,"y":262,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":329,"name":"Beginnings and early development","description":"The development of the Qing military system can be divided into two broad periods separated by the Taiping Rebellion (1850–1864). The early Qing military was rooted in the Eight Banners first developed by Nurhachi as a way to organize Jurchen society beyond petty clan affiliations. There are eight banners in all, differentiated by colours. The banners in their order of precedence were as follows: yellow, bordered yellow (i.e. yellow banner with red border), white, red, bordered white, bordered red, blue, and bordered blue. The yellow, bordered yellow, and white banners were collectively known as the \"Upper Three Banners\" and were under the direct command of the emperor. Only Manchus belonging to the Upper Three Banners, and selected Han Chinese who had passed the highest level of martial exams were qualified to serve as the emperor's personal bodyguards. The remaining Banners were known as \"The Lower Five Banners\" and were commanded by hereditary Manchu princes descended from Nurhachi's immediate family, known informally as the \"Iron Cap Princes\". Together they formed the ruling council of the Manchu nation as well as high command of the army.","editDateTime":"2013-12-10 19:23:45","resourceCategoryId":2,"dynastyId":15,"x":610,"y":241,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":331,"name":"Transition and modernization","description":"Early during the Taiping Rebellion, Qing forces suffered a series of disastrous defeats culminating in the loss of the regional capital city of Nanjing in 1853. The rebels massacred the entire Manchu garrison and their families in the city and made it their capital. Shortly thereafter, a Taiping expeditionary force penetrated as far north as the suburbs of Tianjin in what was considered the imperial heartlands. In desperation the Qing court ordered a Chinese mandarin, Zeng Guofan, to organize regional and village militias into a standing army called tuanlian to contain the rebellion. Zeng Guofan's strategy was to rely on local gentries to raise a new type of military organization from those provinces that the Taiping rebels directly threatened. This new force became known as the Xiang Army, named after the Hunan region where it was raised. The Xiang Army was a hybrid of local militia and a standing army. It was given professional training, but was paid for out of regional coffers and funds its commanders — mostly members of the Chinese gentry — could muster. The Xiang Army and its successor, the Huai Army, created by Zeng Guofan's colleague and student Li Hongzhang, were collectively called the \"Yong Ying\" (Brave Camp). ","editDateTime":"2013-12-10 19:25:21","resourceCategoryId":2,"dynastyId":15,"x":375,"y":358,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":332,"name":"Society","description":"The most significant fact of early and mid-Qing social history was population growth. The population doubled during the 18th century. People in this period were also remarkably on the move. There is evidence suggesting that the empire's rapidly expanding population was geographically mobile on a scale, which, in term of its volume and its protracted and routinized nature, was unprecedented in Chinese history. Indeed, the Qing government did far more to encourage mobility than to discourage it. Migration took several different forms, though might be divided in two varieties: permanent migration for resettlement, and relocation conceived by the party (in theory at least) as a temporary sojourn. Parties to the latter would include the empire's increasingly large and mobile manual workforce, as well as its densely overlapping internal diaspora of local-origin-based merchant groups. It would also included the patterned movement of Qing subjects overseas, largely to Southeastern Asia, in search of trade and other economic opportunities.","editDateTime":"2013-12-10 19:25:56","resourceCategoryId":2,"dynastyId":15,"x":464,"y":399,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":333,"name":"Economy","description":"By the end of the 17th century, the Chinese economy had recovered from the devastation caused by the wars in which the Ming Dynasty were overthrown, and the resulting breakdown of order.  In the following century, markets continued to expand as in the late Ming period, but with more trade between regions, a greater dependence on overseas markets and a greatly increased population. After the re-opening of the southeast coast, which had been closed in the late 17th century, foreign trade was quickly re-established, and was expanding at 4% per annum throughout the latter part of the 18th century. China continued to export tea, silk and manufactures, creating a large, favorable trade balance with the West. The resulting inflow of silver expanded the money supply, facilitating the growth of competitive and stable markets.","editDateTime":"2013-12-10 19:26:18","resourceCategoryId":2,"dynastyId":15,"x":531,"y":438,"resourceTypeId":1,"iconName":"icon_society","dynastyPeriod":1},{"id":341,"name":"Ten Thousand Miles along the Yellow River","description":"assets/data/images/qing_Ten_Thousand_Miles_along_the_Yellow_River.jpg","editDateTime":"2013-12-10 19:35:18","resourceCategoryId":2,"dynastyId":15,"x":355,"y":345,"resourceTypeId":2,"iconName":"icon_society","dynastyPeriod":2},{"id":345,"name":"The Qing Dynasty Part02","description":"assets/data/videos/The_Qing_Dynasty_Part02.webm","editDateTime":"2013-12-10 19:46:12","resourceCategoryId":2,"dynastyId":15,"x":480,"y":456,"resourceTypeId":3,"iconName":"icon_society","dynastyPeriod":2},{"id":346,"name":"The Qing Dynasty Part 01","description":"assets/data/videos/The_Qing_Dynasty_Part_01.webm","editDateTime":"2013-12-10 19:47:28","resourceCategoryId":2,"dynastyId":15,"x":564,"y":473,"resourceTypeId":3,"iconName":"icon_society","dynastyPeriod":2}]},{"id":3,"name":"culture","chinese":"文化","iconName":"icon_culture","resources":[{"id":330,"name":"Peace and stagnation","description":"Banner Armies were broadly divided along ethnic lines, namely Manchu and Mongol. Although it must be pointed out that the ethnic composition of Manchu Banners was far from homogeneous as they included non-Manchu bondservants registered under the household of their Manchu masters. As the war with Ming Dynasty progressed and the Han Chinese population under Manchu rule increased, Hong Taiji created a separate branch of Han Banners to draw on this new source of manpower. However these Han bannermen were never regarded by the government as equal to the other two branches due to their relatively late addition to the Manchu cause as well as their Han Chinese ancestry. The nature of their service—mainly as infantry, artillery and sappers, was also alien to the Manchu nomadic traditions of fighting as cavalry. Furthermore, after the conquest the military roles played by Han bannermen were quickly subsumed by the Green Standard Army. The Han Banners ceased to exist altogether after the Yongzheng Emperor's banner registration reforms aimed at cutting down imperial expenditures.","editDateTime":"2013-12-10 19:24:39","resourceCategoryId":3,"dynastyId":15,"x":503,"y":323,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":1},{"id":334,"name":"Arts and culture","description":"Under the Qing, traditional forms of art flourished and innovations were made at many levels and in many types. High levels of literacy, a successful publishing industry, prosperous cities, and the Confucian emphasis on cultivation all fed a lively and creative set of cultural fields.\r\nThe Manchu emperors were generally adept at poetry and often skilled in painting, and offered their patronage to Confucian culture. The Kangxi and Qianlong Emperors, for instance, embraced Chinese traditions both to control them and to proclaim their own legitimacy. The Kangxi Emperor sponsored the Peiwen Yunfu, a rhyme dictionary published in 1711, and the Kangxi Dictionary published in 1716, which remains to this day an authoritative reference. The Qianlong Emperor sponsored the largest collection of writings in Chinese history, the Siku Quanshu, completed in 1782. Court painters made new versions of the Song Dynasty masterpiece, Zhang Zeduan's Along the River During the Qingming Festival whose depiction of a prosperous and happy realm demonstrated the beneficence of the emperor. The emperors undertook tours of the south and commissioned monumental scrolls to depict the grandeur of the occasion. Imperial patronage also encouraged the industrial production of ceramics and Chinese export porcelain.","editDateTime":"2013-12-10 19:26:47","resourceCategoryId":3,"dynastyId":15,"x":373,"y":301,"resourceTypeId":1,"iconName":"icon_culture","dynastyPeriod":1},{"id":335,"name":"Landscape in the Style of Huang Gongwang","description":"assets/data/images/qing_Landscape_in_the_Style_of_Huang_Gongwang.jpg","editDateTime":"2013-12-10 19:28:14","resourceCategoryId":3,"dynastyId":15,"x":488,"y":482,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":336,"name":"The Sixteen Luohans","description":"assets/data/images/qing_The_Sixteen_Luohans.jpg","editDateTime":"2013-12-10 19:29:39","resourceCategoryId":3,"dynastyId":15,"x":494,"y":303,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":1},{"id":337,"name":"Landscapes Painted for Yuweng","description":"assets/data/images/qing_Landscapes_Painted_for_Yuweng.jpg","editDateTime":"2013-12-10 19:30:39","resourceCategoryId":3,"dynastyId":15,"x":221,"y":248,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":338,"name":"Landscapes after Ancient Masters","description":"assets/data/images/qing_Landscapes_Painted_for_Yuweng.jpg","editDateTime":"2013-12-10 19:31:36","resourceCategoryId":3,"dynastyId":15,"x":294,"y":241,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":339,"name":"Whiling Away the Summer","description":"assets/data/images/qing_Whiling_Away_the_Summer.jpg","editDateTime":"2013-12-10 19:32:33","resourceCategoryId":3,"dynastyId":15,"x":374,"y":186,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":340,"name":"Landscapes and Trees","description":"assets/data/images/qing_Landscapes_and_Trees.jpg","editDateTime":"2013-12-10 19:34:14","resourceCategoryId":3,"dynastyId":15,"x":360,"y":255,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":342,"name":"Wooded Mountains at Dusk","description":"assets/data/images/qing_Wooded_Mountains_at_Dusk.jpg","editDateTime":"2013-12-10 19:36:15","resourceCategoryId":3,"dynastyId":15,"x":451,"y":305,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":343,"name":"The Palace of Nine Perfections","description":"assets/data/images/qing_Wooded_Mountains_at_Dusk.jpg","editDateTime":"2013-12-10 19:37:33","resourceCategoryId":3,"dynastyId":15,"x":432,"y":389,"resourceTypeId":2,"iconName":"icon_culture","dynastyPeriod":2},{"id":344,"name":"qian long sheng shi","description":"assets/data/videos/The_History_of_Zhou_Dynasty.webm","editDateTime":"2013-12-10 19:45:11","resourceCategoryId":3,"dynastyId":15,"x":399,"y":461,"resourceTypeId":3,"iconName":"icon_culture","dynastyPeriod":2}]},{"id":4,"name":"military","chinese":"军事","iconName":"icon_military","resources":[{"id":347,"name":"Chinese Armor Ming & Qing Dynasty","description":"assets/data/videos/Chinese_Armor_Ming_&_Qing_Dynasty.webm","editDateTime":"2013-12-10 19:48:21","resourceCategoryId":4,"dynastyId":15,"x":624,"y":229,"resourceTypeId":3,"iconName":"icon_military","dynastyPeriod":2}]},{"id":5,"name":"technology","chinese":"科技","iconName":"icon_technology","resources":[]},{"id":6,"name":"introduction","chinese":"介绍","resources":[]},{"id":7,"name":"general","chinese":"普通","resources":[]}],"mapConfigs":[{"id":35,"period":0,"dynastyId":15,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":95,"mapZ":1.55},{"id":36,"period":1,"dynastyId":15,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":95,"mapZ":1.55},{"id":37,"period":2,"dynastyId":15,"startX":570,"startY":409,"startR":20,"endX":0,"endY":0,"endR":500,"delay":60,"scale":110,"mapZ":1.43}],"introAudiosState":1,"introAudios":[{"id":0,"audioId":"qing_0","audio":"assets/data/audios/qing_0.mp3","text":"Before Qing's establishment","state":1},{"id":1,"audioId":"qing_1","audio":"assets/data/audios/qing_1.mp3","text":" there was a regime called 'Latter Jin' that had been set up by Nurhachu","state":1},{"id":2,"audioId":"qing_2","audio":"assets/data/audios/qing_2.mp3","text":" leader of the Man Ethnic Minority","state":1},{"id":3,"audioId":"qing_3","audio":"assets/data/audios/qing_3.mp3","text":"Actually","state":1},{"id":4,"audioId":"qing_4","audio":"assets/data/audios/qing_4.mp3","text":" Man people were the offspring of the Nuzhen people","state":1},{"id":5,"audioId":"qing_5","audio":"assets/data/audios/qing_5.mp3","text":" who had always been living in Northeast China","state":1},{"id":6,"audioId":"qing_6","audio":"assets/data/audios/qing_6.mp3","text":"After reunifying all the Nuzhen tribes, Nurhachu proclaimed himself emperor in 1616","state":1},{"id":7,"audioId":"qing_7","audio":"assets/data/audios/qing_7.mp3","text":"Thus a new regime called Latter Jin","state":1},{"id":8,"audioId":"qing_8","audio":"assets/data/audios/qing_8.mp3","text":" was founded in Hetu Ala (in current Liaoning Province)","state":1},{"id":9,"audioId":"qing_9","audio":"assets/data/audios/qing_9.mp3","text":" during the reign of Emperor Shenzong of the Ming Dynasty (1368 - 1644).","state":1}]}]